[{"name":"Salem Opry House","id":"172662969578867"},{"name":"Sales House","description":"Consumer&Event marketing - SALES HOUSE si uvědomuje prodejní tlak, který je vyvíjen na koncového zákazníka, a proto vhodnou kombinací btl aktivit vytváří jedinečný prostor k upoutání pozornosti spotřebitele a ovlivňuje jeho nákupní rozhodování.\n\nSales services&Outsourcing - SALES HOUSE Vám umožní věnovat se Vaší práci - obchodu. Zároveň zůstanete flexibiní a ověříte si tak efektivnost Vaší investice do obchodní struktury. SALES HOUSE řešení Vám velmi rychle umožní na klíč postavit obchodní tým šitý na míru.\n\nData management - SALES HOUSE chápe sběr dat z terénu jako zpětnou vazbu informací od spotřebitele k výrobci a se snaží vyvíjet on-line aplikacie, které jsou \"šité na míru\", a které maximalizují efektivitu a přehled výkonnosti v terénu. \n\nRetail marketing&Consultancy - SALES HOUSE nabízí analýzu a následné poradenství v oblasti retail marketingu. Retail marketing je nejrychleji rozvíjející se oblast marketingu a konkrétně maloobchodní sektor zaznamenává celosvětově významý růst.","id":"400983503304962"},{"name":"House Sale","description":"HOUSE LOCATED AT NAMUGONGO (RIVERSIDES ESTATES) ON HALF AN ACRE. CONDUCIVE AND QUIET ENVIRONMENT. ","id":"651212638299175"},{"name":"House Sale","description":"I am Cyrel Matutina, a Realtor from Cavite, Philippines. This page is dedicated to update and give the readers relevant information about residential development in Nuvali, Sta. Rosa, Laguna specifically Avida Land, an Ayala Land company. It also aims to guide potential buyers and investors achieve their real estate investments and home ownership goals.\n\nMy team is committed to help you every step of the way towards owning your dream home and property investments.\n\nFor questions on any of the info on this site, or to schedule an appointment, – please call me at 0917-648-8515 or send me an email at: avidahomes@gmail.com.  \nPRC REB License Number 019581.\n\n\nTerms and Conditions of Use: \n\n\nThis is a personal page. The opinions expressed here represent my own and not those of the developer.\n\nAll content provided on this page is for informational purposes only. ","id":"848297018568427"},{"name":"House Sales Batemans Bay","description":"Real Estate, Valuation, Project Marketing, Photography, Property Consultancy.\n\nA comprehensive and continuous, 35 years experience in the property industry as a property consultant, valuer, real estate agent, land economist and propject marketing and sales manager. \nPast director on The Professionals Real Estate Group's NSW & VIC, National and International boards.\n\nSpecialties;\nProperty development, Property Sales and Marketing,\nPhotography and Internet Marketing.\n","id":"179338462139741"},{"name":"Salem House Restaurant","description":"You choose up to 4 meats, 5 sides, bread, drink, and dessert starting @ 12.50.\n An awesome deal for home-cooked food in a casual atmosphere. This option is offered Wed-Fri starting @4pm and all day Sat &Sun. LUNCH SPECIALS include sandwiches, burgers, wraps,salads, chicken tenders, raviolli and more starting @5.95 and are offered Wed- Fri from 11am-4pm. Come try our homemade desserts. Catering is available. ","id":"236648509754356"},{"name":"Sunshine Coast - House Sales & Rentals Privately","id":"709151502496358"},{"name":"In House Sales and Lettings","description":"Hello, we are In House...\n\n…and we're here to make it easy for you to move home (and maybe even enjoy the journey too).\n\nIn House was founded by Steve Puddifoot in 2007. After working as a regional director for the two largest estate agency chains in the UK, Steve decided that house sellers deserve straight talking honest advice and their properties needed modern dynamic marketing methods. So In House was born!\n\nSince then we've helped hundreds of people move on with their lives in every way, and after opening our second branch in the busy Orchard centre in Didcot we have become the most recognisable and dynamic agent in the area.\n\nSo, how have we done it? Why do our properties get more attention and stand out from others? Is it our carefully chosen team of property experts? Is it our obsessive attention to detail? Or is it simply that if you do a fantastic job people spread the word?\n\nOne thing is for sure, we are here for you from our sale boards to keys. Whether you need a cleaner, solicitor or just a chat, we will be what you need, when you need it. That’s our promise to you.\n\nThis is us and we are on your team - lets sell your home!","id":"119325284823108"},{"name":"House Sale","id":"1557431287875503"},{"name":"House Clearance Sales","id":"689707104452772"},{"name":"House For Sale Jacksonville Florida","description":"This is a riverfront community with docks, 30 minutes south of Jacksonville. Saint Johns County is renowned for having some of the best schools in the state, making it a very popular area. It is close enough to all the things to do in Jacksonville and Mandarin, without being in the midst of heavy traffic. This location is incredibly convenient to Jacksonville, the Beaches, and St. Augustine.\n","id":"1409437495999523"},{"name":"House and Lot for Sale in Greenwoods Pasig","id":"262961627198272"},{"name":"House Sales Spain","id":"628695267147859"},{"name":"Tn House Sales","description":"Buying your dream home or selling your current home is one of the most significant decisions you may make in a lifetime. It can be overwhelming researching listings, figuring current pricing and what the local market trends are. The good news is that you don't have do it alone.\n\nWith a real estate professional on your side that can presents you with local resources and knowledge of the East Tennessee area, your deal will be less stressful. \n\nAnd I want to be your agent! Let me help you find the perfect home to fall in love with. If you are looking to sell your home, let me help find the buyer that is looking for your home to buy.\n\nI am a full time Realtor that loves to help buyers and sellers fulfill their dreams of home ownership. We offer our service in Blount County, Loudon County, Sevier County and Knox County, areas. \n\nOur office is in Maryville and we have focuses listing in Maryville, Alcoa, Townsend, Walland, Louisville and the Friendsville areas. \n\nPlease don't hesitate to contact me if you have any questions about the buying or selling process, current listings, or questions about the market in general. I look forward to working with you to meet your real estate goals.\n\nTo learn more about how I can help you buy or sell a home, contact me today!\nhttp:\/\/www.tnhousesales.com\/maryville-homes-for-sale-popular-searches\n","id":"279319252275234"},{"name":"Fast House Sales","description":"We are ready to make fast no-obligation cash offers on your property. You will pay no commissions and we can immediately start paying your mortgage payments to provide relief from cash flow pressures.\n\nWe have been buying and selling properties for 12 years all around Australia - we and encourage you to ensure you are dealing with an experienced professional buyer when looking for a solution to your situation.\n\nWe will make you a cash offer to buy your home quickly and with minimal fuss.\n\nThis way you can have your house sold in days, no matter what condition it is in or how much repair work it needs. We will come to inspect your home, talk to you about it and then they give you a no-obligation offer.\n\nWe Buy Houses Direct from Property Owners! \nNo Agents Fees! \nNo Obligation to You! \nNo Repairs Required! \nNo Hassles!","id":"290738414313671"},{"name":"SKÖNT Sale House","id":"1427230294166476"},{"name":"Private House Sales Hawke's Bay","description":"This page is designed to be an advertising platform for those wanting to sell or buy property in Hawke's Bay without an agent.\n\nVendors - list your property here! Either private message your property details and we will post on your behalf OR post your property details directly onto the timeline and under the appropriate photo album by value.\n\nPurchasers - feel free to browse the properties and make enquiries.\n\nNB. We advise you consult a lawyer before you seal the deal on a property.  \n\nPage admin is not an agent but is simply providing a free forum for buyers and sellers to meet and discuss private home sales.\n","id":"1657666894464577"},{"name":"Salem Witch House","id":"879436302102697"},{"name":"Sales House","description":"A SALES HOUSE nasceu com a expertise de seu fundador de anos dedicados inteiramente a vendas.\n \nCom o objetivo de capacitar empresas e pessoas para melhores performances em vendas, aliamos o conhecimento especifico das rotinas da área comercial, utilizando técnicas, com procedimentos e metodologias inteligentes para sua empresa performar o s melhores resultados.\n\nExistimos para fazer a sua organização vender mais.","id":"1486236858289858"},{"name":"House me - Sales","id":"258252370992079"},{"name":"Quick House Sales","id":"264842776996957"},{"name":"House of Sales","id":"1560990524177543"},{"name":"House for sale philippines","id":"624198067599675"},{"name":"House for sale PH","id":"631469823650715"},{"name":"House for Sale in Trinidad","id":"345345895580542"},{"name":"Salem House Press","id":"301799513345993"},{"name":"House For Sale","id":"1496306077320371"},{"name":"Private House Sales - Christchurch, NZ","description":"As the page admin, I am facilitating the introduction of private sellers and private buyers only.\n","id":"1037658816250414"},{"name":"Salem House Banquet & Reception Hall","id":"126523930621"},{"name":"House Sale Leads","id":"675754205867418"},{"name":"House and Lot For Sale Philippines","id":"116678735020199"},{"name":"House and Lot for Sale in Bulacan","id":"220876398034674"},{"name":"House and Lot for Sale in Quezon City\/Metro Manila\/Philippines","id":"372378799507838"},{"name":"Salem Witch House","id":"1586879738204224"},{"name":"Salem House","description":"- Shop freeship cho các Q. P Nhuận, T Bình, T Phú, B Thạnh, Q.1, 3\n- Shop không nhận đổi trả nhé\n- Liên hệ với shop: 090 2328 007 - 0939 909 852\n- Ship toàn quốc","id":"1547462478856378"},{"name":"House and Lot For Sale Near SM MOA, and Airport","description":"Like and share to your friends : http:\/\/www.facebook.com\/pages\/House-and-Lot-For-Sale-Near-SM-MOA-and-Airport\/549703931736812","id":"549703931736812"},{"name":"Sales Experts House","description":"Sales Experts House is a training and consulting company specialized in the sales performance improvement covering all levels with different training methodologies according to each sales industry","id":"204821436285887"},{"name":"Salerno House","description":"Salerno House è un appartamento in un palazzo signorile degli anni ’40, in pieno centro sul corso principale della città, una strada pedonale dove si può passeggiare in tutta tranquillità. Bar ristoranti, negozi si concentrano proprio nella zona.\nPer noi è un piacere ospitare. Animati, come siamo, da una forte passione di condividere esperienze e culture diverse, saremo lieti di fornirvi utili suggerimenti sulle escursioni da fare e i posti da vedere, sui ristoranti all’esterno, sullo shopping.\n\nLe nostre stanze sono molto ampie e con alti soffitti. Dotate di TV Led-Lcd, connessione ad Internet Wi-Fi gratuita, asciugacapelli e balcone privato o finestra.\n\n\n\nIl nostro B&B è composto da 2 unità abitative.\n\nLa camera con soggiorno è una mini-suite composta da camera con letto matrimoniale, soggiorno con divano letto matrimoniale e bagno privato, accessibile dal soggiorno, con grande vasca circolare.\n\nLe camere della mini-suite hanno un balcone e ampie finestre, il soggiorno è dotato di un tavolo con 4 sedie, di divano letto e di scaffale con Tv Led 32 pollici.\n\nLa camera matrimoniale standard (camera verde) è composta da letto matrimoniale e bagno privato esclusivo ed ha una grande finestra.\n\nIl costo della stanza per notte comprende la colazione, pulizia e cambio biancheria ogni 2 giorni, e tassa di soggiorno.\n\nSi applica una tariffa aggiuntiva di € 15 per l’aggiunta di un letto singolo in camera.\nAbbiamo a disposizione culla gratis per bambini fino ai 3 anni\nLa colazione è servita indicativamente dalle 8.30 alle 10.00, salvo accordi diversi all’arrivo.","id":"1466822026897977"},{"name":"Salem House","description":"SALEM House bán online. Còn hình là còn hàng nha ^ ^\n\nXem hàng từ 09AM - 07PM mỗi ngày tại địa chỉ: 138\/54 Nguyễn Duy Cung, P.12, Q. Gò Vấp, TP.HCM\n\nLiên hệ: 0908.384.465 (Ms. Quỳnh) - 01676.916.154 (Ms. Trang)\nEmail: samantha3787@gmail.com","id":"844434062261359"},{"name":"Salem House of Pizza","id":"120407941309059"},{"name":"Sheikh Salem House","description":"One of the most unique small hotels right on the beach in Dahab. We are next to the Eel Garden and situated at the end of the beach footpath. Offering a peaceful and relaxing base for exploring Dahab and the Red Sea. We offer many types of rooms including budget style camp rooms, budget ensuite rooms and rooms with air conditioning. Our sea view suites are directly on the beach with amazing views of the Red Sea and Saudi Arabia.","id":"45496643122"},{"name":"Salem Bird House","id":"1417196445227881"},{"name":"Salem House Interiors","description":"Our firm belief that interior design offers a lifetime opportunity to solve daily problems that affect on lives of our clients and their activities. our goals is to create a place is particular to the person and his\/her activities.\n \nIt is imperative that each and every single project is treated as a unique, where focus and attention is paid to every corner, every detail and every fold of texture. the requirements of our clients releasing us towards expressing this difference every single time.\n","id":"257706527686837"},{"name":"House and Lot for Sale in Laguna","description":"We offer Rent to Own affordable to high end House and Lot in Laguna located in San Pedro, Biñan, Santa Rosa, Cabuyao, and Calamba Laguna. We also have lisitings in Kawit, Silang, Dasmariñas, General Trias, Molino Bacoor in Cavite  as well as in Muntinlupa, Alabang, Sucat Metro Manila","id":"258541447635218"},{"name":"House & lot for sale!   -  Cagayan de Oro City & Misamis Oriental","id":"201273809991025"},{"name":"House and Lot\/Condo for Sale\/Rent in Subic Bay Freeport","id":"118334244995485"},{"name":"House for Sale","description":"Home for sale.  19 Pine Ledge Drive in desirable Windsor Pines development.  1 mile for Pine Point Beach, half a mile from Scarborough Marsh and Eastern Trail.  Walk to Blue Point Elementary School.  4 Bedroom, 2.5 baths over-sized garage, new granite countertops, 50 year architectural shingles, 16x20 shed, screened porch, large deck and landscaped patio, fireplace, hardwood floors, 6 panel pine interior doors, automatic sprinkler system.  Harmon pellet stove insert negotiable.\n\n$459,000\n\nQualified buyers viewing by appointment only 207-329-5380.\n","id":"1003538456346502"},{"name":"House Sales Selangor","id":"561004623957529"},{"name":"Salem House","description":"Cung cấp sỉ và lẻ quần áo thời trang ","id":"213225068837970"},{"name":"House and lot for sale thru Pag-ibig Financing","id":"198434336972846"},{"name":"House and Lot For Sale Nuvali Laguna","description":"NUVALI is a 2290-hectare property in Canlubang, Laguna. Ayala Lands being the master planner, Nuvali is turning out to be a promise land for investors and residents alike.","id":"252765384813496"},{"name":"Scottsbluff House sale by owner","description":"OPEN HOUSE SUNDAY MAY 24TH 1PM-4PM\nLAST PRICE REDUCED to 336,900. Lovely 1.5 story home & it's move in ready. \nFull finished square footage: 4,100.\nHouse has windows for lots of natural light. Gourmet Kitchen with granite countertops, two islands and stainless steel appliances. Spacious 05 rooms. Master suite with a walk in closet and a wall closet  & spa style bath with jet tub. Office room. Laundry room. 03 bathrooms. Lot of storage space.\nEnjoy the complete finished rebuild basement with recreation area, gym, play room, etc. Entertain on the huge patio surrounded by a new fenced yard and new sprinkle system.  Close to College & shopping and in a well sought neighborhood.\n","id":"1543124399297482"},{"name":"HOUSE for Rent\/sale","id":"775033649277246"},{"name":"House for Sale","id":"873817732691287"},{"name":"House and Lot for SALE Philippines","id":"224940824321339"},{"name":"Full House Elite Performance Stock Horse Sale","description":"selling 65 to 70 head of quality ranch and performance horses in the June 2015 SALE!  ...they all come with a FULL 10 DAY GUARANTEE! ","id":"111574975525612"},{"name":"House For Sale","id":"1597202630550800"},{"name":"Salem's house","description":"Welcome to Salem's house! \nnào bây giờ hãy cùng Salem đi thăm quan căn nhà  nhỏ của Salem nhé\nTrước hết hãy nói cho Salem biết bạn cần gì ?\nmột bộ ảnh đánh dấu một khoảng thời gian quan trọng trong cuộc đời , một lễ cưới hoành tráng , hay đơn giản là một cái áo sơ mi đúng chất vintage, mà thật thiếu nếu không có vài món phụ kiện nho nhỏ kèm theo đúng không ? \n\nHÃY ĐỂ SALEM GIÚP BẠN MỘT TAY!\n\ntớ tin chúng ta sẽ là những sự kết hợp thú vị \n\nnào còn chần chờ gì nữa ! hãy nói nhỏ cho tớ biết cậu cần gì nhé\n\ncall: 01297412903\nfb: Salem's house \nhẹn gặp lại bạn tại căn nhà của Salem lần nữa nhé\nSẽ nhớ cậu đấy ;)","id":"541248165929428"},{"name":"House For Sale","description":"PRICE R 2,600,000-00\nHOUSE FOR SALE IN BELA BELA\nPLOT SIZE 1400 sqm\nBUILDING SIZE 360 sqm - Total under roof space 520 sqm\n\nThis is a magnificent house with stylish finishes. This is a gem for the price. This stylish home is ideal for a family who loves to entertain. This is an enchanting family home oozing with atmosphere. Come and view this lovely property perfect for the entertainer.\n\nProperty details:\n3 x Bedrooms\t\n1 x Dining area\t\n2 x Bathrooms\n2 x Lounges\t\n80 sqm Entertainment Area\t\nLaundry\nStudy\t\nModern Kitchen\t\nJacuzzi\nHeated swimming pool\t\n3 x Undercover parking\t\nStaff accommodation\n4 x Garages\t\nSeparate Tool Room\t\n4 x Garages\n\nAwesome Extras!\nWater Cooling System in roof to keep the house cool during summer.\nAir Conditioners in all Bedrooms and TV room.\nBuilt in cupboards in all Bedrooms.\nMain Bedroom has Walk in closet with en suite Bathroom.\nElectric fencing with alarm system and 11 cameras\nLarge entertainment area Lapa 80 sqm (with enclosed bar)\nElectric and Gas stove\nBeautiful garden with irrigation\nStandby generator 15kva auto start at power failure\n3m x 3m wooden storage\n2m x 2m wooden room to be used as a sauna\n\nAll furniture & accessories negotiable with price!!!!!!!!!!!\n\nTerms & conditions apply!","id":"414540418724474"},{"name":"Sale Curry House","id":"196376817095223"},{"name":"Porter House Sales","id":"295053204038676"},{"name":"House and Lot for Sale in Iloilo City","id":"186747638098891"},{"name":"M. T. House Estate and Moving Sales","description":"Description of Services: Assistance with all aspects of inventories, cleaning, packing, valuation, and dispersal of your household contents for moving or estate purposes. Courteous and dedicated attention to art handling, shipping, auction house and donation matters, appraisals, and tag sales. We also conduct clean-outs, remove trash, and handle paperwork.","id":"118055828233551"},{"name":"House and Lot for Sale in Bacolod City","description":"House and Lot for Sale in Bacolod City","id":"347809258697097"},{"name":"Melville House Sale","description":"This page allows you to browse some of the latest listings in Melville by the estate agents who are in the region who have a website page advert on the MelvilleInfo.BIZ website. These are some of the companies listed on our Properties TAB on this website.","id":"1596681830559805"},{"name":"House Sale\/Rent Kuala Lumpur","id":"1587506821492823"},{"name":"High Speed House Sales","id":"624332877710476"},{"name":"House for Sale","description":"The luxury of living in the Prestigious Paramount Estates on a quiet cul-de-sac lot w\/stunning sunset and rocky woodland views. Recent upgrades, built-ins abound coupled w\/enough land to build a pool and even another house should you desire! Owner is a designer and has meticulously maintained this home. Each room has been designed with thoughtful consideration to both aesthetics and purposeful function. Nestled among charming and historic downtowns, yet the convenience of living just minutes from....four community train stations with direct service to NYC; three major malls and other shopping centers; Major Highways to NY and PA Rts. 287\/24\/80 Approx.: 35 min to Newark Airport and 65 min to LGA and JFK Airports; 45 min to NJ and PA ski resorts and 1 Hr to NJ Shore.","id":"861758967203749"},{"name":"House For Sale","description":"Property  Details :\n_________________________________________________________\n \n\t·         Bed(s): 5\n \n\t·         Bath(s): 5  \n\t \n\t·         Property Type:  Residential \n \n\t·         Type: Two- Story House\n\t \n\t·         Cable\/Satellite TV\n\t \n\t·         Balcony\n\t \n\t·         All Granite Floors\n\t \n\t·         Telephone \n\t \n\t·         Internet  Ready\n\t \n\t·         Hot & Cold Water Supply System\n\t \n\t·         Formal  Gourmet-Style Kitchen,  and  Dirty Kitchen \n \n\t·         Foyer\n\t \n\t·         Dining Area\n\t \n\t·         Bar Area\n \n\t·         Maid's Room  with Own Toilet\n \n\t·         Walk -in Closet\n\t \n\t·         Has it own private Transformer (80KVA)\n\t \n\t·         Huge Patio  with Beautiful View\n \n\t·         Generator  with Hook-up Ready (220V)\n\t \n\t·         Beautifully Landscaped\n\t \n\t·         Big Storage Room (outside the house)\n\t \n\t·         Large Water Tank \n\t \n\t·         Fully Secured Fence\n\t \n\t·         Surveillance Camera \n\t \n\t·         Carport( 2cars) \n \n\t·         Floor Area: 500 sq. meters\n \n\t·         Lot size-Sq.\/Ft: 1000 sq. meters\n \n\t·         Age (years): reconstructed\/major expansion   in 2011\n \n\t·         Date listed on  June 27 2013\n \n\t·         Neighborhood:  Olongapo City\n\n-- Height 2 floors\n Construction Concrete\n Strength Reinforced concrete columns and beams\n Roofing Galvanized Iron Sheets\n\n AREA DETAILS \n ------------------------------------------------------------------------------------------\n Security This property is not in a gated community. \n Neighborhood Area Suburban residential\n Proximity to... \n\n General Hospital 15 min \n Downtown Area 15 min \n Seaside 10 min \n Shopping Mall 10 min \n Police Station 15 min \n Fire Station 15 min \n Domestic Airport 30 min \n International Airport 30 min \n\n \n \nDescription:\n------------------------------------------------------------------------------------------------\n \nThis custom made house is located in  Old Cabalan, Olongapo  City. Feel the clean breeze, with lots of trees, and a quiet location- far from the traffic  but only 10 minutes from city  center and a quick walk to a jeepney. The whole house was reconstructed\/more than doubled in size in year 2011.  This two story house has  3-regular BR plus 2-huge master suite bedrooms- each with their own master suite bathroom. All rooms are fully  air-conditioned including the kitchen. This house has a huge terrace (rooftop patio) with a gorgeous mountain view.  On the first level along with the kitchen and dining areas there is a built in home bar area so you can enjoy and relax.\nFor your added sense of security and comfort, the house was constructed with heavy gauge steel, and the external windows and doors all also have steel to provide protection.\n\nIt must be seen to appreciate! Clean title and the sale includes furnishings.\n\n\n For more Info:\nContact: +639475496261\/+639183197851","id":"546434372089153"},{"name":"House For Sale in Markham","description":"Family friendly, stable, parklike  neighbourhood.  Move in ready, spacious backsplit house on the quiet street.  Extensively updated (new kitchen, new bathrooms, new hardwood flooring throughout, new appliances, mostly new windows, new furnace and and new a\/c) meticulously kept and lovingly maintained.  90 seconds walk to Reesor Park elementary school, playground and Markham Tennis Club. Close to secondary school, state of art Cornell Community Centre and Markham-Stouffville hospital.  Shopping and fine dining nearby.  Backyard organic garden with variety of berry bushes, mature fruit trees; ready for urban gardener.","id":"841248139295225"},{"name":"Andrea Trujillo, In-House Sales Executive at Terrazas Miami","description":"My commitment is to exceed my clients’ expectations and provide a superior level of service. Confident and enthusiastic, with the ability to recognize real value, I will provide you with extensive knowledge of the Real Estate marketplace, and I am keen to make sure my client’s transactions are hassle-free. I am a member of the Miami Association of Realtors and National Associations of Realtors, and highly active in the Florida community. As a Realtor Associate, I have an unyielding commitment to building the entire community in a positive and progressive way. Whether buying, selling, or finding the perfect New Development Project or vacation home. I am happy to assist you with all of your Real Estate needs because your satisfaction is my priority!\n\nBuying or selling a home?\n\nPossibly looking for your first dream home, pre-construction or investment property? I am a committed professional, and will provide you with detailed information necessary for any buying or selling decision. First class service, and the latest market information, expert advice, reliability and integrity are required when buying or selling a home. As a motivated professional Real Estate Agent, it is my passion to excel at these traits, making sure that your experience working with me is beyond exceptional.","id":"444673728901661"},{"name":"House 4 Sale","id":"546280968836404"},{"name":"House for sale","id":"1484166248466241"},{"name":"House for Sale","id":"451774318314082"},{"name":"The Media Sales House","description":"The Media Sales House (TMSH) is a full service media sales agency providing a totally unique approach to outsourced media sales and consultancy for media owners. \n\nThere are 2 ways we can work together: \n•\tWe act as consultants to media businesses wanting to build, develop or augment in-house sales resource\n•\tWe provide experienced, passionate media sales professionals to media owners who do not have the time, inclination or budget to invest in an in-house sales team or who wish to bolster their existing team\n","id":"118992824961869"},{"name":"Davao House and Lot (for Sale)","id":"145151485514514"},{"name":"House for sale","id":"878024028915595"},{"name":"Open House Estate Sales","description":"We are a Household Liquidator founded in 1982.  We average over 100 sales per year and most of the sales are complete household closing.  We have been a member of the Milwaukee Better Business Bureau for the past 32 years with a A+ rating. We average 600 customers per sale.  Thanks for your interest","id":"621945207859407"},{"name":"House and Lot for Sale in Pampanga","description":"Looking for a House and Lot for sale in San Fernando Pampanga?\nAffordable and Easy Payment Schemes thru Bank, Inhouse And Pagibig Financing. Invest Now!\n\nWe have lots of inventories of lots, house and lot, homes and Properties for sale in San Fernando, Pampanga, Angeles, Mexico, Apalit, Mabalacat and other areas.\n\nWe are duly accredited by Solana Country Homes, Pueblo de Oro, Camella Pampanga. Havana Residences, Woodgrove Lots for Sale, Mawing Village, Bridgepointe Place, Tierra Vista, The Palms Lakeshore, Amaia Pampanga, Fiesta Communities, Mansfield, Timog Residences, Nouveau Residences, Mirus, Claremont and Hampton Orchards by Filinvest, Dizon Estate,Ciudad de Hizon, Punta Verde, Berkeley Residences, Clark Manor and many more. http:\/\/pinoyhouses.weebly.com\/ <<---Click here for more info....\n\n","id":"137061319763314"},{"name":"Saleem belts\/garments house","id":"1539504852990626"},{"name":"House and Lot For Sale in Bulacan Area","description":"We offer house and lot and lot only here in Bulacan.\n>>La Residencia, Calumpit Bulacan\n>>Villares, Villas at La Residencia, Calumpit Bulacan\n>>Sta. Clara Estates, Sta. Rita, Bulacan\n>>Green Estates North, Tiaong Guiguinto, Bulacan\n>>Tierra De Sta. Maria, Pulong Buhangin Guiguinto Bulacan","id":"164029530457436"},{"name":"Kuching HOUSE for SALE","id":"839086002787548"},{"name":"House4sale","description":"It is time to move on - This great 4,000 sq.ft. house on 6.4 acres in Las Vegas, NM is for sale! Let's see what social media can do... You may not be interested, but you may know someone who knows someone who... You get the idea :-)   Help me sell my house. More: http:\/\/www.realtor.com\/realestateandhomes-detail\/15-Alameda-Rd_Las-Vegas_NM_87701_M14485-89169?ex=NM564096264","id":"675212489158688"},{"name":"Salento House Restyling","description":"La Salento House Restyling srl è un’azienda che si occupa di progettazione architettonica e di intermediazione immobiliare, esperienza ed attenzione alle esigenze dei suoi clienti ne fanno la soluzione migliore per chiunque abbia deciso di vendere, comprare o ristrutturare la sua casa.","id":"293488154139717"},{"name":"House 4 Sale","id":"628828107248822"},{"name":"House for sale","id":"719321748080881"},{"name":"House and Lot For Sale in Gensan","id":"438334439569664"},{"name":"House Sale","id":"545782582174940"},{"name":"DREAM HOUSE Realty Sales","id":"680630908677291"},{"name":"House For Sale","id":"762081407207730"},{"name":"House and Lot for sale in Marikina City","id":"196102807158359"},{"name":"House for Sale","id":"363930763818279"},{"name":"House For Sale","id":"184878644984542"},{"name":"House and Lot For Sale in BF Homes Paranaque","description":"\nBF HOMES PROPERTIES FOR SALE\n\nProperties Available:\n1. Brand New Houses\n2. Brand New Single Detached House\n3. Townhouse \n4. Fully Renovated 2-Storey House   \n5. Brand New Bungalow House\n6. Fully Renovated Bungalow House\n7. Lots For Sale\n\nContact Nos:\n0915-9913727\n(02) 823-8325\n\nLook For: Adam Adonis\n\n\nHOW TO GET INSIDE THE SUBD.\n\n- FROM NORTH take SLEX\/C5 then sucat exit, turn right till you reach shoppewise\nthen turn left to president's ave.\n\n- from MANILA, baclaran coastal then straight ahead to sucat crossing NAIA, sm sucat, till you reach LOPEZ village then turn right to BF homes el grande\n\n\n- FROM DOWN SOUTH take slex, then sucat exit\n\n\n\n       ","id":"236087466444624"},{"name":"House and Lot for Sale - Taytay,rizal 0915-8559372","description":"FOR SITE VIEWING PLS. CALL:\nELY JUMAWAN\nSMART:      0929-8908201\nGLOBE:      0915-8559372\nTEL NO.:    (02)280-4378\nEmail add:  jumawanelyzar@yahoo.com\nSITE:          www.elyj624.multiply.com\nPAGES:      Forsalehouselotcondo at 09298908201\"\"\n","id":"256551811063755"},{"name":"Holly House Horse Sales","id":"1575716399343302"},{"name":"Westgate Resorts InHouse Sales Recruiting","id":"111415452224209"},{"name":"House for Sale","id":"890862394318979"},{"name":"Vito Sale House","id":"1399567147030077"},{"name":"HOUSE for Sale","description":"HOUSE for Sale\nThis fb page will help you and give you option to choose the right DREAM HOUSE that will FIT your budget and suitable location.\n\nI'am also helping you to reach your GOAL.","id":"847881005283343"},{"name":"Bainbridge House Barnyard Sales","description":"Bainbridge House Barnyard Sales\nWe offer a fine selection of new and used quality merchandise. Our merchandise changes on a regular basis. Our stock includes a unique mixture of goods ranging from fine antiques, unique collectibles, including Dept 56, Fenton, and Christopher Radko, games, knickknacks, electronics, furniture, hardware, housewares, tools and much more. You never know what you might find here, so be sure to check back to the barn often!\nIf you're a picker we can dicker!","id":"145844848887260"},{"name":"BD Sale House","description":"Order Placing & Payment System: \nFrom Amazon,bestbuy , ebay etc:\n* Choose your item from the e commerce website.\n*Send your link in the inbox of BdSaleHouse for purchase request.\n*Your Payment price in BDT will be quoted in reply. The Quoted price will comprise: Online Purchasing Price + Local Tax and BD Govt Tax as applicable + Conveyance Cost ( DHL\/Fedex etc) +  Service Charge. We assure you that the price would be as minimum as possible. We will also notify you likely time of receiving your items.\n* If you agreed upon our quoted price then you have to pay 60% of total price by credit\/ debit card, bank transfer, bkash,cash to BdSalehouse. Rest 40% has to pay on product delivery. \n\n# Cost Breakdown:\nProduct Cost:\nFrom $30 - 49 : Tk90\/USD\nFrom $50 - 500 : Tk85\/USD\nFrom $500+ : Tk80\/USD\n\nShipping Cost\nDHL Express Shipping : Tk800\/POUND(lb)\nRegular Shipping : Tk650\/POUND(lb)\n\nNote: For low weight products volumetric weight will be calculated. \nSome items have additional import tax. ie. laptop, smartphone, DSLR etc.\n\n# Pay us via Bank Deposit or bKash.\n\n-> Bank Account Name: BD Sale House\n-> Bank Account Number: 211.110.10991\n-> Dutch Bangla Bank Limited\n\n----------------------or----------------------\n-> Bank Account Name: NAF Fashion\n-> Bank Account Number: 211.110.10986\n-> Dutch Bangla Bank Limited\n\n---------------------or----------------------\n\n-> bKash Wallet: 01934-762575 (Personal Number)\n\n\n","id":"898941006802173"},{"name":"Saleable House","id":"565300136899164"},{"name":"House for Sale","description":"Townhouse & Single Attached Houses\nOffers complete amenities including Church, School, Bus Terminal, ","id":"241630069354726"},{"name":"House for Sale - SOLD","id":"285658221566824"},{"name":"House for sale","id":"630781833669315"},{"name":"House for sale","id":"541390799306042"},{"name":"House and Lot for Sale in Rodriguez (Montalban) Rizal","id":"288635401196788"},{"name":"House for sale In Addis Ababa","id":"235996283213669"},{"name":"House and Lot for Sale in Cebu","description":"Ang House and lot for sale in Cebu binoo ito para makatulong sa mga taong gusto magkabahay or mag invest dito sa Cebu.\n\nI Hope masiyahan kayo sa photos nang mga property na pino post ko.\n\nAdmin: Richard Andales Sarsalejo\n09331800888\n09087423999\nemail: richardsarsalejo@yahoo.com\ncebusubdivision@gmail.com","id":"143910395640365"},{"name":"House at Semenyih For Sales","id":"789200907823712"},{"name":"House for Sale","id":"1477427249196406"},{"name":"Bacolod House & Lot for Sale.","description":"WWW.BACOLODHL.WORDPRESS.COM","id":"593348630729160"},{"name":"Fast House Sale Kent","id":"943442442349810"},{"name":"House for Sale","description":"This 2002 sq. ft. residential home on county land. It has 3 bedrooms 3 baths, utility room, kitchen and dining area, living room, family room, and master suit. It has easy to maintain xeriscaping and natural landscaping which include a small rubber mulch play area. There is also a one car garage and home office that are detached from the home. The house is a large relaxing environment or can facilitate family growth. It has plenty of storage. It will also include a fridge, dishwasher, range oven, microwave, and washer and dryer.    ","id":"1415455705373132"},{"name":"House for Sale","id":"859318264098068"},{"name":"Cebu House and Lot For Sale","description":"Helping Filipino's Buy and Sell Homes Specializing in investment properties, rental and sale of condos, coops and townhouses, lot for whatever purposes. Facilitates property loan through Pag-ibig, Bank loan or In-house loan for those who can't provide basic requirements. ","id":"110435308994438"},{"name":"Puerto Princesa Palawan HOUSE and LOT for SALE","description":"Owner of Mybesthouses Realty & Brokerages Services, Puerto Princesa City, Palawan\nDo Investment Consultations and Forums\nInvested time on analyzing the entire Housing, Condominium projects & Lot for Residential and Commercial purposes in whole area of Palawan and neighboring cities and towns.\n\nHelping the country in the realm of Buying and Selling of Real Estate Properties. Specializing in investment properties, rental and sale of condos, coops and townhouses, lot for whatever purposes. Facilitates property loan through Pag-ibig, Bank loan or In-house loan for those who can't provide basic requirements.\n\nFor more informations pls feel free to contact:\nGlory Mae Secretaria Cuajotor\nMobile:\n(GLOBE)09355041181\n(SMART)09184128889\n(VIBER)09088146388\nPRC REG. License #: 9865\nMybesthuoses Realty Group\nGmail account: mybesthouses@gmail.com","id":"158845660966896"},{"name":"HOUSE for SALE","id":"1396676033906852"},{"name":"House F Sale","description":"\"Need to be pre-qualified for a loan or have proof of funds from lender in order to show the property\"\nExquisite New Construction on 3.8 Acres. One Level, Full Brick, Full Guttering, Side Entry Garage and a Circle Drive. Extraordinary Attention to Detail includes Lighted Slate Steps and Covered Front Porch with Barrel Ceiling. This home is Generator Ready with a 16-Seer AC and 96% Efficiency Heater. The Welcoming Foyer offers Travertine Tile Flooring, Wainscoting, Crown Molding, Vaulted Tray Ceiling and a Generous Coat Closet. The Elegant Formal Dining Room provides Bay Windows with Amazing Views of the Estate, Crown Molding and Vaulted Tray Ceiling. The Formal Living Room or Handsome Office is enhanced by Crown Molding and a Large Picture Window. Highlighted by Gorgeous Ceiling Detail is the Generous Family Room with Traditional Fireplace flanked by Two Built-In Display\/Book Cases. This home is wired with CAT-5 Cable. Conveniently located just off the Family Room is the European-Style Powder Room which offers Wainscoting, Crown Molding and Vessel Sink. The Inviting Breakfast Nook opens to the Kitchen and Family Room and features a Large Glass Door with access to the Covered Back Patio. The Culinary Kitchen is enhanced by 3cm Exotic Granite, Glass Tile Back Splash, Sit-Down Eating Bar and Specialty Storage. The Commercial-Grade Appliances are the Highlight of this Gorgeous Kitchen along with Ample Cabinetry, a Sit-Down Eating Bar plus a Walk-In Pantry Closet. The Utility Room provides Granite Counter Top, Tile Back Splash, Sink and Specialty Storage. The Master Bedroom Suite is \"King Friendly\" and enhanced by Tall Windows, Crown Molding and Ceiling Fan. The Lush Master Bath provides Double Sinks in a Chrome and Glass Vanity, Jetted Tub with Hand Sprays and Built-In Headrest plus Private Toilet Closet. The Sleek Walk-In Master Shower offers a Tropical Rain Shower Head and Body Sprays. The Walk-In Master Closet has ample hanging space and tons of storage. Bedrooms #2 & #3 are Large with Tall Windows, Crown Molding, Custom Ceiling Fans, Large Closet and a Pullman Bath that is shared between the two bedrooms. The Pullman Bath has Double Vanities with the Shower\/Tub Combo and Toilet being privately located. Bedrooms #4 & #5 could easily double as Master Bedrooms if needed. These bedrooms are Spacious with Tall Windows, Crown Molding, Large Closets, Ceiling Fans and Private Baths. The Covered Back Patio with Stained Concrete is plumbed for an outdoor kitchen. A pond is located on the southwest corner of the acreage and Livestock are Welcome! ","id":"1604750383075653"},{"name":"House for Sale - Wales","description":"For Sale - Iago, Nebo, LL26 0TB\n\nThis Facebook page has been put together and is the responsibility of the current owners but the sale is being handled by Iwan M. Williams, Estate Agents, Llanrwst:\n\n\"A traditional, recently renovated, character 2 bedroom cottage occupying a rural village setting within the Snowdonia National Park. Affording small entrance hall, living room and kitchen with large inglenook fireplace and cast iron log burner, two first floor bedrooms and shower room. Small forecourt area and outside store\/former W.C. Night storage heating and part double glazing. Viewing Recommended\"\n\n£79,950","id":"524344237639595"},{"name":"House for Sale","id":"422112594511670"},{"name":"House for Sale Philippines","description":"LOOKING FOR YOUR PERFECT HOME? INVESTMENT? VACATION OR RETIREMENT HOMES? We’ll help you find the property that fits your needs and budget. Our project covers mostly middle income to high end projects in Metro Manila, Cavite, Laguna, and Antipolo.","id":"305125912852711"},{"name":"House and Lot for Sale (Cebu City)","description":"Helping Filipino's Buy and Sell Homes Specializing in investment properties, rental and sale of condos, coops and townhouses, lot for whatever purposes. Facilitates property loan through Pag-ibig, Bank loan or In-house loan for those who can't provide basic requirements. ","id":"136510746401879"},{"name":"Cranbury Sale Stable","description":" All horses will be available for public auction on Wednesday nights at 8 p.m. To phone bid you must be registered with the office by 6 p.m. the night of the sale. After the sale resales will be posted here. #10 pen horses will be posted on the CHW Network page. All horses will have prices and descriptions added after the sale. The office telephone number is 609-448-5225.","id":"751937054862253"},{"name":"The Official Salem Baptist Church of Chicago","id":"195059340463"},{"name":"Carolina Ale House- Winston Salem","id":"484642914940315"},{"name":"SALEEQA","description":" A Complete Household Store Covering all your household needs ranging from Cookware, Bakingware, Food prepration, Kitchen Electrical, Kitchen utensils Picnic and Parties, Food storage, Tableware, Clean and Protect, Bathing and accessories, Home décor and Home organisers and moving endowments from onto every part of the planet. Our Purchasers hunt down creative items that make essence more straight forward.\n SALEEQA means perfection in daily chores. And we at Saleeqa will help you become more \"Saleeqa mund\".Right tool for right job makes you perfect. we try our best to make every household tool available at our store. \n\nWe look forward to welcome you at our store.","id":"342917549101192"},{"name":"Cavite-House&lots for sale","description":"Real estate salesperson helped hundreds of home buyers to guide them how to avail properties\n3 options of financing available\nIN-HOUSE FINANCING\nBANK FINANCING\nPAG-IBIG FINANCING (selected projects)\n\nany question relating to housing loan, or real estate property investment just call me to answer your queries...\n\nFOR INQUIRIES and TRIPPING SCHEDULE:\nCALL: KAREN BALORO\nGLOBE +639178672827\nSMART +639084138420\nSUN +639229344462\nhome phone# 046-5091458\nhttp:\/\/cavitehouseandlotforsale.webs.com\/\nemail add: karen_urdaneta2000@yahoo.com\n\nThis ads focus project is cavite area, 100% non flooded areas, and near to all commercial establishment.\nReservation payment thru direct remittance direct to company or developer bank account, or thru your representative, cash or post dated checks also accepted.\nsite tripping request is anytime...just call me for your convenient time.\n\nPlease provide all information during qualifying, like net monthly salary, occupation, term of payment or financing scheme want to use, if it is Pag-ibig financing, bank, or in-house financing.\n\nPlan budget for your plan investment, then location...\nrent to own houses also available\nbrand new houses available\nother property investment available...","id":"170861476299346"},{"name":"AFFORDABLE HOUSES IN BULACAN THRU PAGIBIG BANK FINANCING AND IN-HOUSE FINANCING","description":"Flood Free Locations. AVAILABLE LOAN for BANK. IN HOUSE AND PAGIBIG. Call or text now (Smart) 0999-374-2225 \/ (Sun) 09327108167\/ (Globe) 09179217460. .  Available From Single House, Townhouses, Bungalow. .\n.\n.\n.\n.\n.\n.\nwww.google.com.ph\/search?newwindow=1&hl=en&site=webhp&q=www.facebook.com%2FHouseAndLotforSaleBulacan&oq=www.facebook.com%2FHouseAndLotforSaleBulacan&gs_l=serp.3...132374.139109.0.139747.9.9.0.0.0.0.158.796.7j2.9.0....0...1c.1.27.serp..9.0.0.pcbtsyU1wFQ\n\ngoogle6ed585009bf01cd4.htmlgoogle6ed585009bf01cd4.html","id":"255162217908148"},{"name":"House and Lot for sale in Cebu(Installment or Cash)","id":"137261469642388"},{"name":"House for Sale","id":"1444556059110857"},{"name":"House of Fashion, Summer Sales","id":"176253455733342"},{"name":"NI Quick House Sale","description":"We buy property directly from home-owners all over Northern Ireland tailoring the deal to their personal requirements.\nWe pride ourselves on being a trustworthy and ethically-driven company that puts the customers needs’ first.\nWe provide a free and discrete consultation service that comes with no obligations. Once we have valued your property, we will make you an offer within 48 hours.","id":"1449253142023530"},{"name":"Harmony House Care & Sales","description":"Harmony House Care & Sales offers a range of Personal & Beauty Care Products, Fragrances, Lingerie, Handbags, Purses\/Wallets & more...\n","id":"125928324253565"},{"name":"Davao City House and Lot for Sale","description":"Our aim is to help you decide and choose the best house and lot in Davao City that will fit to your need and budget. Our team will provide you with all the details you need. Please check some properties listed here http:\/\/on.fb.me\/KVI5lY","id":"433555239997638"},{"name":"House & Lot for Sale 09268302888","id":"631057543598944"},{"name":"House for Sale","id":"1403978079898843"},{"name":"House sales in istanbul","description":"إن شركتنا العقارية في تركيا هي شركة خاصة متخصصة بالاستثمارات العقارية مبنية على أسساً ثابتة وراسخة مما يساعد على الاستثمار الصحيح ليعطي الفائدة الكبرى .","id":"1541576142789375"},{"name":"House for Sale Trivandrum","description":"Trivandrum Real estate properties  house for sale search buy house land plots in trivandrum city and around ","id":"204389706345915"},{"name":"House and Lot for Sale","description":"Luxury does not need to be expensive. Your investment with us gives you high quality houses that are affordable.........\nLive a better life.","id":"817949781576666"},{"name":"Pagibig House For Sale","description":"Find cheap no downpayment Pag-ibig townhouses and house and lot for sale in Cavite. Also available rent to own houses with only 10K total cash-out, lipat agad.\n\nKayang-kaya mo nang magkabahay Kabayan dahil 6.5% na lang ang interest rate ngayon. \n\nReserve na!  Kung hindi ngayon, kailan pa?\nTawag na!","id":"1374296682846994"},{"name":"House of Sale","description":"Fastest way to shop for the sales you must have...\nfrom High Street brands such as\nAccessorize | Avon (UK) | Dorothy Perkins | Elemis UK | Evans | Fat Face | Forever 21 Global BV |Lipsy | Luxur PLC (Continental Couture)\nMiss Selfridge UK | Monsoon | Oasis Fashions Limited |StylistPick.com | Superdry.com | Sweaty Betty | The White Company |Topman UK\nUNIQLO | Wallis | Warehouse Fashions","id":"509955792400603"},{"name":"House and Lot for Sale Antipolo City","description":"Pagibig Financing Available\nIn House Financing Available","id":"143464592387013"},{"name":"Charleston House and Home Sales","description":"\"Where we love is home - home that our feet may leave, but not our hearts.\"  - Oliver Wendell Holmes\n\n","id":"1564504083785137"},{"name":"HOUSE AND LOT FOR SALE IN CEBU","description":"HELPS PROVIDE FILIPINO PEOPLE TO CHOOSE THEIR DREAM HOMES, LOTS FOR SALE, BEACH HOUSE, RETIREMENT HOMES, AFFORDABLE HOUSING, HOUSING ALSO FOR THE ELITES, HOUSE\/APARTMENT FOR RENT\/LEASE, COMMERCIAL LOTS & SPACES FOR RENT, ET CET , WHILE GAINING TRUST & QUALITY SERVICE BASED ON OUR CLIENTS EXPERIENCES .","id":"176252788460"},{"name":"Beach House Sale and Rental","id":"561995917252162"},{"name":"House for Sale","description":"Reserve Now! \n\nCall \/ Text \/ Email: \nSmart - 09107473349\nTM - 09161687149\ntracybontogon@gmail.com","id":"131610300321491"},{"name":"Vintage House for Sale Duncan","description":"Lovingly restored character home located in the heart of Duncan...\nBuilt in the 1930's has 3 bedrooms, 1.5 bath home for sale in quiet corner of Duncan. Walking distance to VIU, schools, quaint  downtown Duncan, all amenities are so close you don't need a car. With all of this convenience at your finger tips, you won't believe how quiet and peaceful this home and garden is.\n\nHouse Includes: \n- 1557 sq ft total living space\n- 3 bedrooms\n- Closets in every bathroom\n- 1.5 baths (recently remodelled)\n- Office\/library area\n- 4-year-old kitchen and appliances\n- Gas fireplace, furnace and hot water\n- Recently updated plumbing and electrical\n- Original fir floors (refinished) through out how.\n- Well insulated\n- New thermal windows\n- Recently updated water tank\n- Stunning character features throughout (French doors, panelled walls)\n\nExterior includes: \n- Newer roof\/shingles (House: 6 years old, Garage: 4 years old)\n- Single car garage\n- RV parking and second driveway (good for trailer, camper trailer and boat at the same time)\n- Fully fenced and secure for your furry friends.\n- Outdoor entertainment area, great for year round dining, barbecuing and outdoor living.\n- Beautifully landscaped, easily maintained garden.\n- Flagstone patio\n- Large, yet private and serene garden\n- Tool shed\n- Fire pit\n- Cherry, plum and apple trees, rhubarb, lilacs, roses this list goes on, this garden is incredible you simply have to see it.\n- In ground sprinkler system to boot!\n\nOutside entrance to basement:\n- 6'3\" height basement with workshop (600 sq feet)\n- Plus crawl space for additional storage (even kayaks)\n- Dry and clean \n- Concrete foundation\n- Sink with running water\n\nNOTE: There is a good possibly of obtaining a zoning change from R1 to C1 or C2, as the area has C1 and C2 surrounding it.\n\nFor $370,000, this house is in a class of it's own. Contact us now to arrange for viewing.\nJeanette @ 250-715-5060\n","id":"1659337270977438"},{"name":"In House Sales- Sandra Hardie","description":"In House Sales introduces a new private sale solution. It gives the home seller the option to avoid commissions charged by an agent, and have someone skilled to turn to. Your ‘Ambassador’ is available to discuss and guide a you through the process.","id":"215128998696701"},{"name":"House For Sale & Rent","description":"A fully roll out professional real estate page in Cambodia offering a full function of real estate services to corporate, institutional and individual clients across the country.\nIn commitment to serve our customer in best service, we have provided the most up-to-date date of all category property available coupled with the experience and expertise of local Real Estate Cambodia’s professionals team. This is let us to promptly gain reputation from investors, particularly in valuation , agency and consultancy service.\nWe are guaranty a comprehensive network that have been prepared to match investors to the property chance available nationwide and assist our owners, investors and business partners in minimizing risks , maximizing the profitability and achieving their investment goals .","id":"590136771117801"},{"name":"Alan Bennett, Shoreline Realty  Myrtle Beach House Sales","id":"442335255893622"},{"name":"Bataan House & Lot for sale","description":"BATAAN CAMELLA\/ ORANI COASAL GROVE VILLAGE \/ LIMAY DUALE,KITANG 3 SILVERLAND SUBD.\/MARIVELEZ LOT\/CANYON RESIDENCE BALANGA CITY\/SAYSAIN,BAGAC BEACH FRONT,PRIVATE COVE...\/DON PEPE","id":"269626216382568"},{"name":"House and Lot in Cebu","description":"REALTY OPTIONS INC.\n\nWe offer the best House and Lot, Condominium and Lot Only Package","id":"541068755938444"},{"name":"CDO Home Sale (Cagayan de Oro House and Lot for SALE)","description":"Social Media Marketing - www.CDOHomeSale.info\nInternational Property Investment Endorser of\nLeuterio Realty & Brokerage and Filipino Homes Intl.\nRent Manager at Rent.ph\nUnder New PRC REB #0020773\n\nCompany Websites:\nhttp:\/\/www.leuteriorealty.com\/\nhttp:\/\/www.rent.ph\/\n\nRe. Lic. # 2008-1348 (N)\nOffice Address: 2nd floor Abonitalla Bldg., Crossing Iponan Highway, Cagayan de Oro City 9000\n\nContact Number: (Globe)(Viber) +639063495041\nEmail Address: cdohomesale@gmail.com ","id":"461567763855208"},{"name":"Cebu Investment Portal: House, Lot & Condominium","id":"436135559876761"},{"name":"House and Lot for Sale in Cebu Philippines: Property Investment","description":"Helps provide every Filipino People in the realm of Buying\/Selling Real Estate Properties and choose there Dream Homes, Retirement Homes, affordable Housing, Lots for Sale, Beach House & Lot, House\/Apartment for Rent\/Lease, Commerial Lots and Spaces for Rent, Etc , while gaining trust & quality service based on our clients experiences. Specializing in investment properties, rental and sale of condos,and townhouses, lot for whatever purposes. Facilitates property loan through Pag-ibig, Bank loan or In-house loan for those who can't provide basic requirements.\n\nFor more information pls feel free to contact:\nEric E. Prondoso\nMobile:\n09253004629 ((SUN-VIBER) \n09473812148 (SMART)\n09158628555 (GLOBE)\nLandline: 4940362\nPRC REG. License #: 0014187\nBachelor's Realty & Brokerage\nSKYPE:ericpro8\nemail:houseandlotcebu.ph@gmail.com","id":"1485644018336528"},{"name":"House and Lot for Sale in San Mateo Rizal","id":"287953944594399"},{"name":"House Sale Saltillo","id":"454693471366908"},{"name":"House For Sale Cebu","id":"629232833779308"},{"name":"Clearing House Consignment Sale - Furniture & Home Decor","description":"Furniture and Home Decor Consignment Sale!! 3-day event\nThursday, June 18 (9-6)\nFriday June 19 (9-5)\nSaturday June 20 (9-12)\n\n2720 Riverside Drive - Macon , GA\nIn the Riverstreet Shopping Center (turn by Bank of America, near the S&S)\n\nThis is a great opportunity to sell and shop for furniture and home decor items items.  We all have those pieces that are still in good shape but just don't fit our homes anymore.  Consign with us and you won't have the hassle of organizing a garage sale or having strangers come in your home from Craigslist. \nConsignors receive 60% of the selling price of their items less an $8 participation fee.  \nYou price and drop your items off to us.  We host, staff and promote the sale for you.\n\nEmail us if you are interested\n ClearingHouseConsignment@gmail.com\n\nJulie Canady & Dawn Burkhalter\n\nIdeas of items:\n\nConsole Tables\nEnd Chairs\nDining Room Table\/Chairs\nPictures\nRugs\nLamps\nDecorative Iron\nTable Linens\nBedding Sets\nChildren's Room Decor\nHead Boards\nOil Paintings\nLighting Fixtures\nDish Sets\nBar Ware and Glasses\nBar Stools\nEnd Tables\nSide Chairs\nThrow Pillows\n\nAll the details on our web site:  www.ClearingHouseConsignment.info \n \n\n\n\n\n\n\n","id":"110400235717471"},{"name":"FOR SALE HOUSE AND LOT(FILIPINOHOMES-CEBU)","description":"Filipino Homes International\n\nYou're in good hands with Filipinohomes Int'l.\nYour choice and investment is our top priority\n\n\n\n\n\n\nJust a few good reasons you should call Filipino Homes Team!\n\n1. Specializing the Best Deals Today.\n\n2. Over 20 Years reputation for Sales Service of our President & Founder.\n\n3. We Offer helpful hints to increase your home's value and bring quicker sales.\n\n4. Access to quick financing and fast cash to you.\n\n5. Full Service Real Estate Broker offers Buyer\/ Seller Convenience.\n\n6. Qualified Experts help determine needs, and Offer value Solutions.\n\n7. We provide the experience needed to determine fair market price.\n\n8. Present in over 50 Countries of Network of Real Estate Partners.\n\n\n\nREAL ESTATE SERVICES OFFERED\n(Available anywhere in the Philippines)\n*Condominium\n*House Lot\n*Lots only\n*Buildings\n*Rowland \/ Island\n*Leisure Farm Properties \/ Farms\n*Beach Front Properties\n* Commercial Lots\n*Industrial Lots\n*Golf Share &Yacht Club Membership\n* Memorial Lots & services\n*Rental & Lease\n*Bank Acquired assets &; All Real Estate services, documentation, partition etc.","id":"241560553092"},{"name":"Antipolo City House and Lot for Sale by FJC Realty","id":"394523423975887"},{"name":"House and Lot for Sale in Iloilo","description":"Finding homes is easier and more convenient with us. We are a one-stop office for all your property and real estate needs in Iloilo. Whether you are looking for an affordable house and lot for sale, a condominium unit or luxury houses, we offer the right solutions.\n\nFor more information, you may contact Alma S. Sabater, a licensed Real Estate Broker, at 09989891182 \/ 09055433745 or email her at almasabater@yahoo.com.","id":"534940353208190"},{"name":"Salento Surf House","description":"Desideri una Vacanza all'insegna del Relax in cui poter staccare il cervello e vivere a contatto con il mare e la natura, seguendo le tue passioni ma non sai come fare?? Da oggi, ci pensiamo NOI!!!!!\nSalento Surf House offre i migliori servizi nel Salento di : Alloggi - Stabilimenti balneari - Rivenditori Autorizzati -  Eventi -  Down Wind - Corsi -  Kite Surf - Surf - Wind Surf - Sup - Wakeboard - FlyBoard -  Vela- Diving - Yoga - Salento Safari - Mountin Bike - Cross Off Road - Quad - Rimessaggio materiale - Day Hospital Vela - Charter - Transfert Airport - Trasporto Bagagli  grazie alla collaborazione dei suoi Associati Partners sparsi in tutto il territorio .\n\nRISVEGLIA LA VOGLIA DI LIBERTA' E ROMPI GLI SCHEMI !!!\n\nINFO\nA UNIQUE project is taking shape in the Salento peninsula, which aim at offering different services according to everyone's needs  \n\nDESCRIPTION\nDo you wish a Holiday where you can Relax, take a break and live in close contact with the sea and nature? You want to follow your passions but you don't know how to do it? We will take care of that, from now on!!!\nSalento Surf House offers you the best services in Salento regarding: accomodation - beach resort - authorized vendors - courses - events - Down Wind - courses -  Kite Surf - Surf - Wind Surf - Sup - Wakeboard - FlyBoard - Yoga -  sailing boat - diving - Salento safari - mountain bike - cross off road - quad - boat storage - day hospital sailing boat - charter - airport transfer - luggage transpor, due to the collaborations of the Partners all around the area.\n\nAWAKE YOUR FREEDOM AND BREAK THE PATTERNS!!!\n\n ","id":"524138437671707"},{"name":"House and Lot For Sale Ilocos Norte","description":"House and Lot For Sale \nDescription: Commercial lot,Residential lot,Beach Lot, Farm Land\nLocation:\nLaoag City ,\nPagudpud ,\nBurgos,\nBacarra\nPasuquin,\nBatac City,\nSan Nicolas\nand some municipality of Ilocos Norte\n\nFrom the fair winds of the self-proclaimed True North, Ilocos Norte boasts of graceful, historic churches, deep aquamarine-colored seas, panoramic vistas of rugged mountains, hidden waterfalls and a multihued history that whispers of gold mines, bloody revolts and an interesting window to Philippine national politics.\n\n","id":"648625491920466"},{"name":"House For Sale by Owner","id":"277483575756481"},{"name":"HouseForSaleByMe.com","description":"Our mission is to empower consumers with information and tools to make smart decisions about real estate,Homes, real estate agents and mortgages...","id":"286637044869949"},{"name":"Branded Perfumes WareHouse Sale","id":"116320521743191"},{"name":"Dumaguete House and Lot & Properties for Sale","id":"760986273944738"},{"name":"House Hold Items For Sale","id":"1497579610485252"},{"name":"House and Lot for sale in Sipalay City","id":"233225890177389"},{"name":"House and Lot for Sale in Bulacan & Pampanga","id":"132851733544050"},{"name":"House For Sale - Chetwynd","description":"296,000$\n\nWell maintained 3 bedroom family home in Chetwynd's Rodeo Subdivision.  Located on a quiet, no-thru road within easy walking distance to Little Prairie School and kids playground.  \n\nUpstairs:\n3 bedrooms\n1 bath (newly renovated)\nupdated kitchen with granite counter tops and stainless steel appliances \n\nDownstairs:\n1 bedroom\n1 flex room\n1 bath\nbonus family room\nbasement entry \n\nFenced yard with 2 sheds, carport and new back deck. 5 new appliances included.  \n\nCall or Text 250-788-5109","id":"1131032750245912"},{"name":"House and Lot For Sale in Cavite","description":"House and lot for sale in Dasmariñas City and Gen. Trias, Cavite. Superior, beautiful, elegant yet affordable homes. Affordable house and lot in dasmariñas city. Affordable house and lot in Gen. Trias, Cavite. Inhouse or bank payments homes in Dasmariñas city and Gen. Trias, Cavite. Townhouse in Dasmariñas City and Gen. Trias, Cavite. We offer townhouse and commercial lot.","id":"567742186655412"},{"name":"House for sale in France","description":"This lovely two hundred year old farm house is one of two that I own near the village of Chantrigné, Mayenne in the Pays de l.a Loire region.\n\nfor sale for 110,00 €uro\n\nI spent nearly two years modernising the property including having a new oak staircase built from local oak and installing two large bedrooms and a bathroom on the upper floor.\n\nI have a comprehensive folder of pictures showing all of the work that I have done.\n\nOnce La Bradiere is sold we will then live in our other house which is only 800 metres away from the one being sold. (It is currently rented out) and so I would be happy to provide assistance for the buyer of the property to acclimatise themselves into living in France should they require it. It can be quite a daunting prospect for someone who does not know their way around when it comes to getting utilities and service set up and having lived in France for nearly fourteen years I would be please to offer what help I can.\n\nIf you would like to arrange a viewing please contact me by email or phone and I can then give you more information on the property.\n\nThe council tax for the house is very low and we only pay around £350 a year which includes £100 for the TV licence!  \n\nThere are a number of tourist attractions in the local area including the large lake at Ambrieres les Vallees which is less than ten minutes drive away where one can walk or use the facilities at a small holiday park where they have numerous outdoor activities for all ages. Including tennis, horse riding, canoeing and sailing.\n","id":"1579606452312284"},{"name":"House of Property for sale in Bali Land","description":"LAND IN BALI FOR SALE www.propertyforsaleinbaliland.com affordable PROPERTY FOR SALE IN BALI LAND IN BALI FOR SALE IN CANGGU JIMBARAN TABANAN UBUD Gianyar www.baliwonderland.com * BALI LAND FOR SALE www.villandbaliproperty.com affordable PROPERTY IN BALI FOR SALE LAND FOR SALE IN JIMBARAN TABANAN UBUD Gianyar CANGGU Kuta www.landinbaliforsale.com.\nBali Real Property offering land for sale in Bali, land for sale in Canggu, land sale in Ubud, land for sale in Jimbaran and Nusadua, land in Bali for sale in Tabanan. Land with ocean view, close to the beach or land in Bali with exotic rice fields view great for villa or resort hotel. Excellent opportunity for Bali Property investment","id":"134830276705094"},{"name":"FISH Sales House","id":"133395776860649"},{"name":"Birmingham House Sale","id":"608831269216417"},{"name":"Kathy Home 4 SALE","description":"Fantastic move in ready, desirable and convenient Westridge Forest, so much home for the money, No more Yard work for you! Community Amenities are offered in your HOA dues, enjoy, clubhouse, and pool. Main level Office with French doors, Great room with built ins, overlooking private patio and garden, open kitchen, Master and Second bedroom on main level, spacious upper level with bedroom 2 and 3 very impressive bonus room with kitchen and media area plus upper level library, rianni tankless water heater.","id":"684658795000093"},{"name":"Cagayan De Oro's Best House & Lot for Sale","description":"Why Invest in Cagayan de Oro\nCagayan de Oro is a veritable goldmine for those in search of new tourist and investment destination.\n\nThe city has a reservoir of advantages: no typhoons all year round, rich agricultural environments, a broad consumer and manpower base, cheap and abundant power, strategically located internation seaports, modern telecommunication facilities, adequate infrastructure and a highly efficient educational system.As the trade and service center of Northern Mindanao, the city is a prime location for cost-effective air, land and sea transit. Moreover, its striving business community and the necessary business support facilities makes the process of doing business relaxed and pleasurable.\n\nThe soundness of the Cagayan de Oro business climate as well as its metropolitan flavor combined with the warm and easy nature of the local people gives it a self-contained setting that motivated an increasing number expatriate business to stay in the city for good.\n\nAs an urban center with a regional market orientation, a high level of market sophistication and an economy closely intertwined with the economies of the entire region, the city is poised for planned, rapid and sustained growth.","id":"183041831788629"},{"name":"House and Lot for Sale in Angeles City, Pampanga","description":"H O U S E   &   L O T   F O R   S A L E\nLOT AREA   :   527 sq.m.\nFLOOR AREA :\n              Ground Floor = approx. 300 sq.m.\n              Mezzanine  =  approx. 200 sq.m.\nLOCATION :\n              Villasol Subdivision, Angeles City\n              (near Clark Special Economic Zone & SM Clark, Angeles)\nPRICE :   P10M (negotiable)","id":"166673160076440"},{"name":"House For Sale","id":"357192394488946"},{"name":"House for Sale or Rent - Birmingham","id":"518849301579074"},{"name":"The Coffee House Sale","id":"509892219110563"},{"name":"House For Sale \/ Office Space for Lease \/ Room for Rent","description":"A7 Outsourcing and Marketing provides online services to small businesses and Non-Government Organizations who wish to promote their business or cause to the masses. \n\nA7OM can help in your social media marketing needs by creating websites or connecting your websites with the rest of the social sites available today. A7OM also offers Search Engine Optimization services using various techniques and methods to make sure that your presence will appear in the higher ups of the Search Engine Results Page. \n\nAs a one-stop-shop, A7OM can write articles for you, create blog sites, post them and promote them. \n\nA7OM works hand in hand with GoinOutsource.com, an up and coming outsourcing site that rivals existing providers with its cheap charging and matter-of-fact business sense.\n\n\n\n","id":"241088109335161"},{"name":"House Hunter Realty & For Sale By Owner","description":"For Sale By Owner and Full Service Realty !!!! Looking for assistance in the Newburgh, Evansville, Boonville, or even the Northern Kentucky market we are here to help. Let our team of real estate experts make your experience the best it could be! Visit us online at www.inkyhousehunter.com or call us today at 812-858-7355 We can't wait to hear from you!","id":"104033669639058"},{"name":"Farm House Finds Sale","id":"149273261778117"},{"name":"Cheap house for sale urgent in Phnom Penh","id":"801362826586747"},{"name":"HOUSE for SALE","id":"1549884585251136"},{"name":"House and Lot for Sale in Cebu","id":"366498393502121"},{"name":"House For Sale Pampanga","id":"1398697517015812"},{"name":"Bintulu House for Sale \/ Rent","id":"700894466693697"},{"name":"House For Sale\/Rent Zambia","id":"198085453717144"},{"name":"SECU Family House- Winston Salem","description":"About the Facility:\n\nSECU Family House on the Richard J. Reynolds III and Marie M. Reynolds Campus is located on 8.8 acres of property on 1970 Baldwin Lane (at the end of Hospice Lane) in Winston-Salem, a site convenient to both Forsyth Medical Center and Wake Forest Baptist Medical Center. Features include:\n\n    44 guest rooms, each with two queen beds and private bath\n    Common living, dining, and kitchen areas\n    Chapel for meditation\n    Laundry facilities\n    Outdoor patio areas\n    Support from staff, volunteers and other families\n    Referrals from hospitals\n    $35 nightly fee\n\n Programs:\n\n-Overnight Program – Lodging and support for more than 2,000 families a year\n-Day Respite Program – For outpatients to rest in between treatments\n-Training for Medical & Nursing students from Winston-Salem State University, Forsyth Technical Community College, Wake Forest University and others\n\n\n","id":"193959938431"},{"name":"HOUSE for SALE","id":"882977625055578"},{"name":"House for Sale","id":"815851791844518"},{"name":"HOUSE 4 SALE Charlotte 336-782-4528","description":"We specialize in finding great deals for our home buyers and investors. This home is offered at $149,900 after remodeling. (the market value for homes in this neighborhood are between $160k - $190k). This house needs some cosmetic work, mainly paint and carpet. If you want to do it your self, you can BUY IT NOW at a BIG DISCOUNT.  Call now 336-782-4528 Let's make it work for you!","id":"1548861975355759"},{"name":"House For Rent\/Sale","id":"331890290270322"},{"name":"London House For Sale","description":"LondonHouseForSale.co.uk","id":"459024970887654"},{"name":"Tagaytay House and Lot for Sale -Beatitudes Realty","id":"136956799700646"},{"name":"Affordable House & Lot in Cavite for Sale Suntrust Properties Inc","description":"For those who are interested to buy house and lot, bungalow, townhouse, 2 storey single detached, 2storey duplex ready for occupancy and non rfo, basic and complete type in Cavite Philippines please contact me... \n\nFOR INQUIRIES\/TRIPPING:\nCALL: MARLENE GUPIT\nTNT: +63-912-974-1591\nSUN: +63-932-855-9226\nGLOBE\/VIBER: +63-927-980-6297\nVISIT MY WEBSITE:\nhttp:\/\/www.houseandlotincavitephilippines.blogspot.com\/\nEMAIL ME @: marlene_gupit19@yahoo.com","id":"489871574418987"},{"name":"House on sale","id":"333589386848034"},{"name":"Azary Princess house Sales","id":"690425767701491"},{"name":"House for sale near Manila","description":"Choose your House and Lot here..More on Cavite Projects!!","id":"258212811028354"},{"name":"House and Lot for Sale","id":"301655966652456"},{"name":"Affordable House and Lot For Sale","description":"Company Profile\n\nABL Realty started on December 31, 1989 and continuously serve for almost 23 years . It became the Leading & Topnotcher Realty in 2003 by the Borland developer and achieve the highest sales project in most of the land developer company.\n\nABL Realty started out as the In-house and Pag-ibig Loan Marketing low cost housing in different Developer, ABL Realty was entrusted with several projects in Quezon City,Caloocan City,Bulacan, Cavite, Laguna, Rizal and Tagaytay among others.\n\nAt present ABL Realty continuously plan strategically to promote and interact with different Developer, as well as with Buyer, Agents and other sales Brokers. ","id":"185798841567535"},{"name":"Zeis House Salerno","description":"Corso V. Emanuele n. 164 - SALERNO\n","id":"465732466800877"},{"name":"House For Sale - 451 Verla Drive, Windber PA 15963","description":"For selling well maintained home, beautiful location on 3.789 acres. Selling price is $289,900 This property has it all! Dream kitchen, dream garage, a detached game room that is perfect for the \"Man Cave\", a huge pole building that is perfect for an indoor riding arena if you have horses or a perfect spot to store all the \"TOYS\" plus there is a barn too!!! We are in a prime location, and within walking distance of State Game Lands! NO Zoning!!!\n\nKitchen  16.5' x 15.5'  w\/ 2 pantries\nLiving Room  16' 10\" x 15' 8\"\nFoyer 8'7\" x 11' 5\"\nDining Room  12' 4\" x 11'\nMaster Bedroom  21' x 16' 2\"  w\/ 2 walk in closets\n2nd Bedroom   14'7\" x 14.5'\n3rd Bedroom   15' 1\" x 14.5'\nOffice \/ 4th Bedroom  12' x 9' 1\"\nDownstairs Bathroom 8' 6\" x 6' 9\"\nUpstairs Bathroom  6' 3\" x 7' 8\"\n\nApx year Built  1972\nHot water baseboard heat\nHarman Pellet stove in Living Room\nFull basement with laundry\n1 car Garage under house \/ in basement\n4 year old Burnham furnace \n\nGame Room 25' x 50 Finished with Harman pellet stove.\n\nDetached Garaged 40' x 22' fits 2 cars tandem parked oil hot air furnace\n\nBarn 40' x 30' with open 40' x 30' loft\n\nPole Building \/ Arena 50' x 110'\n\nGarage, barn and pole building all connected.--\n\n\n\n","id":"807740452648659"},{"name":"House For Sale","description":"68 Bayfield Street, Charlottetown, PE\n$179,500\n\nThis conveniently located downtown 1.5 storey home is a must see!!   \n\nLooks can be deceiving and from the outside it’s hard to know what a jewel this home is on the inside.   In the past three years the interior of this home has had major updates including a new kitchen with all new stainless steel Whirlpool appliances (fridge, stove, dishwasher, microwave, white washer and dryer).   Other updates include a new half bath, refinished hardwood floors and stairs.\n  \nThe home has also had some exterior updates which include four new doors, two new windows as well as new deck flooring.\n\nThis home features an open concept kitchen layout with espresso stained maple cabinets.   The cabinets have under-cabinet lighting, an island with a breakfast bar that has deep drawers for pots and pans and soft closers on all the drawers.  \n\nThe washer, dryer and half bathroom are also located on the main floor.   The half bathroom offers ample space for coats and boots as well as access to the backyard and deck making it a great back entrance.  \n\nThe second floor features a large master bedroom that at one time was two bedrooms and which could easily be converted back if so desired, a good sized guest bedroom, and a full-size bathroom.   \n\nTo complete the second floor there is a nice sized landing with coat closet, and a linen closet making the upstairs feel roomier.\n   \nSome of the many extras that this home offers include:   \n\n8 and half foot ceilings throughout;\n\nA basement that offers ample space for storage as well as a game room;\n\nA private yard surrounded by a new fence;\n\nA baby barn with electricity for extra storage;\n\nConnolly Security System;\n\nNon smoking and child free home;\n\nOwner flexible on closing date and occupancy;\n\nWalk Score: 84 Very Walkable \n\nLocation:\n\nSt Jean Elementary School, 2 minute walk\nUniversity Avenue Bus Stop, 2 minute walk\nQueen Street Co-op Food Market, 3 minute walk\nConfederation Centre of the Arts, 10 minute walk, 850 m\nHolland College, 12 minute walk, 1.0 km\nCulinary Institute, 15 minute walk, 3 minute drive, 1.3 km\nUniversity of PEI, 27 minute walk, 6 minute drive, 2.1 km\nQueen Elizabeth Hospital, 8 minute drive, 4.1 km\n\nProperty Type: Single Family\t \nBuilding Type: House\t  \nStoreys: 1.5\nLot Size: 0.066\t\n\t\nLocation Description: 68 Bayfield Street.  One way street off University Avenue\n\nDetails:\nAccess: None \t\nLand Features: Level \t\nStructures Patio(s), Wired Building \nZoning Description RES \t\nDistrict: 4\t\nAge: 78 years\n\nBuilding:\nBathrooms (Partial) 1.5 \t\nBedrooms (Total): 2 \t\nFloor Space: 1,190 sq ft + full basement\nFlooring: Laminate, Hardwood, Hard Surface \tFoundation: Concrete, Full \tHeating: Oil, Forced Air \nStyle: Detached  \t\nSewer: Municipal \t\nWater: Municipal  \n\t\t\nProperty taxes:  $1227.00\nServices: Electricity, Telephone, Cable, 100 Amp\nParking:  for one, plus free off street parking\nExterior: Vinyl\t\t\nRoof: Asphalt Shingle\nLiving room: 19’3 x17\t\nBathroom\/Back Entry: 11 x 7\t\nKitchen: 19’3 x15\nMaster bedroom:  19’3 x 13’3\t\nBedroom 2: 12’3 x 10’3\n\n","id":"933416053336597"},{"name":"House For Sale By Owner","description":"Dream home! House was built in 2013 and has only had one owner. Huge corner lot in beautiful Janesville. Just 10 minutes from Cedar Falls! Large oversized 3 stall garage with workshop area. Inside everything is brand new and very modern. Recessed lighting throughout the house and outside. Three bedrooms and two full bathrooms. The master suite includes a large bedroom, walk-in closet and on-suite bathroom with large walk-in tile shower with double shower heads and heated floors. The house includes a whole house built in sound system with controls in each room. Kitchen includes all appliances, solid wood cabinets with soft close doors, bamboo floors and under cabinet lighting. Large mudroom\/laundry room with washer\/dryer included. Deck off the back with access through the kitchen and master bedroom. Tons of storage throughout.","id":"1555166858077481"},{"name":"House and Lot for Sale Philippines","id":"301788006635999"},{"name":"House For Sale Malaysia - Hamdy","id":"334925543301649"},{"name":"House and Lot for Sale in Pampanga Solana Country Homes 6k Monthly","description":"Welcome to Solanaland. We offer premiere quality developments at highly affordable prices, making it possible for you to finally own your dream home. \n\nAt Solanaland, we recognize that purchasing a new home is probably one of the most important investments you will ever make and so you can be confident that we will ensure that we provide you with only the best value for your money. \n\nKeeping costs low without ever compromising on quality, you will be proud to own a home at Solanaland.","id":"211362395663340"},{"name":"Lion House Sale","id":"1601270610118567"},{"name":"House and Lot of Lipa City Batangas","description":" The Project \nLipa City, Batangas is one of the best places to reside in  the Philippines. Cool climate, fast growing city, scenic surroundings in a relaxed setting only 1 hour from Makati. Many top educational institutions, tourist center, in fast-growing Batangas province. Bel Air Residences in Lipa is also 30 min travel time going to Malarayat Golf and Country Club, an 1hour. and 30min travel time going to Manila, 45min going to Laiya San Juan Batangas, one of the Best tourist destinations on Batangas.\n\nBEL AIR RESIDENCES LIPA is a 14 hectare residential development set on the BEST location in Lipa, one of the Best cities to be in in the Philippines. You are right beside Fiesta Mall, across Kolehiyo ng Lipa, near many schools, 2 corners away from SM and Municipal Hall and 3 corners away from Batangas State University and University of Batangas, and from Star Tollways. It combines benefits of city living in a relaxed setting. A breathtaking view of the Malarayat mountains is a site to enjoy every single morning. Distributed parks allow activity and social centers as well as pockets of meditation.  \nOutside, seize the opportunity of an active business district where endless possibilities awaits.  Convenient access points allows you to navigate the city with comfort and ease.\nBEL AIR RESIDENCES LIPA is PLANNED and ORGANIZED for families looking for growth and professional business opportunities while planning also for security, health habits via parks and jogging areas, and a minimum need for car usage. A small commercial area in front ensures further future conveniences. A Large sculpted entrance will welcome you home every day, and a clubhouse planned for welcoming community activities. Plus many other planned pleasant surprises.","id":"340000249429239"},{"name":"House and Lot for SALE","description":"or sale house and lot \nCAMELLA location is anywhere in laguna,imus,tanza\nLUMINA - batangas and tanza\nMASAITO homes - imus cavite\nPARC ROYAL - imus cavite\nCELINA PLAINS - imus cavite\n\nfor details contact me in my number\n090304745871 or tel # 415-1700","id":"708805995871971"},{"name":"House For Sale in Davao City","description":"a subdivision in Matina, Diversion Road, is a middle class to high-end subdivision development offering reasonably priced houses for sale in Davao City. Known as the “flower village”.\nThis Davao subdivision has  24-hour security, a subdivision perimeter fence, 3 swimming pools, and a club house. ","id":"230866540373366"},{"name":"House Condo Apartment land for sale or rent Yangon Myanmar","description":"Advertise Myanmar property free ! . Search Myanmar real estate information and breaking  news in Shwe Myanmar Property.","id":"702212086529827"},{"name":"Gingoog House & Lot For Sales","id":"140290476119407"},{"name":"House for sale in Tuxedo, NY","description":"This Frank Lloyd Wright-inspired house features an open-space design and 5 bedrooms, 2.5 baths, and multiple family gathering and entertainment spaces. Surrounded by Sterling Forest park lands, it is also close to NYC commuter bus and train service. Multiple decks, floor-to-ceiling windows, and sliding glass doors highlight the beautiful natural setting. ","id":"1440333156257270"},{"name":"Manila and Tagaytay House\/Lot\/Condo for Sale or Rent","description":"We are selling properties like HOUSE AND  LOT, CONDOMINIUM, LOT and FARM LOT. A best place to start your HOME & BUSINESS.\n\nCool climate due to its high altitude, earned Tagaytay its title as the second summer capital of the Philippines. The serene surroundings and cool climate also gave Tagaytay its reputation as the center for spiritual retreat. Tagaytay provides a spectacular view of Taal Volcano. \t\n\n\nFOR SITE VIEWING OR FOR MORE INFORMATION OF\nHOUSE AND LOT FOR SALE OR RENT.\n\nPLEASE CONTACT ME AT :\nFor more information. Please contact us at:\nGlobe: (0905) 313 - 6801\nSmart: (0947) 973-6202\nSun: (0923) 211 - 8287\n\nGmail: laria.realty@gmail.com\nYahoo: laria_realty@yahoo.com\n\nthanks:)\n","id":"608339795899992"},{"name":"Roden-Media (media sales-house)","description":"Мы продаем рекламные возможности проектов:\n- Interfax.ru\n- Vesti.ru\n- Realty.vesti.ru\n- Finmarket.ru\n- FinRussia.ru\n","id":"165611993550746"},{"name":"Iloilo house and lot HOT SALE","description":"It's all about real estate business in ILOILO City. We provide House and lot packages, House Construction package or Lot Package Only.\n\nHouse and Lot Package Sample Price: P1.5M- P.5M. Bedrooms, Living, Dining, Kitchen, with Toilet and Bath, Loft Area (Multimedia 2 level), Car port, landscape area and Provision for Laundry or back Area and otherhouse services. \n\nHouse finishes: personalized Interior Wall Colors, personalized ceramic tiled flooring, sliding windows\/ door, Tiled toilet and bath with exhaust Fan, Tiled Kitchen Wall, counter with stainless Kitchen Sink, Prepainted dura rib Roofing with Insulation foam, Big Multi purpose Loft Area. ","id":"143387339124110"},{"name":"House and lot for sale","description":"house and lot,subdivisions, condominiums","id":"191784410909451"},{"name":"House and Lot Sale Baguio City","id":"385275451629884"},{"name":"House for sale","description":"The house has been re-wired, a new gas central heating system fitted. New internal doors with door frames and architraves. New skirting boards, the walls and ceilings re-plastered. The rear wall taken down and re-built and the ridge tiles re-set on the roof.\n    All in the last five years or so.","id":"624749257635521"},{"name":"House Content Sale","id":"354348274743164"},{"name":"The Sale House","id":"577697005700647"},{"name":"House and Lot For Sale Philippines","description":"FOR TRIPPING AND RESERVATION PLS. CALL:\nELY JUMAWAN\n0929-8908201\n0915-8559372\n02-218-2668\nEMAIL: jumawanelyzar@yahoo.com","id":"667861459900015"},{"name":"Shelly's House of Salem","description":"Shelly's House, Inc. provides transitional drug-free housing and services to female offenders who are currently supervised by Marion County.  The program provides transitional house for up to 16 women.  Referrals come from Marion County, Parole and Probation, Marion County Adult Corrections Coffee Creek Correctional Facility, or other local community alcohol\/drug treatment programs.","id":"188166174530904"},{"name":"House for Sale thru Pagibig Renttoown Lipat-Agad in 2 Months","id":"424752394207499"},{"name":"Kitengela House for Sale","id":"1405801439668237"},{"name":"Pilot House Marina & Boat Sales","id":"231166246949436"},{"name":"Salem's Plot Haunted House","id":"153468385518"},{"name":"Tagaytay House And Lot And Lot Only For sale","description":"It is a story of growth, a story of vision, a story of passion. It is a story about the desire to build a home for every Filipino. To deservedly reward the hard work and perseverance of the Filipino family man. To give young families a place of their own where they can grow their dreams and tomorrows. To create communities where residents feel safe and feel they belong to.\n\nIt is also a story of evolution – from building some of the country’s finest and most desired communities to today, building cities.\n\nIt’s all part of the master plan. In real estate parlance, the “master plan” is a comprehensive plan that guides the long-term physical development of a particular area. The Camella masterplans describe residential communities that are more than a composite of homes, streets, parks, and playgrounds. Camella believes that communities should bring whatever its families need within easy reach. Thus, each community is ideally located with immediate access to crucial institutions like schools, hospitals, churches, transport hubs, and places of leisure. They are close to business centers, so work is easy to get to, and come home from. But the group has taken this a step further and exploded that strategy by bringing the institutions right into the communities. Now, when Camella builds, it also builds churches, schools and commercial centers. By creating properties that are essentially self-contained, it is creating virtual cities.\n\nTo Camella, the master plan of every single community it builds, in every single location it selects, is a sacred, living blueprint that incorporates not only what the group intends to build, but what it intends to accomplish ¬– it intends to build cities; and since a country is often known by its cities – France is Paris. Japan is Tokyo. England is London. The USA is New York, Los Angeles and Miami ¬– by building communities where they are needed, and by creating the foundations for tomorrow’s cities, Camella is building the country.\n\nBeyond creating practically self-contained communities, Camella developments have become a “mark of progress” across the country. Camella developments often portent movement into the town, city or province they come to – they portent growth and expansion. What was once quiet and sleepy becomes bustling and dynamic. Roads get better, commercial developments crop up, utilities are upgraded, transport increases, and possibilities become endless. Lives improve, dreams become bigger, needs diversify, expectations expand, and growth becomes inevitable.\n\nThroughout history, this is exactly how the great cities of the world came to be. A germ, a seed, set growth in motion. A few homes built along a river evolve into a great city. A tiny market along a roadway becomes a town that becomes a metropolis. A community is designed for the future and built to respond to what is needed today, and what will be needed to tomorrow ¬– and slowly, and surely, a country will be built better.\n\n“Camella. Building the Country,” speaks of more than what the brand is all about, it speaks of what the brand promises to do.","id":"100503786802892"},{"name":"House sale and purchase","id":"253071904744572"},{"name":"Mackay House and Land Sales","description":"You know it when you see it ....\nThe perfect block of land for the perfect home ...\nFor the home of your dreams or the dream investment ...\nAnd the place to look is Mackay Land Sales ...\nWith a few estates to choose from ....\nFrom Budget to Prestige .....\nA visit to MackayLandSales.com.au can save you time, money and hassles ...\nYou see more land and options, so you'll see the block that is right for you, sooner .....\nMackayLandSales.com.au \n\nIt's all about choice ....\n","id":"154925844531829"},{"name":"CoachHouse Medical Ltd - Ultherapy UK Sales Agent","description":"What is Ultherapy?\n\nUltherapy is a non-surgical, non-invasive procedure that uses focused, targeted ultrasound and the body's own natural healing process to lift and tone loose skin on the brow, neck, under then chin and now the décolletage.\n\nPatient Benefits:\nThe ONLY FDA-cleared, non-invasive ultrasound lifting treatment\n3 FDA-Clearances\n300,000 treatments worldwide to date\nLong lasting effects\nNo downtime after treatment.\n\nFind us on Twitter @UltherapyUK","id":"257061657814117"},{"name":"House and lot 4 SALE","id":"266516576795692"},{"name":"House's Auto Sales","description":"Used Car and Truck Dealer","id":"100458313445625"},{"name":"Apartment\/House for Rent, for Sale, Philippines","description":"We have Apartment\/House Units for Sale and with units ready for rent. We will build 5 units, and to be rented, then you can buy. So you will be buying\/investing income generating apartment. Or you may also want to occupy one unit as your own house\/unit. Thus, you will be having a house with business.","id":"546506125458487"},{"name":"Grand Isle Beach House","id":"344488719033848"},{"name":"House Of Hope Salem-Baptist Church","id":"103584446369745"},{"name":"House and Lot for Sale in Cavite","description":"Suntrust Properties Inc, is a subsidiary of Empire East Land Holdings Inc, a company under the umbrella of the Megaworld Group of Companies, Project areas are inSilang Cavite, General Trias, Dasmarinas Cavite,our Project are affordable, we delivering a high standard of comfort and style customized to the needs of low to moderate-income,  you can avail it thru in-house, or bank or financing and we have also rent to own houses .\n\nour project is very affordable\n\neasy to own\n\nfrom 800k-up to millions available\n\nduplex\n\ntriplex\n\nbungalow\n\ntownhouse\n\nsingle detached\n\nready for occupancy\n\nnon ready for occupancy \n\nPre-selling houses\n\nCondominium, studio,1br,2br,3br","id":"380892691998045"},{"name":"House Lot Sale Rent","id":"681134281981087"},{"name":"Surplus Sales Auctioneers & Liquidators","description":"We conduct auctions every Monday at 10:00 AM in our San Bernardino CA warehouse.\n\nYou may preview auction items on the preceding Friday from 8:00 AM to 3:00 PM.","id":"150628708335540"},{"name":"Sale Prób Guitarmanic House","description":"Sprzęt: Tama Starclassic, Tama Superstar, Iron Cobra, Iron Cobra Twin,  Meinl, EVH, Ampeg, DL David Laboga Genz - Benz, Marshall, Mackie, Mipro, Shure.\n\n\nSzczegółowe informacje: www.guitarmanic.pl (dział Sale Prób)","id":"242294022587535"},{"name":"Waverly Midwest Horse Sale","id":"623443834468006"},{"name":"House for sale\/rent","id":"1406221509651639"},{"name":"Pag-ibig Housing, House \"N\" Lot For Sale, Rent to Own 0908 267 9692","description":"Property management is the operation, control, and oversight of real estate as used in its most broad terms. Management indicates a need to be cared for, monitored and accountability given for its useful life and condition. This is much akin to the role of management in any business.\n","id":"401445829924845"},{"name":"The Witch House","description":"The Witch House , was the home of Judge Jonathan Corwin and is the only structure still standing in Salem, Massachusetts with direct ties to the Salem witch trials of 1692. The house was bought by Judge Corwin in 1675, when he was 24 years old, and he lived there for more than forty years. Corwin is buried in the nearby Broad Street Cemetery. The house remained in the Corwin family until the mid-19th century. The Witch House is located at 310 Essex Street, at the cross streets of North & Summer in the Chestnut Street District of Salem.As a local magistrate and civic leader, Corwin was called upon to investigate the claims of diabolical activity when a surge of witchcraft accusations arose in Salem and neighboring communities. He took the place of Judge Nathaniel Saltonstall, who resigned after the execution of Bridget Bishop. Corwin served on the Court of Oyer and Terminer, which ultimately sent nineteen to the gallows. All nineteen refused to admit to witchcraft and maintained their innocence.The house is an excellent example of 17th-century architecture. To this day historians have not come to a conclusion as to when it was built. Jonathan Corwin's descendants claim the house was built in 1642. Some Victorian scholars alleged that the house was built between 1620–1630, and that Roger Williams, the founder of Rhode Island resided in the house in the 1630s. However most historians now believe the house was built in the 1660s or 1670s. It bears a strong resemblance to the Whitehall building in Sutton, England, a historic home museum built around 1500.","id":"144018202279919"},{"name":"Baguio City House\/Lots\/Condo For Sale","id":"579576962170264"},{"name":"New house for sale in Vientiane","id":"532316966896371"},{"name":"金明車業 JinMing Scooter Sales & Service","description":"Kymco\/Yamaha\/Sym 全車系買賣專業維修保養\n\n\n太古總代理VESPA桃園市經銷處 VESPA全車系買賣專業維修保養\n\n\nVESPA ET8車系 專業維修保養 全車精緻拆裝烤漆 大整(提供保固服務)\n\n\n偉士車系各項精品 動力提升部品套件 歡迎洽詢\n\n\n價格公道 技術到位  歡迎車友前來參觀指導\n","id":"283981495035105"},{"name":"Batangas House and Lot for Sale","id":"638369152975684"},{"name":"House for Sale","id":"1621711054718396"},{"name":"House for sale","id":"466578626825604"},{"name":"The Close & Cencarik Group","description":"With 20 years of sale experience The Close & Cencarik Group provide all real estate services in a \"Boutique\" atmosphere. Be it selling your home or finding you a home to purchase, our team provides the most comfortable environment for you to just relax, enjoy and let us do all the work.\n\nContact- Andrew@dchousesales.com or William@dchousesales.com","id":"617107438399398"},{"name":"House and Lot for sale","id":"1395289704079908"},{"name":"House for sale Pampanga","id":"470977443019285"},{"name":"HOUSE for SALE Manila","description":"Lancaster\nNew City\nAt Imus, Cavite\n\nWelcome home to Lancaster Estates. With more than 1000 hectares covering Imus, Kawit, and Gen Trias, LNC is primed to become Cavite's first full-fledged \"New Town\" development. Being just 15 minutes away via Cavitex, LNC is set to become the most accessible development of its kind from Manila.","id":"1587456791491606"},{"name":"Clifford Smith & Buchanan Solicitor Estate Agents","description":"FREE legal conveyancing advice when we act as your estate agents\n\nWe're solicitors AND estate agents; sell your house, get legal advice BUT if you ask us for both you get FREE conveyancing advice!*\n\nWe have clients all over the country and more all over the world. \n\nKeep up to date with 24 hour file tracking. Check out our website for all the latest properties for sale in East Lancashire. Skip through outdated stock on national estate agent sites; come straight to the solicitors to cut out the middle man. SAVE TIME AND MONEY!\n\nLike us on facebook to see day to day property updates and news.\n\nGet online quotes for conveyancing even if we are not your estate agents.\n\nGet an online quote for your new will.\n\n*See terms and conditions\n\n","id":"476049212406225"},{"name":"House For Sale - Flushing, MI","description":"A FANTASTIC, WELL KEPT FAMILY HOME! Includes: a beautiful Hickory kitchen with gorgeous Granite counter tops, high performance Andersen windows, firelit living room, a large master suite with a cozy jacuzzi tub, master bathroom and walk-in closet, main floor laundry and 1\/2 bath off the back door, a full finished basement where there is a family room, weight room, 5th bedroom and tons of storage space.  All of this and a private back yard w\/large deck and above ground pool for summer fun.\n\n","id":"1585244668365511"},{"name":"House for sale Malaysia","id":"373152352709228"},{"name":"House and Lot for Sale in Pampanga","description":"Pampanga Houses is an online search portal specifically designed to help you find Affordable Quality Homes in Pampanga. So if you are looking for a house and lot that fits your budget, and you want to live in Pampanga (San Fernando, Mexico and Angeles City among others), just log on in our website, www.pampangahouses.com and get what you want. We are here to serve you and give you a house from Pampanga which you can call a home.\n\nCurrently, we are an accredited marketing arm for the Palms Lakeshore Pampanga. It is a 65-hectare house and lot development project that is residing within the borders of San Fernando and Mexico, Pampanga. It is located at Km. 71, NLEX, Mexico, Pampanga. Profriends and the owner of Lakeshore joint together to bring this very beautiful place in Pampanga in the hearts of many, making it available to a large number of people who want to own their dream home. ","id":"310114339103343"},{"name":"Call Renee Estate Sales & Auction House","description":"In Business over 25 Years! We understand what you are going through.  We are an estate sale service that liquidates personal property due to a death or move - We liquidation all house contents with an estate sale - can bring smaller estates to our local warehouse mart - and offer monthly auction events  \n","id":"112269678868827"},{"name":"House for Sale","id":"783748025041425"},{"name":"House & Lot for Sale in Nueva Ecija","id":"266357646821598"},{"name":"House & Lot - For Sale","id":"558726324216164"},{"name":"House for Sale & Rent","id":"613141192052126"},{"name":"House Proud Gifts & Homewares","description":"House Proud is one of Gippsland’s premier destinations for gifts, interior décor, jewelry and beautiful home wares. Stocking some of Australia’s best brands including Glasshouse Fragrances, Cristina Re, Royal Doulton, Wedgwood and many more.","id":"186883931447049"},{"name":"HOUSE & LOT SALE","id":"569883059731130"},{"name":"Jade Residences - Sales Information Cheap House And Lot In Imus Cavite","description":"Jade Residences\nCheap House And Lot For Sale In Imus Cavite - Jade Residences Townhouses thru pag-ibig financing.\n\nCharles Builders Group of Companies invite you to live in a community where everything you need is within your reach.\nWe believe in providing our residents with the best balance of nature and urban living.\nOur residential estates abound with wide open spaces, lush green landscapes, and well maintained amenities that afford families infinite opportunities for fun and leisure. Within each community, the beauty of nature is blended with the comforts of well-designed houses.\nCome and step into an environmental-friendly community where you can spend your days in a fresh and peaceful setting all thoughtout the year.\n\nJade Residences by Charles Builders\nLocation: Malagasang 1, Imus Cavite\n\nSample Computation\nPAG-IBIG FINANCING:\nTotal Contract Price: Php 828,000\nLoan Value: Php 791,000\nEquity: Php 37,000\nReservation fee: Php 5,000\nEquity in 6 months: Php 5,333 \/mo.\nHDMF Mo.Amort: Php 5,796 \/mo.\n\nHDMF Monthly Amortization\n30 years to pay: 5,796\/mo.\n25 years to pay: 6,098\/mo.\n20 years to pay: 6,609\/mo.\n15 years to pay: 7,553\/mo.\n10 years to pay: 9,590\/mo.\n05 years to pay: 16,033\/mo.\n\nHouse and Lot Specs:\nLot Area: 36sqm\nFloor Area: 42sqm\nStarting Price: Php 828,000\nProvision for 2-3 Bedrooms\nProvision for parking\n\nINITIAL REQUIREMENT (YOU MAY BRING IT DURING TRIPPING COMPLETE WITH RESERVATION FEE):\n\nPhotocopy of Company ID (Back & Back)\n1 Month Payslip ( a must for reservation)\nMembers Status Verification Slip (MSVS) or Employee Status Accumulated Value (ESAV)\nP5K Reservation Fee\n\nFor Reservation and House Viewing: Call\/Txt Us:\n0928-755-4910 (smart)\n0922-651-6248 (sun)\n0927-955-4564 (globe)\n0908-283-9679 (viber) ","id":"1444291849208977"},{"name":"House and Lot For Sale","id":"102991929749395"},{"name":"House for sale in Miri","id":"193458684134399"},{"name":"House and Lot for Sale in Cagayan De Oro","description":"We markets all the brands of developers in Cagayan de Oro such as Ayala, Tuscania ,Camella , Johndorf , Xavier Estates and Peublo De Oro, and some with all varieties of house types or condo types. Cagayan de Oro is Blooming and booming.","id":"287082418145993"},{"name":"Pinoy Rent2Own House and Lot for Sale","description":"Welcome to phrent2ownhomes your one stop real estate shop. We offer rent-to-own house and lot and lot only properties in Cavite, Laguna, Bulacan, Rizal and Metro Manila ranging from low cost housing to high end units. Projects is either on pre-selling or ready for occupancy payable through Pag-IBIG, In-house or Bank Financing. Browse around the page to find the ideal townhouse for sale or lot only you always wanted. \n\nEmail inquiry@phrent2ownhomes.com  or call +63927 679 5516 for more information. Tara tripping na, kaibigan.\n\n","id":"171189242923136"},{"name":"House and Lot for Sale in Pampanga","id":"248430805268027"},{"name":"Cagayan de Oro House and Lot for Sale","description":"Are you Selling your properties? Or Looking for house and lot for sale? Cagayan de Oro House and Lot for Sale is here to give you a good service and give you information about CDO Properties for sale, CDO properties for rent or lease, and CDO properties for assume.\n\nWe also specialize low cost and high end properties here in Cagayan de oro City such as CDO condominiums, CDO Lot properties for sale or for lease, and pre selling house and lot of all Developers in Cagayan De Oro City. \n\nLet's Get in Touch:\n\nGlobe Mobile Phone: +63917 6608684 \nTM Mobile Phone: 0905 954 4687\nEmail: cdohouseandlot2011@gmail.com","id":"133701806727758"},{"name":"SALE HOUSE Tienda de ropa","description":"SALE HOUSE es una tienda virtual de ropa nacional e importada de primeras marcas. Las prendas son nuevas y usadas (muy pocas posturas y en excelentes condiciones) a precios súper accesibles. Castelar y Belgrano, Buenos Aires.","id":"1606424919627869"},{"name":"House & Lot (Bahay at Lupa) -Pinoy Property for Sale","description":"Let me assist you in buying your DREAM HOME....\"Bakit ka pa mangungupahan kung pwede ka namang magkaruon ng sariling IYO\" \n\nStart building your dreams- House & Lot (Bahay at Lupa)\n\n\n\n-Pinoy Property for Sale \nAllan & cielo Pagcaliwagan\n","id":"115180101959138"},{"name":"Iloilo House For Sale","description":"You deserve these homes. A place for your dream to realize and live life to the fullest. FREE Tripping Daily! Call 09274734247","id":"418593858246136"},{"name":"House & Lot\/Condo For Sale","id":"521146987994001"},{"name":"Pabbi Sales Agency\/ Pen House","id":"222976644416440"},{"name":"Sheridan, Wyoming House for Sale","description":"\n721 South Main is a cute little one or two bedroom house located in the nice little residential district south of the Courthouse.  It's the oldest house on the block, built in 1905.  - it's all been updated, with 2 new bathrooms, a durable metal roof, and a high-efficiency furnace.  The house comes with an extra lot, bordered by a planter filled with raspberry bushes.  The tiered garden has great planting areas for tomatoes or whatever you like.  Also included with 721 is a pretty nice three car heated garage, built in 2006.  \n\nThe property is zoned R-2, so you can have a little business if you like.  Here is a site where you can see the zoning rules:  http:\/\/qcode.us\/codes\/sheridan\/\n\nPlease contact me if you have any questions.  My cell phone number is 307.752.9011, and my email is kcogs@yahoo.com.  We look forward to hearing from you!","id":"251372741679630"},{"name":"House and Lot for Sale - Carmona, Cavite","description":"Property Company of Friends, Inc. (PROFRIENDS) is one of the most trusted and leading property development firms in the Philippines.  In the span of 13 years, PROFRIENDS have finished  and delivered 52 project","id":"567625599937067"},{"name":"House for sale Pereybere Mauritius","description":"House 400m2 on a plot of 700m2 situated 800m from the sea.\n\nRs 9.000.000 negociable.\n\nGround floor:\nLivingroom, dining room of 39m2.\nAmerican kitchen of 15m2.\n1 large bedroom of17m2.\n1 large bedroom of 16m2.\n1 bathroom with toilet of 9,5m2.\nCovered patio.\ngarage.\n\nFloor:\nlounge, library, TV room of 62m2.\n1 bedroom suite with a room of 21m2 and a bathroom and toilet of 9m2.\n1 large bedroom of 25m2.\n1 large bedroom of 17m2.\n1 bathroom with WC of 10m2.\nCovered terrace with Jacuzzi.\n\nElectrical Installation Standards CE 30mA.\nFully Cable TV \/ SAT, telephone and computer network.\nAlarm with telephone dialer.\n2 gates includ an electic one.\nSolar water heater.\nWater pump.\nWater Tank up to 3000L.\nPaved parking for 4 to 6 cars.\nPerimeter wall of more than 2m.\n\nExterior paint redone.\n\nNew double layer waterproofing.\n","id":"180179492035851"},{"name":"House and Lot for sale in Philippines : MGO Realty","description":"*\"M. GO REALTY - Philippines real estate.House and lot and condo for sale particularly BF homes Paranaque, Bf Resort in Las Pinas, Ayala Alabang Village.SMDC, DMCI, Ayala Land, Cityland, Suntrust,Lando","id":"265661713595870"},{"name":"House and lot for sale in Dauis Panglao Island Bohol","description":"For sale are either\n1: The house with garden and swimming pool (991 sqm) only or\n2: The house with garden and swimming pool plus the land and the started construction to continue (all together 4531 sqm).\n\nMore details:\n\nLocation:\n\nLas Brisas is ideally located on Panglao Island, near to Tagbilaran and also only a few minutes drive to the best beaches of Bohol. The land is in the second row from a cliff at the end of a small road, offering a beautiful view over the Mindanao Sea to Camiguin Island and Pamilacan Island. An access to the sea is only a short walk away.\n\n\nLots and houses:\n\nThe land of Las Brisas consists of two large lots (2038 sqm, tax dec plus 2260 sqm, titled,= 4298 sqm) plus a part of a third lot, which is the private road (233 sqm). The whole area is 4531 sqm). Both lots have clean papers with one owner, which makes a transfer of ownership safe and easy for the buyer.\n\nThe two large lots were surveyed to divide them into 10 subdivision lots plus road. This surveyplan is now for approval and then ready for further processing at the Registry of Deeds, if required. So the land may be used in one piece or it may be divided into 10 subdivision lots with their own titles. How many of these sudivision lots later will be combined to single properties may be handled flexible, e.g. Lots 9 and 10 now are meant to be used together for the house with garden while number 5 with the unfinished house under construction can be used o lot number 5 only as well as in combination with lots number 4 and\/or number 6.\n\nThe finished house is on lot number 10 with a garden and swimmingpool on lot\nnumber 9. Both lots together have an area of 991 sqm. The house has a large livingroom with kitchen, a bedroom downstairs, two bathrooms, a very large room upstairs, two terraces, carport and stockroom. The total living area indoor is aproximately 140 sqm and including terraces approximately 185 sqm plus carport.\n\nDistances:\nGeneral Hospital 10 min\nDowntown Area 10 min\nSeaside 1 min\nShopping Mall 10 min\nPolice Station 5 min\nFire Station 10 min\nDomestic Airport 20 min ","id":"1391506727771451"},{"name":"House For Sales KULIM and Padang SERAI","id":"592906014124650"},{"name":"House for Sale in Denver, Iowa","id":"626842854114169"},{"name":"House and Lot for Sale: Queenstown Heights 2","description":"Ready for Occupancy at 10% Downpayment,.... Fastest developing Real Estate,... na ang motto ay affordable houses for every people.\n\nHouse and Lot for sale by duraville realty and development Corporation, The best place that they are currently selling is the \"Queenstown Heights 1 and 2\" Located in Antipolo City,... and Antipolo City is the best place for living, kasi malapit ang antipolo sa business areas, just one ride away sa mga terminal of jeeps and taxis. And Duraville are offering their houses with a 10% Downpayment (DP) then your ready to move in, and there are some houses that are Ready for Occupancy (ROF). And I suggest Queenstown Heights, like Britanny 1 and 2 at antipolo it was easily sold.","id":"220444614660304"},{"name":"Irdina BABY HOUSE SALE","description":"CARA MEMBUAT TEMPAHAN DAN BAYARAN:\n1. PILIH BARANG\n2. PM\/EMAIL(ainanabiha82@gmail.com) :\n    A) NAMA PENUH\n    B) NO TEL\n    C) ALAMAT PENGHANTARAN\n    D) ITEM KOD & DESCRIPTION & QTY\n3. TUNGGU CONFIRM ORDER SERTA JUMLAH HARGA DARI KAMI\n4. BANK IN & INFORM KAMI\n5. PENGHANTARAN","id":"491080054290336"},{"name":"Vilcabamba house for sale","description":"* Beautifully restored ecuadorian adobe house\n* Located a 15 minute walk to the centre of \n  Vilcabamba.\n* Amazing views of  Mandango and Vilcabamba\n* Private, secure and fully fenced\n* Manageable terraced organic gardens\n* Space below the main house for building an extra \n   bedroom, bathroom and small kitchenette, with \n   plumbing for the septic tank already installed \n   underground.\n* Raised vegetable beds\n* Lot size 500m2\n\nAccommodation comprises:\n\n* Living room\n* Large kitchen with built-in oven and stove top\n* Large bedroom with built-in closet\n* Spacious bathroom\n* Separate laundry\/bodega with washer and dryer \n* Exterior fully covered meditation\/yoga\/hangout \n  space\n* Backup water cistern\n* Custom wooden shutters on all windows\n* Wooden floors in bedroom and living space","id":"1563394277222021"},{"name":"DMCI Homes In-house Sales","id":"1571036719774393"},{"name":"House and Lot,Condominium For Sale","description":"LOCATION-Caloocan,Valenzuela,Quezon City,Katipunan,Manila,Pasig,Makati,Taguig,Las Pinas,Alabang,Antipolo,Teresa,Cavite,Laguna,Cabuyao,Laoag,Bantay,Candon,Tuguegarao,Isabela,Pangasinan,Tarlac,Cabanatuan,Pampanga,Bulacan,Bataan,Batangas,Quezon,Palawan,Camarines Sur,Legazpi,Iloilo,Bacolod,Cebu,Bohol,Dumaguete,Leyte,Ormoc,Cagayan De Oro,Butuan,Pagadian,Davao,Ozamis,Tagum,General Santos","id":"353262838126433"},{"name":"House and Lot for Sale","id":"288356717981188"},{"name":"Realty House Land Condo Sales","description":"Affiliated to SMDC, DMCI, Sunshine 100, Ace plaza, State Land Inc., Land works","id":"153269928087299"},{"name":"House And Lot For Sale In Cebu","description":"Cebu House and lot for sale listings, we are Cebu Brokers and agents that will be providing and updating housing projects, photos, pricelist, and payment computation.","id":"643407949034028"},{"name":"House for Sale - Hazelwood Sth, Vic","description":"On Top of the World on 30 Acres\nBed 5+ Bath 2+ Car 2+\n\nThis stunning 5 bedroom + study home sits high in the hills of Hazelwood South, overlooking the entire Latrobe Valley.  Yet it is only 20 minutes drive to Traralgon.\n\nWith million dollar views, that come around once in a lifetime, this is a property to be inspected quickly.\n\nThe home sits on 30 acres (20 clear and 10 bush) and was built in 2006 by Neilson's Builders.\n\n\n-The incomparable appeal of panoramic views is merged with modern features to create this\nspectacular family domain\n\n-Presenting an easy flowing layout designed to take every advantage of that view!\n\n-Two living zones that open to a huge outdoor area\n\n-The main bedroom includes a full ensuite including a bath and two separate walk-in robes. The other four bedrooms all have extensive robes\n\n-Connoisseurs kitchen with extensive walk in pantry, multipurpose rooms, powder room, fantastic\nstorage\n\n-This property has been designed to provide a sensational living and entertaining environment \n\nAsking price is $695,000\n\nFor full information please contact Rob Wilson at Wilson Real Estate on 0417 743 311","id":"908290059231390"},{"name":"House and lot for sale in davao","description":"2 story canadian style house..For sale for the price of 2.6 million.. 120 square meters, clean title, no debt on taxes, 3 bedrooms and 3 bathrooms.. with the living room, dining room. kicthen with built in cabinets, and a lavatory..","id":"128828527307761"},{"name":"House and Lot for Sale In Camiguin","id":"524720774233835"},{"name":"Shoals House for Sale by Owner","description":"This page has been created so that if you do not want to list your house with a Real Estate agent, you can market it yourself here for free!","id":"201616706597274"},{"name":"House for sale","description":"Pretty, totally renovated bungalow.  Two bedrooms, 1 bath, with unfinished basement.  Two-car detached garage.  Everything new - open concept.  Price reduced to $65,500. Must see!","id":"478270228987194"},{"name":"House and lot, condominium, townhouse for sale","description":"We are selling affordable and quality house and lot to Filipinos who are here and abroad. See if we can help you realize your dream of owning a home. Check often for more promotions, news and discounts we offer to you.\nRenting? Are you not tired of paying rent every month with nothing to show for your money? Now is the time you make a decision to buy a house for you and your family. Because home ownership provides several benefits, in addition to the satisfaction of being a home owner, no more landlord, possible tax deductions and more importantly you can start building your equity.\nFor your inquiries please call 0928-2812506\nor email peng.enoya@yahoo.com.ph","id":"528338733843384"},{"name":"House & Villas for sale","id":"1549655365256750"},{"name":"Scott Herman, Sales Representative - Realty House Inc.","description":"Want to view a property? I would be happy to set up showings for you! Want to know what your house is worth? Contact me for your FREE home evaluation! Call, txt or email me anytime! ","id":"1523231894561289"},{"name":"House and Lot for Sale","id":"528951597216632"},{"name":"House and Lot for sale in the Philippines","id":"283957035100319"},{"name":"House For Sale in Gen.Trias Cavite. \"lipat agad\" Bellavista","description":"Location: Along Arnaldo Hi-way, Brgy. Santiago, Gen. Trias Cavite. Near Sm Dasma, Robinson Pala-pala, Lyceum, Purefoods Hormel, FCIE.\nHouse Type: Townhouse\nLot Area: 50 sq.m.\nHouse Floor Area:53 sq.m.\nHouse Bedrooms: 3\nHouse Toilet & Bath: 1\nHouse Condition: RFO\nPROMO & DISCOUNT: LIPAT AGAD! Early Move-in (cash out 23k)\nSAMPLE COMPUTATION: PAG-IBIG FINANCING\nTCP: 950,000 (as of Jan. 2015)\nProcessing Fee: 3,000\nReservation Fee: 5,000\nDown Payment: 15,000\nLoan Amount: 933,000\nMonthly Amort.\n30 yrs. 7,173.19\n25 yrs. 7,512.58\nNote: Prices are subject change without prior notice.\nFor reservation & Tripping Pls. Call\/Txt Us","id":"1546133452318081"},{"name":"Land & House for Sale & Rent in Laos","id":"675201039232952"},{"name":"House for Sale in Antigonish","id":"1423517954567505"},{"name":"Bacolod City Real State House and Lot For Sale","description":"We are a  real estate agents base in Bacolod city, Negros Occidental Philippines. \n\nBacolodcityrealestate.com was created for the purpose of providing quality and Honest information to Buyers who wants to invest in Bacolod Real estate.\n\nOur goal is to provide quality and honest service to our clients.\n\n","id":"1466924803577899"},{"name":"House 4 Sale Peoria AZ","description":"Why rent when you can buy it, Snowbirds? \nThis 2 bedroom, 1 bath manufactured home is in a Age Qualified Community. 50+\n\nThis well community features an Olympic Size Heated Pool - for year round swimming, Hot Tub, Billiard and Game Room, Large TV Lounge - Perfect for Football season, Exercise Room, Library and Computer Lounge.\n\nSELLING FOR $12,000.00\n\nThere is a lot fee which is like a condo fee for maintenance of grounds, etc\n\nIf interest please message me for more information. Thank you","id":"689943551071291"},{"name":"Rent to Own House and lot for sale in Laguna,Cavite and Batangas","description":"Are you looking for Affordable Rent to own House for sale in san pedro laguna, Binan laguna, Sta. Rosa Laguna, Cabuyao Laguna, Calamba Laguna, Imus cavite, bacoor cavite, tanza cavite, Lipa Batangas, Sto. Tomas Batangas. House and lot for sale in laguna. Rent to own house, affordable house and lot, murang pabahay sa laguna.","id":"1427242517541624"},{"name":"Orchard House for Sale","description":"House and Lot for Sale\nGreenmeadows at the Orchard\nBrgy. Salitran 4, Dasmarinas, Cavite\n\nREADY FOR OCCUPANCY\nClean Title\nContact Jerome at +63-917-586-9582\n\nLot Area: 150sqm\nFloor Area: 190sqm\n\nFeatures:\n- Master Bedroom with CR\n- 2 Bedrooms with shared CR - Guest CR\n- Maid's Room with CR\n- Living Room\n- Kitchen\n- Dining Room\n- Garden\n- 1-Car Garage\n- Balcony\n- Attic for Storage\n- Laminated Cabinets in all Bedrooms\n- La Germania Gas Range and Exhaust\n- Shoe Rack\n- Anti-Termite System\n- Laundry and Dry Area\n- Fire Extinguisher\n- Doorbell\n\nVisit this website for more details: http:\/\/www.lamudi.com.ph\/house-and-lot-for-sale-greenmeadows-at-the-orchard-109262-21.html","id":"1477240012548848"},{"name":"Metro Bacolod House and Lot for Sale Low Cost Housing in Negros Occidental","id":"146060115414124"},{"name":"Vermont House For Sale","description":"My beautiful Vermont home is for sale.  It is situated on a 3 +\/- acres parcel in 100 acres of rural beauty.  The property is adjacent to pond and an alpaca farm.  While secluded and private, the home is located 3 miles from fun-&-quirky-&-artsy downtown Brattleboro, VT.  It has a chef's dream of a kitchen, and wildlife abounds.  It has been a true joy to live here, but it needs some younger bones to care for the gardens, and breathe life into the home. ","id":"1630661430496961"},{"name":"House and Lot for Sale","id":"266814673514680"},{"name":"House and Lot for sale in Cabuyao Laguna","id":"862110663822352"},{"name":"House for Sale In the Mexican Caribbean","description":"Your own piece of paradise in a quiet Mexican Caribbean town, Puerto Morelos…..just $69,900 U.S. Casa del Sol y Luna in Puerto Morelos, is a 2 bedroom, 1 bath home with a fully walled and gated front courtyard and garden, and a fully walled and private back courtyard, complete with POOL, outdoor kitchen, dining area and lounge area. The interior is painted warm Mexican colours, with an open concept living\/dining and kitchen area, 2 generous bedrooms with built in closets, and a bathroom with high ceilings, screened window and new vessel sink, tile counter, floor and large shower. The kitchen has a new fridge and 6 burner stove, a separate convection oven, ample shelving and newly tiled counters  and breakfast bar. The home has a new roof (2012), water tank, gas hot water heater, a full sand filtration system for the pool, city water and is on city sewer. Casa del Sol y Luna comes fully furnished, sleeps 6, and contains all amenities you will need – just bring your suitcase. Villas Morelos 1 is a quiet safe neighbourhood of working class families, and the location of the home is a 5 minute walk to all stores, restaurants, services and local amenities. The bus is just 4 houses away, allowing travel to the beach in just 5 minutes. \nhttps:\/\/maps.google.ca\/maps?output=classic&dg=brw\n","id":"544568695686834"},{"name":"House for rent & sale in Sydney, Melbourne, Adelaide, Queensland","id":"764496196908688"},{"name":"Saleem cap house","id":"853662234654306"},{"name":"\"Sisters in Charge Tag Sale Professionals ~ House Clean out Liquidators\"","description":"WE ARE A FULLY LICENSED AND INSURED, FAMILY OWNED AND OPERATED BUSINESS\n","id":"305655245516"},{"name":"House for sale","id":"529589160514082"},{"name":"House and Lot For Sale","id":"1466968883518535"},{"name":"House for Sale by owner Western Maryland","id":"1434367250132670"},{"name":"Cebu House and Lot For Sale ( Flaminia Real Estate Center )","description":"Cebu House and Lot For Sale-were affiliated with (Flaminia Realty) the biggest and the largest Real Estate Marketing Company in Cebu City Philippines.With an office address at RE-CJC Building North Road Highway Basak Fatima, Mandaue City Cebu Philippines. We were ready to assist you in buying and selling or leasing Real Estate properties in Cebu City and province. We help people to provide effortless experience in buying, selling or leasing the best possible.We are fully focused on our client needs and provide end-to-end service, sourcing prime property investment. We assist our clients to source property  for investment.We have a complete listings of alldifferent type of properties from our top rated real estate developers.\n","id":"251513591566977"},{"name":"Rent to Own House and Lot for Sale in Laguna Cavite","description":"house and lot for sale in cavite, house and lot for sale in laguna, house and lot for sale in batangas, rent to own house in laguna, rent to own house in cavite, house for sale in cavite, house for sale in laguna, house for sale in batangas, rent to own house in batangas, part time job in laguna, job in laguna, Laguna Technopark, FPIP, Lima Technology Center, Tagaytay Hampton Villas","id":"207567509349519"},{"name":"Las Pinas House For Sale","description":"Find affordable house for sale in Las Pinas City, Metro Manila.  Available houses for sale are ready for occupancy where you can transfe immediately.  \n\nAlso for sale are pre-selling houses where you can pay downpayment up to 18 months without interest.\n\nCall us.  Pm us for more information.","id":"840863305928929"},{"name":"House And Lot For Sale Daang Hari, New Molino Blvd.Bacoor Cavite","description":"About Us\nHISTORY\n\nWithin a decade of the establishment of Ultima Development, Inc. in 1976, the company’s goal to go beyond housing development and into providing a unique home lifestyle for the Filipino people became clearer. Masaito Development Corporation was born.\n\nMDC began developing its residential subdivisions that included Concorde, Regency Homes and Citihomes Regency, all in Parañaque City. As decades passed, MDC marched forward, moving from developing residential subdivisions to master-planning entire communities that featured plush amenities and other modern conveniences.\n\nMDC’s strength in the business grew in the foundation of its prime locations. Along with having accessible travel routes and convenient amenities within and around its setting, MDC made it a point to give utmost comfort along with quality affordable homes a uniquely complete lifestyle that homeowners rightfully deserve. It is a strength that earned MDC the recognition as the 2009 Outstanding Properties Developer by the National Consumer Affairs Foundation (NCAF), Asia’s pioneer consumers group.\n\nToday, more than 30 years since its foundation, MDC stands proud through its flagship projects: Bellazona, Covina, Covina Villas, Vallejo Place, Fairgrounds and Springfield in Cavite, and Brentwood Village and Brentwood Gardens in Pampanga. And in keeping to its promise, Masaito continues to provide quality homes and affordable housing in prime locations, all in aspiring to improve Filipino lives and lifestyles.","id":"666573453384916"},{"name":"House and Lot for Sale in Quezon City","id":"33907518818"},{"name":"House and Lot for Sale","id":"1533570886874370"},{"name":"House for sale by owner","description":"Located at 111 Roman Drive in Dieterich, IL, this 2 bedroom 1 and 3\/4 bath home with a full basement and 2 care attached garage is located on approximately 2\/3 acres at the end of a private cul-de-sac. Priced at $117,900. \n\n\nFEATURES: Built in 1982 by the current owner. Gas, forced air heat and central air conditioning, also an attic fan. New sump pump in basement and the roof is only about 8 or 9 years old. Vaulted ceilings in living room, kitchen and dining area. Wood parquet floor in entryway. \n\nFor more information go to ...\n\nhttp:\/\/propertyinquiry.co.effingham.il.us\/propertyinquiry.pl?rm=print&parcel=0220002020&year=2015\n\n\nSerious inquiries only call Chuck at 217-821-5669. NOT AVAILABLE TO RENT!\n ","id":"1651800588368855"},{"name":"Hereford House for Sale","description":"The house is listed through Rio Verde Realty, but we are more than happy to make ourselves available to show the house to you at your convenience and to answer any questions you might have. \n\nIt is in a great, central location that's ideal for Naco or Douglas Border Patrol agents, those stationed at Fort Huachuca, retirees and families.\n\nThe house sits within the Palominas School District, which - we've been told - is the best school district in Cochise County. The school bus picks up at the end of the road.\n\nDetails below and more on our website:\n\n - 3 bedrooms, bonus room, 3.5 bathrooms (all bedrooms have an ensuite bathroom and all except one of the bathrooms have urinals)\n - 2,597 square feet\n - 4 fully-fenced acres, with three entrances\n - Bonus room (currently being used as exercise room)\n - Laundry room\n - Gas fireplace\n - Garage\n - Beautiful in-ground pool with brand new energy-efficient, quiet pump, and waterfall\n - Brand new roof in Jan. 2015 with a 4-year transferable warranty\n - Built-in home audio in the dining\/living room\n - Split floor plan\n - Wet bar\n - Brand new central A\/C gas pac unit with heating\n - Spacious patio and courtyard for entertaining lots of guests\n - Expansive open floor plan with ceramic tile throughout\n - Trailhead approximately one-mile from the house\n\nPrice: $279,000\n\nPlease feel free to call\/text (360-306-7089) or email (tanya.r.morrison@gmail.com) us with any questions.","id":"1581892822062854"},{"name":"House & LOt For Sale","id":"240246146004700"},{"name":"Zamboanga City House and Lot for Sale","id":"414176968738908"},{"name":"Potato House Barn Sale","id":"197211743644001"},{"name":"House and lot for Sale Baliwag Bulacan","id":"1456938041203978"},{"name":"Philippines House and Lot For Sale","id":"688649507833702"},{"name":"Rent or sales apartment,condo,house or shop","description":"We are dedicated in providing you the Best Service in Buying, Selling or Renting properties, helping you to get the best property deals in the Shortest Time possible, most Effective & Efficiently. Our philosophy Stop selling. Start helping. It is not my customer job to remember me. It is my obligation and responsibility to make sure you don't have the chance to forget me. Always Provide excellent sales service to our client, make your sales transaction a hassle free and enjoyable one. or you want to join our this big family, also welcomed to call me...","id":"516027898453332"},{"name":"House and lot for sale","id":"328799233926666"},{"name":"House and Lot For Sale","description":"NEW House Model: ESPERANZA\nFloor Area: 36 SQ.M.\nLot Area: 100 SQ.M\n\nDESCRIPTION: 2 BR \/ 1 T&B\nReservation Fee: 40,000.00\n20% DOWNPAYMENT (inclusive of miscellenous): 465,888.00\nOR \n6 Months Downpayment: 70,981.33\n12 Months Downpayment: 47,32.89\n15 Months Downpayment: 35,490.67\n18 Months Downpayment: 23,660.44\n\n80% BALANCE: 1,381,040.00\n5 Years @ 9.5% interest per Annum: 29,004.41\n10 Years @ 9.5% interest per Annum: 17,870.33\n15 Years @ 9.5% interest per Annum: 14,421.16\n20 Years @ 9.5% interest per Annum: 12,873.10\n\nFor Site Viewing Feel free to Contact","id":"668647739927789"},{"name":"House and Lot & Condominiums for SALE","description":"text or call 09267317092\nfor more information\n\n☛HOUSES IN BULACAN\n☌RESIDENCIA DE MUZON - Muzon, San Jose del Monte\n☌SPRING TOWN VILLA - Gaya-Gaya, San Jose del Monte\n☌VILLA MUZON -  La Poblacion San Jose del Monte Bulacan\n\n☛PAYMENTS AVAILABLE THROUGH\n☌IN HOUSE\n☌BANK FINANCING\n☌PAG-IBIG\n\n\n☛REQUIREMENTS\n☌ for locally employed\n☌ for OFWs","id":"153751001359827"},{"name":"Bacolod City Cars, House & Lot For Sale","description":"Welcome to Bacolod City Cars, House & Lot For Sale Facebook Page!\n\nDon't forget to share us with your friends!\n\nIf you enjoy using our service, please consider telling your friends. Not only will they be thankful, it'll also help us improve our service and make sure we can keep offering it for free!\n\nJoin our Facebook page?\n\nWe would appreciate if you support BACOLOD CITY CARS, HOUSE & LOT FOR SALE by clicking on the Facebook \"like\" button. This will allow us to keep you up-to-date about new offers and development and you can have input on how Bacolod City Cars, House & Lot For Sale will be improved.\n\nFOR INQUIRIES FEEL FREE TO CONTACT:\n\nRONA D. BUQUIS\nProperty Investment Endorser\nLeuterio Realty & Brokerage (Filipino Homes)\nRent Manager\/Specialist at Rent.ph\nCall\/Text: + 63 923-133-5887\nEmail: roan2177@yahoo.com\n","id":"255019944700799"},{"name":"FW Mueller's  WholeSale House","description":"We sell -cool items \nGENERAL Merchandise and all KINDS of Stuff\nWe BUY Items from You","id":"406184952781349"},{"name":"House & Lot for Sale","id":"654834931268992"},{"name":"Wendy Clifford - freelance Sales,  house and pet sitting too","id":"603626983072100"},{"name":"Grimisdale Guest House For sale","id":"1671388299763141"},{"name":"Rumah \/ House for Sale  \/ JOHOR","description":"Baik – anda sudah bersedia dengan sedikit sebanyak maklumat anda. Oh ya, nanti dulu. Saya cadangkan anda menggunakan no. telefon bimbit untuk menghubungi perunding hartanah tersebut. Saya tidak menghalang mana-mana pembeli yang menelefon perunding hartanah menggunakan nombor telefon pejabat. Itu urusan anda dengan majikan anda. Namun hal ini menyukarkan perunding hartanah tersebut untuk menghubungi anda semula kerana jika merka menelefon kembali nombor pejabat, kemungkinan besar akan sampai ke operator dan bukan anda. Katakanlah sejurus anda meletakkan telefon, ada peluang yang terbuka untuk anda namun perunding hartanah tersebut tidak dapat menghubungi anda kembali – anda yang rugi.\n\n* Panggilan menerus telefon bimbit dilihat sebagai komitmen awal dan kriteria pembeli yang serius oleh sesetengah perunding hartanah.\n\nJikalau panggilan anda tidak berjawab, tinggalkan SMS atau WhatsApp. Sekiranya memang peluang dan rezeki rumah itu untuk anda, anda akan dihubungi kembali oleh perunding hartanah tersebut.","id":"1470015416630139"},{"name":"NaturHouse Salerno","description":"Il luogo ideale dove puoi raggiungere il tuo \"PesoBenessere\" e restare in forma in modo NATURALE,SEMPLICE ed ECONOMICO.\n\nNaturHouse offre ai suoi clienti un percorso di EDUCAZIONE ALIMENTARE  reso efficace dall'impiego d PRODOTTI ESCLUSIVI, prevalentemente complementi alimentari,validati da un qualificato Dipartimento Tecnico-Scientifico ed autorizzati dal Ministero della Salute Italiano.\n","id":"439315736111933"},{"name":"Loxahatchee House for Sale","id":"1488565921419528"},{"name":"House For Sale - Belgium","description":"Surface habitable\/Livable area - 568 m² \nSurface du terrain\/Land area - 1,527 sqm \nBuilt surface\/Surface batie - 568 m² \nNombre de chambres\/Number of rooms - 5 \nSalle de bains\/Bathroom - 3 \nSalle de douches\/Shower - 2 \nBureaux general\/General offices - 1 \nAlarme\/Alarm - yes \nTerrasse\/Terrace - yes \nJardin\/Garden - yes \nGarage\/Garage - yes \nLargeur facade\/Width facade - 19.3 \nTerrasse\/Terrace - 20 m² \nGarage - 2","id":"291136987761454"},{"name":"Salema's GuestHouse","id":"287618831421200"},{"name":"House and Lot for Sale in Baguio City","description":"This page caters all kinds of houses in Baguio city that are for sale..\n\nPossible buyers or sellers may contact me on 09238984484 or PM me to offer their properties that they wanted to sell.","id":"1570534716568978"},{"name":"House and Lot for Sale","id":"360537947360984"},{"name":"Philippines Tagaytay House and Lot For Sale","description":"Tagaytay, officially the City of Tagaytay (Filipino: Lungsod ng Tagaytay), is a component city in the province of Cavite, in the Philippines. It is one of the country's most popular tourist destinations because of its outstanding scenery and cooler climate provided by its high altitude. Tagaytay overlooks Taal Lake in Batangas and provides one of the iconic views of the Philippines, the view of Taal Volcano Island in the middle of the lake, viewable from several vantage points in the city.\n\nTagaytay is relatively close to the capital city of Manila, only 55 km (34 mi) away via Aguinaldo Highway, providing an easy escape for the locals from the heat of the big city. \n\n(c) Wikipedia ","id":"1519543161634729"},{"name":"Martinsville VA House 4 Sale","id":"727725857259189"},{"name":"House for Sale, Morbihan Brittany France","id":"429421033766702"},{"name":"Wanted to Rent or sales apartment,condo,house or shop","description":"We are dedicated in providing you the Best Service in Buying, Selling or Renting properties, helping you to get the best property deals in the Shortest Time possible, most Effective & Efficiently. Our philosophy Stop selling. Start helping. It is not my customer job to remember me. It is my obligation and responsibility to make sure you don??t have the chance to forget me. Always Provide excellent sales service to our client, make your sales transaction a hassle free and enjoyable one","id":"146142605569260"},{"name":"Affordable House And Lot For Sale In Cavite","description":"Affordable House And Lot For Sale In Cavite As Low As P233 Per Day by Lancaster Estates Cavite \nhttp:\/\/www.realestatecavite.com\nAbout Lancaster Estates\n\n\nLancaster Estates is a 600 hectare housing project that covers 3 towns of Cavite -- Kawit, Imus and Gen. Trias. It is accessible via the Tirona Highway, Coastal Road Extension Highway (CAVITEX), C5 Road Extension, Centennial Road, Proposed Cavite-Laguna (CALA) Highway that will connect Cavite to Laguna. and soon Daang Hari Road Extension..\n\nWith this, residents of Lancaster Estates will be assured of an advanced high-speed link that connects their homes with every major hub of activity. The residents will enjoy a mere 15-minute drive to Mall of Asia, a 10 minute drive to SM Bacoor and a breezy 45-minute drive to Makati.\n\nDriving Instructions\n\nAccess Routes:\nRoute 1: Through Coastal Road passing through Evangelista, Tirona Highway, Centennial\/ CEPZA Road and Advincula Avenue\n\nRoute 2: Via Aguinaldo Highway, passing through Patindig Araw and Bucandala Road\n\nRoute 3: From SM Bacoor passing through Tirona Highway, CEPZA Road and Advincula Avenue\n\nRoute 4: Through Cavitex, passing through CEPZA Road and Advincula Avenue\n\nFeatures and Amenities Landscaped Open Spaces Centralized water system Concrete roads Commercial area 24-hour Security Electricity provided by Meralco Multi-Purpose Area Provision for Shuttle Service Swimming Pool Landscaped Parks and Playgrounds Catholic Church Basketball Court Country Club Entrance gate\n\nAvailable House And Lot Units For Sale By Lancaster Estates\n\n1.) Alice house model is a 40 sqm townhouse on 40 sqm lot area. It has three bedrooms, one toilet and bath, a living room, dining area, kitchen, and a provision for one-car garage.\nTypical Selling price: Php 850,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-alice-house-and-lot...\n\n2.) Catherine house model is a 50 sqm townhouse on 50 sqm lot area. It has three bedrooms, one toilet and bath, a living room, dining area, kitchen, and a provision one-car garage.\nTypical Selling Price: Php 980,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-catherine-house-and...\n\n3.) Diana house model is a 60 sqm townhouse on 50 sqm lot area. It has three bedrooms, two toilets and baths, a living room, dining area, kitchen, provisions for a balcony, CATV, telephone, air conditioning outlet, and one-car garage.\nTypical Selling Price: Php 1,200,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-diana-house-and-lot...\n\n4.) Sophie house model is a 52 sqm single-attached house on 80 sqm lot area. It has three bedrooms, two toilets and baths, a living room, dining area, kitchen, linear park, and a provision for one-car garage.\nTypical Selling Price: Php 1,600,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-sophie-house-and-lo...\n\n5.) Margaret house model is a 72 sqm single-attached house on 100 sqm lot area. It has three bedrooms, two toilets and baths, a living room, dining area, kitchen, Family Courtyard, provisions for a lanai and two-car garage.\nTypical Selling Price: Php 1,950,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-margaret-house-and-...\n\n6.) Gabrielle house model is a 84 sqm single attached house on 120 sqm lot area. It has three bedrooms, two toilets and baths, a living room, dining area, kitchen, Family Courtyard, provisions for a lanai and two-car garage.\nTypical Selling Price: Php 2,350,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-gabrielle-house-and...\n\n7.) Alexandra house model is a 100 sqm single-attached house on 120 sqm lot area. It has four bedrooms, three toilets and baths, a living room, dining area, kitchen, balcony, Family Courtyard, provisions for a lanai and one-car garage.\nTypical Selling Price: Php 2,750,000\nhttp:\/\/www.goldcrestgroup.com.ph\/lancaster-estates-cavite-alexandra-house-and...\n\nAvailable financing payment schemes thru Inhouse, Bank and PAGIBIG.\n\nWe assist OFW and foreigners.\n\nFOR FREE TRIPPING AND FURTHER INQUIRIES PLEASE CONTACT:\n\nCarlo Jesus Carolino\nPRC Real Estate Broker No. 6087\nGoldcrest Property Management Group, Inc.\nGB2 Legaspi Towers 300, 2600 Roxas Boulevard,\nCorner Pablo Ocampo St., Malate,\nManila, Philippines\ncarlocarolino@goldcrestgroup.com.ph\ncarlojvcarolino@gmail.com\n09178392954 \/ 09228478666\n5674867 \/ 5253843\n","id":"538434022851309"},{"name":"City of Bacolod House and Lot for Sale and for Rent","id":"196181617183254"},{"name":"House and Lot For Sale Philippines","id":"181998595211232"},{"name":"House and Lot For Sale in Batangas","id":"1425383574370816"},{"name":"House & Lot for Sale","description":"About Rent.ph\nRent.ph is a nationwide list of properties for rent and property-related services for: renters, rent and property managers, agents and real estate owners. Rent.ph would like to make it easier for owners and renters to connect with each other or with the assistance of real estate experts to enable the rental process shorter, more professionalized, personalized and transparent for both lessees and lessors.\n\nBacked by 2,000 real estate professionals officially affiliated with Rent.ph (and growing) spread across the country, owners can look for the nearest Rent Manager or agent where the property is located to help him market the property to prospects. Renters in search of properties can also seek the services of a Rent Manager or agent near him thus, reducing the effort and search time of renters and owners considerably.\n\nUnique also to the site are rental listings in the hospitality sector to address the search for transient or short-staying renters. We have included listings for hotels, apartelles and inns and other similar accommodations. Homestay listings are also underway as part of our effort to promote tourism in the country thus, the site is getting exciting-er every day.\n\nWith hundreds of listings posted everyday, and growing number of unique visitors daily, the site is also an effective advertising platform for property and rent-related products and services like furniture and home furnishings, logistics and moving-in services, cable, telecom, insurance and a host of other services in home living.\n\nTargeted advertising forms part of the core services in Rent.'s search algorithm. Our main and refine search tools provide a way to display only the most relevant property appropriate to the search.\n\nMore than anything else, Rent.ph would like to be acknowledged as a trusted leader in providing rent information to people who belong to this industry. In fact, we are among the very few in this domain, who invest in research and development to make the website not only reliable in terms of its rent database but also dependable in terms of rich and useful content.\n\n\tVision and Mission Statement\nWe envision ourselves to be the country's ultimate resource in property rental and rent information. Our mission is to establish the most innovative technology platform and best user-experience that bring renters, owners and property professionals together to make the property rental business more efficient, reliable and trustworthy.\n\n\tFirst in Features\nRent.ph is committed to bring the best technology to its users. It is the first property rental site that combines rental listing with rich media tools such as video embedding services which allows users to upload not only images, but also to display videos of their properties.\n\nIt is also the first property rental site in the world to integrate the QR Code system. A listed property property at Rent.ph is assigned a unique QR Code which can be printed out or circulated by email or shared in social networks. The QR code is specially useful to property owners when they need to advertise their property outdoors.\n\nLeveraging Google's map widget, Rent.ph is address-sensitive which accurately locates a property down to its street and barangay address.\n\nWe have also put up the nationwide weather guide to help renters decide the best time of day and week to move. Rent.ph's weather feature is location-sensitive. Whenever a renter searches a property in a particular province, forecast changes according to the weather in that area.\n\nAnother \"first\" in Rent.ph is its short messaging service where prospects can send text messages from the site to the property owner or agent's mobile phone.\n\nWe strive to be the first in everything both in technology and information resource to bring best rental experience to all Filipinos and expatriates.\n\nas seen on:\n-philstar.com\n-sunstar cebu\n-the freeman\n-philippine daily inquirer\n-business owrld online\n-expat newspaper\n-cebu daily news","id":"414256482052680"},{"name":"HOUSE for Sale FIJI Expressions of Interest","description":"Due to changes in family matters it has become necessary to sell our Fiji home.  It is with regret that we find ourselves in this position but have enjoyed many many years holidaying in Fiji.  Now you can enjoy this large spacious family home at a reasonable price.  Expression of Interest and all reasonable offers will be considered.  Please private message us to learn more.","id":"773038386075109"},{"name":"House and Lot for sale located in Argao, Cebu, Philippines.","description":"Hello to all face book friends ! My name is Jay M. Acain , the smart guy behind this facebook page  .\n\n\nI live in Cebu Philippines. I'm an Engr. by profession and I’m an Internet Marketer ,Aim Global network builder, Vice President for online sales and marketing Cebu real estate .\n\nMy friends call me jay .username ” iamrich4ever”\n\nI’m earning my Full time income on the Internet doing affiliate, blogging, social media, networking marketing and selling Real Estate .I keep on learning online, to serve you better . I believe Market is huge here.\n\n\nMy passion is to empower, build, help , & create multiple Income Streams learning and sharing business skill ,bringing the best products that add value to people and create quality service to my potential customer. I am here willing to stay  long term.\n\nI can teach you how to make blog for free,\nso please visit or subscribe to my blog.you can reach me @ my cell no. below.\n\nThank you.\n\n\nJAY\n\n\nJAy M.ACAIN\nCapitol site Cebu\nCebu City,Cebu , Philippines\nCel No 0918.358.5184\nEmailadd: icaremycustomer247@yahoo.com\nyahoo i.d. : caremycustomer247\nskype i.d. :investinyourfuturetoday\n\n\n\nMY REAL ESTATE BUSINESS PAGE :\nclick here :> http:\/\/www.facebook.com\/filipinohomesweethome\n               \n\nMY Health & Wellness Business \nPLS VIEW THIS LINK : > www.aimglobalinc247.blogspot.com \n\nNew Facebook OFW friends Pls add me click here : > www.facebook.com\/jayacain\n\nPls click my page or share to your friends . Thanks !\n","id":"287075551403621"},{"name":"House for sale","id":"740095436063232"},{"name":"House For Sale","id":"523440644466429"},{"name":"Cdo House and Lot for Sale","id":"107127409433621"},{"name":"House & Lot for sale ( Cebu)","id":"113196178749466"},{"name":"Amarillo House For Sale","id":"1505615759726366"},{"name":"House and Lot  for Sale   and Cityscape Condominium for sale","description":"For inquiries contact my nos. +639323601235 sun,+639286165795 smart,+639276371624, email add sepe_cecil@yahoo.com","id":"249408298529007"},{"name":"House for sale in France - Charente,   with 2 guesthouses","description":"Direct with owner !!\n\nThe property is renovated in the style with respect of it's region.  Principale house has kitchen (installed by Smidt) - Salon - Dining room - 3 bedrooms with own bathroom - Atelier of Artist (workplace) - 2 swimmingpools and 2 guesthouses totaly equipped.    The guesthouses have a good occupancy !  The beautifull garden is +\/- 5700m2. and fenced.     Only 400m of the village,   with 2 bakery, butcher, small foodshop, pharmacy, bank, post office, 2 restauants, tennis court.  At 1km there is a holidaypark with lake, some facilities like minigolf, waterski lift, ect.   Also to find in the area canoê, trails and cycling trail, riding school ect. ","id":"1597617067152940"},{"name":"House and Lot for sale Davao City","id":"174158266008571"},{"name":"House for Sale Newburgh $244,000","description":"5477 Lakeside Drive, Newburgh, Indiana 47630. For sale by owner. $244,000. 4 bedrooms. 3.5 bathrooms. Eat-in kitchen, formal dining room, office, 2 car attached garage fireplace. Updates include roof, A\/C, siding, master suite, kitchen...Kitchen includes granite, solid maple cabinets, stainless steel appliances, cork flooring, TV, soft-close drawers and cabinets, pantry closet. Storage shed in backyard. On cul-de-sac that winds around a lake. 3674 square feet. Castle, Castle North, Yankeetown school districts.","id":"727719483930793"},{"name":"Alexis Homes, Edmonton Alberta Houses for Sale, House Buyers & Sellers","id":"112509098768299"},{"name":"Victorian House for Sale","id":"297377273687678"},{"name":"Catalina Estate House~ Presented by HPI Estate Sales","id":"289684097754809"},{"name":"House and Lot For Sale Laguna","id":"133688976831586"},{"name":"Rojales House For Sale","description":"If you would like to know more if to arrange a viewing please send us a message or contact Sol-4 Gestion on +34 96 671 51 81","id":"806850552696176"},{"name":"Wow Dumaguete House and lot,and lot for sale","id":"131718786966603"},{"name":"House and Lot For Sale","description":"LOCATIONS: Tagaytay, Brgy, Canlubang, Calamba, Laguna and Quezon\nFor more information,Please Contact:Jane Dream Ballado\nsmart: 09087558466\nglobe: 09279230208\nsun:    09433536568\nemail: MzD_23@yahoo.com\n          jdlballado@yahoo.com","id":"410707798972330"},{"name":"House and Lot For Sale  in Laguna Cavite and Batangas","description":"House and Lot FOR SALE in Laguna Cavite and Batangas helps you find listings of Property for sale,like Residential Condominiums, House and Lot,Lot only and Commercial Lots FOR SALE, with Rent To Own scheme. Properties that are located near Key locations and accessible from Metro Manila.\nHouse and Lot for sale in Cavite\nHouse and Lot for sale in Laguna\nHouse and Lot for sale in Batangas","id":"718274684899793"},{"name":"Whitsundays House For Sale","description":"107sqm 3 BED HOME ON 2160sqm LAND \n50km FROM AIRLIE BEACH\n\nPROPERTY LOCATION\nGPS - GOOGLE MAPS CO-ORDINATES   \n20°27'08.3\"S 148°24'10.5\"E  \n\nDITTMER,  KELSEY CREEK,  WHITSUNDAYS 4800\nLocated in a tropical rainforest mountain range 50km from Airlie Beach, gateway to the Whitsunday Islands.\n\nThe property backs onto State Forest and seasonal creek.\nSet in the quiet rainforest village of Dittmer with only 25 houses.\nUnique modular home with 107m2 living space surrounded by 2100m2 of land and plunge pool.\nThe home has 3 bedrooms made from newly relined 5.5m x 2.5m modular mobile homes each with aircon and fitted with standard household sliding windows with mesh screens. The bathroom has a bath, shower, sink and a large window. A large living room 9m x 6m includes kitchen and wrap around windows. Two 2.5x4m entrance hallways lead into the living space. Rear entrance leads to concrete plunge pool, rainforest and creek .\n\nThe main living room has a  wooden floor and is lined with pine paneling, to give a spacious cabin atmosphere.The giant windows are designed to open fully, giving a treehouse feel to the whole property. Which is surrounded by rainforest.\n\nThe Land has the following services:\n\nTITLE \t \tFreehold \n\nRATES \t\t$1200 per year  \n\nMAINS POWER \tConnected 240volt 20amps to main building. All rooms have 240volt power. \n\nWATER \t \tConnected 40m bore with 800watt pump, distributed to 2 taps, \t\t\t\t\t\t concrete tank\/plunge pool kitchen sink bathroom tap and shower. \n\nTELEVISION\tConnected Digital free to air\n\nSATELLITE\tAvaliable Foxtel (not connected to house)\n\nMOBILE \t\tAvaliable Telsta mobile will get a signal.\n\nPHONE \t\tAvailable Telstra line is at street front (not connected to house)\n\nINTERNET\tAvaliable Skymesh Satellite Internet is avaliable (not connected to house)\n\nPLOT  \t2100m2 of Land  1\/2 Acre  \n\t\tCleared and levelled to build \n\t\t2 driveways  accessed from 2 \n                 roads \t\t\t\t\n\t\tState Forest Boundary  \n                Fence Boundry  Garden Boundary \n\nEXTRAS  \tConcrete plunge pool\/tank \n\t\tBacks onto State Forest and Creek\n\t\tSchool bus to area \n\nREADY TO MOVE IN\n\nContact for more details if your really serious about it.\n\nAll Offers Considered.\n\n\nPHOTO GALLERY:\n\nhttps:\/\/www.flickr.com\/photos\/128887248@N06\/sets\/72157648581713638 \n","id":"319768001553672"},{"name":"House and Lot for Sale","id":"280219412023055"},{"name":"Edar's Provest House And Lot - Lot only For Sale","description":"House And Lot - Lot Only For Sale-Cebuhouse2014","id":"816081148418810"},{"name":"House for sale in Pretoria East","description":"Three bedroom house for sale in the East of Pretoria, in a security estate (Willow Acres Estate).","id":"800782946656854"},{"name":"House and Lot in Cebu for Sale","description":"Looking for quality house and lot in Cebu?\nWe recommend only the best and most quality residential development by the most trusted developers in Cebu.  Call us and we will be more than happy to assist you in deciding where to put your hard earned money.  You can rest assure that your investment on house and lot for sale will be in good hands.\n\nCall us: www.dcpongase.com\nEmail: info@dcpongase.com\nMobile: +63 922 830 0933","id":"354241191413403"},{"name":"Land , House for Sale , Purchase And Rent In Pakistan Lahore","description":"Plots , Houses and Bungalows Are available for Rent , Sale and Purchse","id":"122006607988205"},{"name":"House and Lot for sale","id":"112718198838295"},{"name":"דירות למכירה נתניה House sales Netanya","description":"  Appartement à Vendre - דירה למכירה בנתניה -Apartment for sale Netanya -\n","id":"264555900413249"},{"name":"House and lot for sale Philippines","description":"Kami ay seller ng mga bahay sa Cavite na abot-kaya ng aming mga customer.","id":"1426770517541565"},{"name":"House for Sale on Kingsfield Court, Yellow Springs","description":"3% TO BUYER AGENTS. Spacious and bright 4 bedroom, 3.5 bath house located on a quiet cul-de-sac 0.6 miles from downtown Yellow Springs. Open floor plan in kitchen and living room which leads to a lovely and private back deck for outdoor dining and access to the fully fenced yard. Wood burning fireplace in living room. Large kitchen island adds storage, prep space and extra seating. Subway tile backsplash. Large pantry. Sunny breakfast room off of kitchen. Owner's suite has tray ceiling and large walk-in closet with window, plus an additional closet. Additional upstairs bedroom has a full en suite bath with tub and walk-in closet and 2nd closet. Finished (dry) basement with gas fireplace, office\/studio space and multiple closets. Fully fenced backyard. Deck on the East side of the house offers a shady place to dine outdoors. Front porch. Large mudroom. 2 car garage. Laundry room. Lots of storage. Approximately 2200 square feet, plus 650 finished SF in basement. REALTOR FRIENDLY.","id":"1638816529671071"},{"name":"Affordable House & Lot  for Sale","description":"\tWe are from Burcer Neri Realty, a full commercial service brokerage which concentrates in all aspects of real estate. This includes residential, commercial, investment, farm, and land and property management. Whether buying, selling, or investing, Burcer Neri Realty is the right company that is capable of meeting all your real estate necessitates.\n\t","id":"126577067383452"},{"name":"House and Lot, Townhouse for Sale","id":"832496546789832"},{"name":"Cavite House for Sale","description":"Cavite house and lot for sales","id":"412786798791170"},{"name":"House and Lot\/Condominium for sale or rent in Cebu or Lapu lapu area","description":"Cebu or Lapu lapu area","id":"462891363743007"},{"name":"House And Lot in minglanilla For sale","id":"277261579080516"},{"name":"Beautiful House for Sale \/ Belle maison à vendre - La Drôme, France","description":"This beautiful and much-loved home has given us a lifetime of enjoyment and memories. It is now time for us to downsize so we have made the difficult decision to sell. More details can be found at www.lucendiois.com or please contact us by phone or email for information.\nCette belle et bien-aimé maison nous a donné une vie de plaisir et de souvenirs. Il est maintenant temps pour nous de réduire de sorte que nous avons pris la décision difficile de vendre . Plus de détails peuvent être trouvés sur www.lucendiois.com ou vous pouvez nous contacter par téléphone ou par e-mail pour plus d'informations.","id":"109565819378842"},{"name":"Cebu House For Sale","id":"413255085396311"},{"name":"House and Lot For Sale Batangas","description":"PinoyHomesTube\nYour Dream House Channel\n   - a real estate portal of residential properties in the Philippines, focusing on House and Lot and Lot only for sale in the areas of Laguna, Cavite, and Batangas.\n\n\nHouse and Lot For Sale Batangas by PinoyHomesTube - Your Dream House Channel\n\nHome of Affordable House and Lot for sale in Santo Tomas Batangas. a place where you can find Affordable House and Lot For Sale in Batangas with a Rent To Own payment scheme.\nRent To Own House and Lot For Sale thru Pagibig financing,and also for Non-PAGIBIG individual.\n\nHouse and Lot For Sale in Santo Tomas Batangas\nHouse For Sale Batangas\nRent To Own House Santo Tomas Batangas\nAffordable House and Lot Rent To Own thru PAGIBIG\n\nWhy live in Santo Tomas Batangas?\n\nSto. Tomas, a first-class municipality, is one of the oldest town of Batangas, is located at the foot of the legendary and picturesque Mt. Makiling. It is sixty (60) kilometers south of Manila and known as the birthplace of Gen. Miguel Malvar, the last Filipino General to surrender to the Americans.\n\nBoundaries\n\nThe municipality of Sto. Tomas is situated on the north-eastern portion of the province of Batangas and along the Batangas-Laguna boundary. It is bounded by the municipalities of Malvar, Batangas; Los Banos, Bay and Alaminos, Laguna; and by cities of Tanauan and Lipa, Batangas; and Calamba, Laguna.\n\nBarangays\n\nThe municipality is composed of thirty (30) barangays, these are: Poblacion I, Poblacion II, Poblacion III, Poblacion IV, San Agustin, San Antonio, San Bartolome, San Felix, San Fernando, San Francisco, San isidro Norte, San Isidro Sur, San Joaquin, San Jose, San Juan, San Luis, San Miguel, San Pablo, San Pedro, San Rafael, San Roque, Santiago, San Vicente, Sta. Ana, Sta. Anastacia, Sta. Clara, Sta. Cruz, Sta. Elena, Sta. Maria and Sta. Teresita.\n\nEconomy\n\nPublic market\nThe First Philippine Industrial Park which is owned by the Lopez Group of Companies is located in the municipality.[4]\n\nMost of the town is residential with a lot of farmland. But there are also some developed subdivisions along the town like the San Antonio Heights in Barangay San Antonio which was developed by Avida Land, A division of Ayala Land,[5] Portello subdivision which was developed by Camella Homes.[6] and Terrazza de Sto. Tomas in Barangay San Roque which was developed by Ovialand. The town is also well known for an entire strip of bulalo (bone marrow soup) restaurants. Among the best known include Rose and Grace Restaurant. The town is also home to a state of the art hospital named St. Cabrini Medical Center which is located inside the town center.\n\nTransportation\nThe town connects with the neighboring cities of Calamba City, Laguna and Alaminos, Laguna via the Maharlika Highway. The Southern Tagalog Arterial Road starts at the municipality from the north side of the expressway. The expressway connects the town with the rest of Batangas. Now, the expressway is connected with the South Luzon Expressway. The José P. Laurel Highway is route that connects the town with Tanauan City, Malvar, and Lipa City all the way to Batangas City via San Jose town.\n\nJeepney\nCalamba - Tanauan\nSan Pablo City - Tanauan via Alaminos\nBuses[edit]\nCubao - Lucena\nAlabang\nBicol\nUV Express[edit]\nSan Pablo City - Balibago Sta. Rosa\nSan Pablo City - Lipa City","id":"438785832949843"},{"name":"Upstate NY House for Sale","description":"Whether you're looking to leave the city life, want a weekend or summer home, this place is for you.  Only 3 hours from NYC, 30 miles to Ithaca and wine country, and 15 miles to Binghamton, this house has all the upgrades you would want.  4 bedrooms, 2 full baths, new tankless water heater, state-of-the-art Rinnai wall boiler, sauna, hot tub, Koi pond, huge deck newly painted for entertaining plus additional decks off kitchen and balcony off upstairs bedroom.  Circular driveway has recently been seal coated. New wood stove for long winter evenings lends ambiance with propane back-up heat.  Commercial Imperial stove in gourmet kitchen has 2 fullsize ovens, 6 burners, flat-top grill and salamander\/broiler.  Kitchen has granite countertops, plenty of cupboards, island with sink and an entire wall of garages and additional cupboards to store your kitchen gadgets.  Newly painted, new carpet in 4th bedroom and the rest is hardwood and tile with a gorgeous marble floor on the main level.  Whole house generator regularly maintained for power outages.  Professional landscaping done 2014 with timber and stone steps to the back yard.  All on 2 acres with 1 acre wooded. ","id":"689154944486135"},{"name":"House For Sale In Cambodia","id":"487182371445615"},{"name":"House and Lot for Sale - Kathleen Place , Cubao Quezon City","id":"221809381224514"},{"name":"Pinoy House 4 Sale","id":"1397025613882205"},{"name":"House and Lot for Sale in Antipolo, City - summerfield Residences","description":"AFFORDABLE HOUSE AND LOT FOR SALE IN ANTIPOLO, CITY\n\nLOCATION : \n\nAngela Model (Single Attached)\nComing price for 3.3M\nLot Area 83sqm\nFlr Area 90sqm\n3 BR \/ 2 T&B \n1 carport\n\nTownhouses\nPrice Range of 2.4M\nlot area: 55sqm\nFloor Area: 85 sqm\n3 BR \/ 2 T&B \n1 Carport\n1 maid's room\n\nSingle Detached\nAlexandra model for a coming price of 4.2M\n3 BR \/ 3T&B \n1 carport\n1 Maids room\n\nOTHER AVAILABLE LOCATION:\n\nSUMMERFIELD ANTIPOLO\nhis development is in a floodfree area along M Santos Ext, just five to ten mins. from Antipolo Cathedral which is accessible, whichever you choose via Sumulong Highway or Ortigas Extension. Within a 1km span, Summerfield Antipolo is the third project currently being developed.\n\nSUMMERFIELD RESIDENCES PASIG\na quality townhouse project in Maybunga, Pasig City.\n\nSUMMERFIELD VILLAS TAYTAY\nWith affordable rates and flexible financing terms, the good life is within reach... and within your budget.\n\nBERKELY RESIDENCES PAMPANGA\nBerkeley Residences Pampanga is located in the Greater San Fernando Pampanga. It is 5 minutes away from the region of Pampanga s best retail and commercial centers such as SM San Fernando, Robinson's Starmill's, Wilcon Builders Depot, and East Gate Center.\n\nFOR VIEWING AND RESERVATION PLS. CALL:\nELY JUMAWAN\n0929-8908201\n0915-8559372\nemail: house.condo_lot@yahoo.com\n","id":"446952788811287"},{"name":"Lowcost House and Lot for Sale in Cebu","id":"571815349505122"},{"name":"Brook House Farm. Horses For Sale","description":"We are a small, friendly BHS approved Riding school and Livery yard in the heart of the Lincolnshire Wolds. \n\nWe opened in 1998 with a couple of welsh section A ponies and a rather grumpy TBX.\n\nIn the early years we bred ponies using our Dutch Warm blood pony stallion, Dutch Puzzle who is still on the go now, all be it happily in retirement from show jumping but does still cover the odd mare every now and again.\n\nOver the years we slowly built up our breeding programme purchasing a young stallion called Temple Romeo, we bred several horses from him using our small collection of quality brood mares. Romeos offspring have all proved to be excellent riding horses, straight forward and uncomplicated. Romeo has now been gelded but is now owned by our yard manager who regularly competes him in all disciplines. Romeo was followed by Valentino another warm blood stallion who we leased for a couple of years and who was very successful competing in Dressage representing Britain in the home nations championships. We have several young stock by Valentino for sale at the moment  ranging from 2 - 5 years old.\n\nIn 2012 we bought Clonleigh Dancer a class one ID stallion who is available for stud this year. We currently have yearlings available for sale by Dancer and will be expecting 4 more foals by him this spring.\n\nAs well as breeding our own we regularly source horses, ponies and cobs from Ireland, we primarily purchase these to be used in our riding school, but these are also available to buy and are taken out to shows, ponyclub , riding club and hunting to continue their education and ensure they are versatile, experienced all rounders. \n\nAll our horses advertised for sale are open to vet and any other professional. We have excellent trial facilities including an indoor school, show jumps, cross country jumps and lovely hacking. \n\nWe don't believe in pressuring people to buy and encourage multiple viewings before people commit to buying, however we do not do loans, or loans with view to buy or allow our horses out on trial. Potential buyers are welcome to view several times and are encouraged to spend as much time as the want with the horse they are viewing.\n\nPlease feel free to contact us for more information. \n\n ","id":"1561077147481325"},{"name":"House for Sale in Brittany","id":"845544625477185"},{"name":"Penang House For Sale and Rent","description":"--Welcome to my properties listing--\n\nWe specialise in buying, selling, and renting of properties. \n\nYou may post about your houses and commercial properties wanted to sale or rent. \n\nWe will find buyer or tenant as fast as possible for you.\n\nContact or whatapps me if possible\nSteven : 0164220509\n\nThank you!\n","id":"284799748365198"},{"name":"Residencia Manila - Philippine House and Lot for Sale","description":"RESIDENCIA MANILA brings you the best real estate properties located in different prime areas of Manila, Makati and Quezon City, as well as house & lot properties in the fast developing areas of Molino, Imus, Bacoor & Kawit, Cavite. We offer you lush houses, superb yet affordable house & lot properties, as well as rent to own houses all offered in very flexible and easy financing schemes.\n\nWHAT WE OFFER:\n\nPHILIPPINE HOUSE AND LOT FOR SALE - Residencia Manila brings you the best real estate properties located in different prime locations in Las Pinas, Paranaque, Quezon City, as well as Philippine house and lot properties in the fast developing cities of Imus, Bacoor & Dasmarinas, Cavite.\n\nCONDOMINIUM FOR SALE - With people living busier lives, buying condos are an attractive choice due to its location and within walking distance to shops, malls, restaurants, etc. Residencia Manila  offers condominium for sale in Pasay, Paranaque, Mandaluyong and Manila.\n\nLUXURIOUS GATED COMMUNITIES - Residencia Manila offers you posh properties in luxurious gated communities in Alabang, Tagaytay and Sta. Rosa Laguna. We give you elegant Philippine house and lot for sale, all offered in very flexible and easy financing schemes.\n\nWe have the key to your dream home, house & lot, property or business investment in Metro Manila & Cavite. We make home buying a simple and worry-free experience for our clients. Relax and let our expert knowledge and extensive local network help you find the perfect place.\n\n\nFor property inquiries, sample computation or to schedule site viewing, please contact: \n\nLESLIE LAZARTE\nProfessional Real Estate Broker \nREB License No. 0013570 \n\nContact numbers:\n+63 917 512 5475 (Globe \/ Viber)\n+63 922 872 9302 (Sun \/ Viber)\n\nYahoo Messenger: residencia_manila\nEmail: residencia_manila@yahoo.com\nWebsite: www.residenciamanila.com \n\nADD US IN FACEBOOK!\nhttps:\/\/www.facebook.com\/ResidenciaManilaPH\n\nWant more? Visit our official website for more house options:\nhttp:\/\/www.residenciamanila.com\n\n_","id":"226623140688559"},{"name":"Dalhart House for Sale","description":"House for Sale by Owner\n1222 Conlen Avenue   Dalhart, TX  79022\n\nTom Jessop 806 333 2451\n \n","id":"1880391158852239"},{"name":"Consolacion House For Sale","id":"312510155524032"},{"name":"House for sale","id":"912334795493937"},{"name":"Jennifer Webb,  Sales Representative Century 21 House Ltd Brokerage","id":"1563979467178243"},{"name":"Baguio House and Lot For Sale","id":"539139986169049"},{"name":"House for Sale - by Owner - Southern Indiana","description":"For Sale by Owner\n502.741.5524\nstacytuell23@gmail.com\n$449,000 Motivated seller. Make offer!\n\nMarysville, IN 47141\nSouthern Indiana (Clark County)\n*Just 20 minutes from Louisville!*\n\nMust see! OUTDOOR PARADISE! \n\nSwim, fish & play, or just relax and soak in the beautiful sunsets from the large partially covered back deck overlooking the in-ground pool and pond surrounded by farm land! 7.88 with 2 ponds, partially wooded acres, with option to purchase additional acreage. Meander down the long driveway past the lovely pond this home overlooks. The beautiful 1.5 story custom brick home is 3500 sq. ft. Step through the gorgeous 2 story vaulted entry. The open great room features soaring 24’ ceilings and a breathtaking creek stone fireplace. The floor-to-ceiling windows overlook the sprawling landscape. Master bedroom suite on the main level w\/ 3 other spacious bedrooms upstairs. Main level also includes a beautiful office w\/ custom crown moulding and french doors, guest 1\/2 bath and a great laundry room w\/ sink & cabinets.  Fantastic open eat-in kitchen w\/ island and bar with plenty of windows to soak up the views of the backyard and pond. 2nd floor features 3 bedrooms with big walk in closets, a spacious bathroom, and a finished bonus room\/family room! 2 upstairs bedrooms have vanity\/dressing flex space as well. Unfinished basement with bathroom rough in. Huge 2.5 car garage. Plenty of storage space!  \n\nThis property also features a 100’x60x building, full concrete floor, huge working area, 3 sets of sliding overside doors and living quarters with a family room, kitchen bath and one bedroom  Perfect for an in-law suite, guests or an office. Income property!\n\nPlus! a 62’x48’ barn w\/ metal roof and dirt floor and plenty several sliding doors.\n\n\n\nemail stacytuell23@gmail.com Make offer! Don’t miss this opportunity. \n\n\n\n7.88 acres & 2 ponds w\/option to purchase additional acreage\n1.5 Story Custom Brick Home 3500 square feet\nBeautiful entry \n4 large Bedrooms with master bedroom on the main level\n2.5 baths\n2 Story large, open Great Room with soaring 23' ceilings \n2 story creek stone fireplace\nLarge Eat-in Kitchen with island & bar\nOffice with decorative crown moulding & french doors\nSpacious first floor laundry room w\/ sink\nLarge finished Bonus Room on second floor\nUnfinished basement with bathroom rough-in\n2.5 car garage\nNew roof 2009\n1,000 underground propane tank\nIn-Ground Pool (new liner 7.2013)\nPartial covered back deck with fan & lights\n100x60 Building with concrete floor, working area, 3 sets of sliding overside doors and living quarters\n62x48 Metal covered barn with dirt floor\n\nemail stacytuell23@gmail.com Make offer! Don’t miss this opportunity.","id":"1512475128986819"},{"name":"House for sale","id":"1454902448085241"},{"name":"Siem Reap Land\/House For Sale&Rent ដីនិងផ្ទះសំរាប់លក់នៅក្រុងសៀមរាប","id":"1564156980491032"},{"name":"Tulsa House for Sale","id":"604082406308924"},{"name":"Ashiyana Tagaytay Classics - Tagaytay House and Lot for Sale","description":"Call 09179151199 for more details","id":"150819898290222"},{"name":"Byron Bay House For Sale","description":"KOREELAH BYRON BAY   $4.5 million\nThis amazing property is less than 4 minutes drive from Byron town centre offers majestic views to the north over the surrounding countryside. Sitting on 10 acres, the land is very gently sloping and features an array of fruit trees, hoop pines and various established natives. \nThe home was designed by Alexander Jolly and built in 1905 and has only had two owners since. Whilst its original character has been maintained, it has been  renovated to allow for all of the necessary modern day conveniences. \nA large stone fireplace is the central feature of a spacious open plan living area that overlooks the entertaining decks, the pizza oven and the pool. The kitchen is an entertainer’s delight with stainless steel benchtops, ample storage & a large oven. The property is private yet close to all Byron has to offer.\n\n\nOriginal 1905 Byron Bay farmhouse \nOnly 2 owners to-date \n5 bedrooms\nSought after central Byron Bay location \nPrivacy, seclusion & country views \n16 metre saltwater pool , six car garage.\nLarge indoor & outdoor entertaining \nPizza Oven ,SPA\n4 MINUTES DRIVE FROM BYRON CENTRE\nExisting income \nPlanning approval for 2 level studio\n\nJames Dawson 0414 495 226\nwww.koreelahbyronbay.com.au\n","id":"1680746485487148"},{"name":"House and Lot, Condo For Sale","id":"391588747570145"},{"name":"Cagayan de Oro House For SALE and For RENT","description":"looking house and lot for SALE?\n\nvisit my main page: \n\nhttps:\/\/www.facebook.com\/BeautifulHouseCDO","id":"1530682107187377"},{"name":"Cagayan de Oro House and Lot for SALE","id":"241255539232191"},{"name":"EAO Salesian Brothers Formation House","description":"The EAO Salesian Brother Formation Community is the regional formation center for Salesian Brothers in the East Asia and Oceania Region. It offers Salesian Brothers a two-year theological and pastoral formation in order to help them effective educators and evangelizers in the spirit of St. John Bosco. ","id":"501184479912544"},{"name":"House and Lot for sale in San Fernando Pampanga","id":"142238842636278"},{"name":"HouseFor Sale","id":"1452334645057213"},{"name":"Mandaue House and Lot For Sale Cebu","description":"Mandaue real estate property is the closest to Cebu City, where you may find the right home for your family and love one. House and lot projects in this area are still cheaper and affordable particularly Northfield Subdivision with various house model designs to really fit your preferences upon buying property. For more details follow this link: http:\/\/www.cebuhousing.net\/Northfield_Mandaue_House_and_Lot.html","id":"297457646957372"},{"name":"House and Lot 4 sale,low cost and very affordable located in Laguna","description":"Vision:\nTo be one of the most admired housing developers in the country, recognized and respected for the excellence of its products and services, the state of its technology, the profitability of its operation, the sensitivity and suitability of its response to customers, employees, business partners and the community as a whole.\n\nIn line with its vision and mission, the Company, for the last 12 years, had continously contributed to the housing needs of every Filipino, and had provided every buyer a decent home.\n\nMoving forward, the Company is committed to explore more and better opportunities to sustain its operations, in order to develop more strategic property sites not only in Laguna but also in other areas that are proximate to the working places of the buyers. Complementary to this, the Company is also committed to design more functional houses and to formulate better pricing packages, to meet the housing needs of the public, at affordable prices and payment schemes.\n\nThe Company had also developed friendly relationships with various banks and other financial institutions which had been very instrumental in providing the Company much needed funds to sustain its operations and to maintain manageable cash flows. With this, the Company was able to forge better financing facilities. It had likewise made available to buyers more funding mechanisms at better interest rates and easy payment plans.\n\nThe Company does not only explore better opportunities for the benefit of its buyers, but its outlook is likewise gleaned towards creating a more professionalized corporate environment for its people. The Management had always been concerned on the professional development and welfare of its employees, including its sales force. Hence, recently, it has expanded its office space to provide a more conductive work place, a more comfortable receiving area for the buyers and sales personnel, and a bigger conference room for trainings, workshops and meetings.\n\nNow on its 13th year in the industry, P. A. Alvarez Properties and Development Corporation, moves to the future with full confidence with its philosophy of commitment and excellence, and its solid track record as a real property developer.\n\n\nMission:\n\n-To contribute in the promotion of the government national shelter program.\n\n-To build and create Filipino communities where living is comfortable, safe and joyful.\n\n-To develop and maintain an efficient and friendly organization which shall provide\nexcellent service and care to its valued clients.\n\n\nfor housing assistance please contact the following numbers:\nSmart : 09478452265\nSun : 09231207932\n","id":"190971960945241"},{"name":"House for Rent \/ Sale in Angeles City Pampanga","id":"1579339048978928"},{"name":"Cadar House Sale Murah","id":"442226982620421"},{"name":"House For Sale Lipa City, Batangas","description":"This is a house & lot for sale Located in Barangay Banay Banay, Lipa City, Batangas.  Estimated Construction Completion Time is Early 2015.  \n\nIt sits on a cozy 72sqm lot.  It has 84sqm floor area.  \n\n2 Bedrooms\n2 Full Bathrooms\n1 Car Garage","id":"635476769894146"},{"name":"Davao House and Lot for Sale","description":"Good day everyone :) my Name is Erwin R. Javier I'm a Freelance Property Consultant here in Davao City,Philippines..,please check my Property Listings for your guide.. :) and also I'm a licensed Financial Adviser in Axa Philippines.. \nI'm happy to serve you and answer your inquiries,and assist you to find your dream house here in Davao City..\nThank you and God bless :) \n\nFor site viewing, inquiries and reservations please feel free to contact\nErwin Javier : \n09061610406 (viber) TM \n09308373877(SMART)\n\nplease visit our website\nhttp:\/\/www.erwinjavierdavaoproperties.tk\/\n\nFb account : https:\/\/www.facebook.com\/erwinrola","id":"447582542014812"},{"name":"Dumaguete House and Lot , Lot  For Sale\"","id":"141425179345862"},{"name":"Dumaguete House And Lot For Sale","id":"415990515139420"},{"name":"House and Lot for sale sa Antipolo atbp. feat Queenstown Heights","description":"House and Lot for sale by duraville realty and development Corporation, The best place that they are currently selling is the \"Queenstown Heights 1 and 2\" Located in Antipolo City,... and Antipolo City is the best place for living, kasi malapit ang antipolo sa business areas, just one ride away sa mga terminal of jeeps and taxis. And Duraville are offering their houses with a 10% Downpayment (DP) then your ready to move in, and there are some houses that are Ready for Occupancy (ROF). And I suggest Queenstown Heights, like Britanny 1 and 2 at antipolo it was easily sold. ","id":"178486398840000"},{"name":"Bye,sales & exchange recondition house","id":"907426235955035"},{"name":"House and Lot for Sale\/condo at Paco Manila","id":"457254654391196"},{"name":"HOUSE Property Sale Rent : Kuala Lumpur ,Selangor","description":"PROPERTY WANTED!!!\nWe are looking for property for sale or for rent in the area of Kuala Lumpur, Selangor.\nType of properties wanted: Apartment, Condominium, and Landed: Terrace house, super-link house, semi-detached, cluster semi-detached, & bungalow, commercial buildings: shop-lots, office-lots, etc, lands: agricultural land, bungalow lots, commercial land, etc.\nOwners\/buyers\/landlords are welcome to deal with Professional Agent looking for property for sale or for rent in the area of Kuala Lumpur, Selangor.\nReady buyer’s available good networking, fast SALE.\n\nTerm & Condition: 3% service charge \n\nKindly contact Kvani Anbalagan at +6012 354 7714 (call\/sms\/whatsapp\/viber) or email at vanansh@yahoo.com\n\nLoan & lawyer can be arranged!\n\nThanks & Have a Great Life!\n","id":"280675108772186"},{"name":"House for Rent in Sedona, Arizona","description":"Available Now!","id":"114844231894174"},{"name":"House and Lot for sale","id":"767129463336821"},{"name":"House for Sale in Cape Town","description":"CPS Properties started this agency in 2013, but he was no stranger to real estate, having already accumulated more than a decade in the industry. The first head office was located in Cape Town. As the company continued to expand, CPS Properties moved his head office to 17th floor, The Pinnacle Building c\/o Strand, Burg& Castle Street in Cape Town, the heart of the Cape Town, from where the estate agency is perfectly placed to keep a finger on the pulse of property in these sought after areas. Today the staff include highly trained agents and administration staff.","id":"1600382943526461"},{"name":"House and Lot for Sale in Cebu","description":"http:\/\/www.facebook.com\/nenetterediano ----ADMIN FB\n\nFor more Information and for site viewing schedule contact: \n 09219568165\/09239797415","id":"342636862427406"},{"name":"House 4 Sale Henley on Klip","description":"Very secure, 5 bedroom home 4 sale-Henley on Klip.We are relocating & hope to sell our house asap. Quote this add to the agent and I will pay the trf duty up to R50k (or more neg). The selling price of the house is a tad negotiable - unfortunately not too much as we are selling the house at the price it cost us to build.","id":"574598619348588"},{"name":"House For Sale, Buy, Rent And Property Investment In Klang Valley","id":"279294362273853"},{"name":"House for sale in Saraland","id":"1545245819057341"},{"name":"House and Lot for Sale","description":"Welcome home to Lancaster Estates. With more than 1000 hectares covering Imus, Kawit, and Gen Trias, LNC is primed to become Cavite's first full-fledged \"New Town\" development. Being just 15 minutes away via Cavitex, LNC is set to become the most accessible development of its kind from Manila.","id":"732459130125658"},{"name":"House and Lot For Sale","id":"284968198358451"},{"name":"House Clearance  Items for Sale -Welshpool","description":" We are based just 3 miles from the town of Welshpool (Powys).. and will  send you an address\/ telephone number privately, should you be interested in any item. \nWe are not traders, we are just emptying the contents of our house in Castle Caereinion and are selling a lot  of pre-loved house, garage and garden items.  All are working or in good condition. We are trying our best to avoid hiring a skip  and landfills!!  and happy to say we are succeeding ....  Lots of items have already been donated to charity and given away to family and friends. It's an emotional journey, but we hope  all of the items are going to good homes to be cherished, used, recycled or upcycled. \n\n\nPN. All items are sold as seen. We urge you to have any electrical\/ petrol  operated items checked\/ serviced for safety reasons, as these are house clearance items.","id":"326758297527339"},{"name":"House and Lot for Sale In Camella South","description":"CERRITOS TERRACES in Daang Hari Updated about 5 months ago,\nTaken at Daang Hari CERRITOS TERRACES via Daanghari Road is only 8 to 10 minutes from Alabang Town Center,Festival Mall,Starmall,\nAsian Hospital,San Beda   College Alabang.\nFollowing the success of 4 Cerritos projects namely: Cerritos 1, Cerritos Trails, Cerritos Heights, and Cerritos Hills, Camella introduces another impressive five hectare exclusive neighborhood,CERRITOS TERRACES...........Soon the completion of the daanghari exit via SLEX will make CERRITOS TERRACES very accessible to makati, ortigas, and other locations,like laguna and batangas.Furthermore CERITOS TERRACES is with in EVIA responds to:\n\n1)EDUCATION through the university town \n2)RECREATION via the riverwalk, the lifestyle center, and the parks 3)CELEBRATION in a unique and exquisite setting:The fernbrook Gardens \n4)OFFICE BUILDINGS will be dedicated to BPO's and semilar entities. \n\nCERRITOS TERRACES will be home to meticulously-built houses. Single attached homes with floor areas ranging from 53 square meters to 81square meters and lot areas from 88sqm to 120 sqm.\n\nAlso, there would be a choice of 2 and 3 bedroom houses.\n\nCERRITOS tERRACES boasts of its amenities - a Clubhouse, Basketball court, and Parks and playground where families can bond and treasure memories together. Security and safety of residents are given utmost consideration. An entrance gate and perimeter fence will be constucted with 24-hour security. A shuttle service is provided to the residents from the subdivision to major destinations.\n\nFOR MORE INFORMATION, PLEASE CONTACT:\n\nDONDON L.DUARTE JR\nBRANCH MANAGER\n\nSMART (+63)919-8243067\nSUN     (+63)932-8438534","id":"592469537460640"},{"name":"Garage Sale Open House","description":"Aquilo que não te interessa mais, pode servir para outra pessoa. Precisa desocupar sua casa, abrir espaço para uma nova DECORAÇÃO? De um UP Geral? Descubra como obter dinheiro, para dar uma renovada na sua Casa. Única Empresa Especializada no Mercado de Garage Sale em Brasília, há nove anos.  Pode conferir! Qualidade em serviço diferenciado, para clientes exigentes. Confiança, credibilidade e organização. Atendimento exclusivo. Contamos com equipe especializada, atuante no mercado brasiliense, com excelentes resultados. Contato: ANA ROSA ","id":"228600703913223"},{"name":"Ponton House 4 Sale","description":"This spacious 4 bedroom home is located in the Kibrahachastraat in\nPonton. The house is surrounded by upscale homes and this area is known for its privacy. The total constructed area is appr. 360 m2 on 1.223 m2 of property land. The property comes with alarm, hot water facility, 100 % fencing, 2-car garage, landscaped garden, separate maid's room, large covered patio, pool, and much more.\n \nLAYOUT: Common area: entrance, foyer, powder room, living room, dining room, family room, kitchen, maids room with bathroom, laundry, and covered front. Rooms: master bedroom with large studio\/bedroom, master bathroom 2 walking closets and 1 extra closet, 2 bedrooms with their own bathroom and walk in closet.","id":"908445779181821"},{"name":"House Plot - Land for Sale - Palakkad Dist","description":"Best for Residential houses & Flats. (30 Cents + 10 Cents)\nat Societypady, Sreekrishnapuram, Palakkad.\n\nBest House Plots in Sreekrishnapuram, Society pady @ 2.5 Lakhs per Cent, Video available\n\nReady for immediate sale to small buyers say 5 Cents, 10 Cents, 20 Cents etc.\n\nExpected rate is 2.5 Lakhs per Cent. (Negotiable)\n\nPlease note that video of the plot will be sent to interested parties via email upon request.","id":"305493032976712"},{"name":"Full House Moms Consignment Sale","id":"258645796917"},{"name":"House For Sale in Lapu Lapu City","id":"455986151128038"},{"name":"House for Sale\/Rental - Johor","id":"1472615986338800"},{"name":"Cavite House for sale","id":"457718830994600"},{"name":"House For sale","id":"1622819607955267"},{"name":"House for sale near naia airport,makati and moa","id":"443075692525970"},{"name":"House and Lot For Sale in Bulacan and Pampanga","description":"for free tripping, inquiry and reservation feel free to contact US;\n\nTo our international clients (Free Call & Text VIBER)\n(+63)922-454-1618\n(+63)933-239-4782\n\nGlobe:0906-678-6360 \nSun:0922-4541618\nTm; 0905-823-6129\n","id":"192581670908978"},{"name":"Davao House & Lot For Sale","description":"You can find different kind of houses for sale in this page located in areas which is very suitable for living and just minutes away from the heart of the city. Subdivisions and villages in this page are mostly exclusive and very affordable in both cash and term payments. Houses featured in this page are all ready made and very good in quality. For more questions and details you can message me directly through text message or facebook message.","id":"321857944662102"},{"name":"House and Lot, Condo Unit for Sale","id":"357776507703325"},{"name":"HOUSE AND LOT FOR SALE","id":"1557715711163425"},{"name":"House and Lot for Sale Cavite","id":"483408858447846"},{"name":"Sale in the house","id":"339423869562224"},{"name":"House & Lot for Sale l Rent.ph","description":"Please make your choice. thank you. https:\/\/www.facebook.com\/alltownhouses","id":"113151442047257"},{"name":"Our House is for Sale","id":"111686915834837"},{"name":"House for sale - Iloilo Blue Dragon Division","id":"208422109331250"},{"name":"HOUSE and Lots-For SALE","description":"FLORIDA SUN - ESTATES\n* CONDO LOFTS Types\n* HORIZONTAL CONDO'S\n---\nFEDERAL LAND\nPowered by;\nAXA\nMETROBANK\nTOYOTA\nGT\nCONDOMINIUM's @\nGeneral Trias Cavite\nMakati\nMarikina\nBinondo\nMacapagal\nCebu\n( themes ng condo's, city of new york P\n-------\n\nVISTA LAND COMPANY\nCamella Homes @\nGeneral trias\nBacoor City\nSilang\nDasma\nTagaytay\n\n","id":"1452692835028412"},{"name":"Toni House Baton Rouge Homes For Sale","description":"Toni works first and foremost with honest and integrity to help her clients' dreams and goals come true.\n\nREALTOR® with experience in the Baton Rouge, Prairieville, and Gonzales Real Estate Market, and specializes in LSU Condos and the Garden District of Baton Rouge.\n\nToni's Designations: ABR, GRI, SRES, Green Realtor Designation awarded by The National Association of Realtors, Green Builders Designation awarded by Capital Region Builders Assocation, and National Home Builders Green Designation.\n\nToni House is a licensed Realtor in the State of Louisiana\n\nBrokerage Information:\nRe\/Max Professional\n8556 Jefferson Hwy, Suite A\nBaton Rouge, LA  70809\n(225) 615-7755","id":"180621435307797"},{"name":"House and Lot for Sale","id":"160959807391830"},{"name":"House , Lot, Condominum for Sale","id":"869567383104642"},{"name":"House for rent\/land for sale samui","description":"House for rent\/land for sale samui","id":"712607225520788"},{"name":"House and Lot for Sale - Calabarzon","description":"House and Lot For Sale in Laguna, Batangas & Cavite\nCondo Unit in Tagaytay and Sta Rosa\nLot for Sale in Tagaytay","id":"280703998781622"},{"name":"House and Lot For Sale by Noypihomes","description":"House and lot for Sale by noypiHomes is a collection of house and lot for sale in Laguna, house and lot for sale in Cavite and house and lot for sale in Batangas by different developers to which noypiHomes company CLHE Corp is duly accredited. You can reach us at 09224266717 \/ 09173783552 (VIBER) for details or tripping schedule and look for noypiHomes himself Mr. Virgilio S. Millona a licensed broker with PRC license # 15454.","id":"890525124339427"},{"name":"Southern Manor House for Sale","description":"Welcome to Southern Manor, where the Homeowners have an Abundance of Stores and Restaurants to choose from in an Environment that offers \"Turnkey'' Living with a Carefree LIfestyle.  This Beautiful Town Home Development can be found in the Mehlville School District.  Located Less than 5 minutes from the South County Shopping Center with Quick Access to I-270 and I-55, this is a Community of Attached Villas. Enjoy Town Home Lifestyle; knowing Year-Round All Outside Yard Work is handled by the Association, leaving more time for Hobbies, Entertainment, Travel and other Personal Interests.  Featuring Minimal Monthly Fees for Outside Upkeep, Southern Manor is the Best Value in the Area.  This Peaceful and Serene Community is comprised of a collection of Home Styles ranging from Ranch to 1.5 Story to 2 Story Homes.  Each Villa has Attached, Front Entry Two-Car Garages, First-Floor Laundry, Vaulted Ceilings, Full and Spacious Basements\/Lower Level Living Areas and Much, Much More.  Come Visit Us Today! ","id":"1409807172657679"},{"name":"House and lot for sale at affordable price","description":"House and lot for at affordable prize","id":"371315372949760"},{"name":"Cebu House and Lot\/ Cebu Condominium for sale","description":"I can offer the best options for your investments in Cebu or Mactan and other real estate investment destinations in the Philippines.\n\nI will assist and help you locate your ideal property. Not only do I have a tremendous amount of industry experience, but I also have a firm grasp on the opportunities currently presented within this growing real estate market.\n\nI will walk you through the entire buying process, taking time to carefully listen to your real estate wish list. I will present you with options, working in a proactive manner, to enable you to find the property that exactly matches your list of criteria.\n\nNow is the time to buy! Real estate prices will not stay suppressed over the long term. Don’t let this opportunity pass you by!\n\nTalk to you soon!\n\nDaisy C. Antiporta\n\nhttp:\/\/www.pagibigfund.gov.ph\/phmp\/calc.aspx","id":"515227265190992"},{"name":"House for sale in Bacolod City","id":"214025815402191"},{"name":"Vintage Attic Estate Sales & Auction House","description":"Randy Mann MS Auctioneer License #1343. We are an estate sale company and auction house. Looking for quality consignments. Antiques, furniture, vintage jewelry, and much more.\n\nRandy & Judy Mann, owners 228-539-4500","id":"133367356809243"},{"name":"House and lot for Sale in Batangas","id":"330584003791281"},{"name":"House plots for sale in bahria town","description":"We are a bahria town authorized property adviser and builders (alhamdulillah)  ,\nProviding you constructions and real estate investment services . we are specialist in bahria town Karachi sale purchase. We also deal bahria town Islamabad\/Rawalpindi, so please contact to sale or purchase a plot or house in bahria town phase 1 to 9, bahria enclave and golf city . Feel free to contact for free assistance.\n\n","id":"1565986946956516"},{"name":"Affordable Condo and House and Lot for Sale in Iloilo City","description":"Good Day. I am Mr. Mark Tristan C. Golena\nTeam Leader, Avida Sales Corp.. \nHere are some information before you proceed to check or study the Pages.\n\nAffordable living at its best... \nAvida Land was carried out of Ayala Land's desire to bring affordable living at its best to the greatest number of Filipinos. Each Avida development is constructed upon five pillars that guaratntee sure and safe living, namely Accesibility, Unique Features and Amenitis, Quality Assurance, Stress-Free Buying Experience, and Relaxing Living Experience. As the lifelong partner of the hardworking Filipinos for two decades now, Avida is dedicated to providing \"dream\" shelters where families can make beautiful memories together for many years to come. Now, you can also experience affordable living at its best and say \"Dito na tayo forever\" as Avida further expands its presence in he Visayas with Avida Towers Iloilo. Visit http:\/\/www.avidabest.com\/.\n\nI am please to give me time to present to you our Project and Assist you to see our good and beautiful model units include Standard and fully furnished units in our Sales Pavillion and Avida Village Iloilo.\n\nGod Bless and More Power\n\nIm Happy to Serve you…. \n\nFor reservation and inquiries, just text or call\nContact: Mark Tristan C. Golena\nProperty Specialist - Team Leader \nAvida Sales Corp. Iloilo\n09173050601 or 09302647626\nEmail add: marktris_23@yahoo.com","id":"704084549621513"},{"name":"House for Sale","id":"249787248504081"},{"name":"House for sale n rent,kulim","description":"Kami menyediakan perkhidmatan menjual rumah dan hartanah untuk kawasan kulim,padang serai,desa aman. Rumah baru dan second hand tersedia mengikut bajet anda. Kami juga menyediakan perkhidmatan mencari penyewa untuk rumah anda. Sila datang ke ofis jualan kami atau hanya pm kami melalui facebook. Tinggalkan contact no dan kamimyang akan menghubungi anda.","id":"355060887965401"},{"name":"House for Sale in Co. Clare","id":"504811009556456"},{"name":"House & Lot For Sale - at Very Affordable Price","id":"620197721429744"},{"name":"House and Lot for Sale in Cavite","id":"108925226116943"},{"name":"Belmont House For Sale","description":"Property Overview:\nFor Sale by Private Treaty\n\nOverall Floor Area: 255 Sq. Metres (2,745 Sq. Feet)\n\nProperty Description:\n\"Stylish, Spacious, Secluded\"\n\n\"Your Dream Home\"\n\nc. 255 sq. mt. (2800 sq. ft.) Residence \n\n\"A Must To See\"\n\nWe offer a unique opportunity to acquire this magnificently presented secluded spacious five bedroom detached residence of c 2800 sq. ft set on circa 1.5 acre site, incorporating well-proportioned spacious living accommodation. The property was built in 1988 and is in pristine condition throughout, having been finished to an exceptionally high standard. \n\nThe property is approached by a tree lined sweeping avenue with mature gardens and shrubs, garden lighting and seating areas, which will capture your attention and it's just a stone's throw from Cork City and Blarney Village.\n\nTo the rear of the property you have your own private tennis court, steps up to an elevated secluded patio area overlooking the gardens and mature shrubbery and a magical view of Blarney Castle.\n\nThe property is going to attract serious interest to discerning purchasers seeking a residence of splendour, space and character.\n\nThis is a fantastic must-see property which offers the luxury of quiet country living within a short drive to Blarney and Cork City with all amenities and facilities close by.\n\nLocated just 5 minutes drive to Blarney or Cork City, with Blackpool Shopping Centre - North Ring Road in close proximity.\n\nAccommodation:\n\nPorch:\t1.9m x 1.9m\t\nDouble glazed PVC sliding porch door leading to tiled entrance hallway with window and curtains.\n\n\nHallway: \nLarge entrance L-shaped hallway with teak entrance front door, leading to all downstairs accommodation, alarm, cctv security system, solid teak doors, architrave and skirting board, carpet, radiator. \n\nLivingroom:\t4.6m x 4.8m\t\nMagnificent spacious lounge with feature white marble fireplace with gas fire inset, cream carpet and exquisite curtains and swags to suit the ambience of the decor, solid teak door, architrave and skirting board, radiator.\n\nDiningroom:\t3.62m x 4.94m\nLarge formal dining room which facilitates 10 person dining room table, carpet, curtains, radiator.\n\nSitting Room:\t4.13m x 4.83m\t\nSpacious living room with feature open fireplace as centre piece - black cast iron inset with ornate floral side panels, black marble heart and ornately carved teak surround, carpet, curtains, solid teak door, architrave and skirting, radiator.\n\nKitchen:\t4.9m x 3.19m\t\nSpacious fully fitted honey pine kitchen units both floor and eye level with uniquely designed matching table\/breakfast bar built in to match and complete the overall design of the kitchen, wood effect flooring, recessed lighting, and integrated appliances, dishwasher, oven, hob, microwave.\n\nUtility:\t2.1m x2.8m\t\nTiled floor, plumbed for washing machine.\n\nGuest W.C.:\t\nGuest toilet and w.h.b.\n\nBathroom:\t\nTiled walls, carpet, 3 piece bathroom suite\n\nOffice:\t2.37m x 2.7m\t\nCarpet, radiator.\n\nHotpress:\t\nImmersion, shelved hotpress\n\nMaster Bedroom: 4.2m x 4.1m\t\nBright spacious bedroom with ensuite.\nSolid Teak bedroom door, architrave and skirting board, built in robes, carpet, curtains, radiator, light fitting.\nEn-suite: Tiled walls, carpet, shower unit with electric shower, whb & wc, accessories.\n\nBedroom 2:\t3.92m x 3.58m\t\nSolid Teak bedroom door, architrave and skirting board, carpet, curtains, built in robes with vanity sink and unit, radiator, light fitting. \n\nBedroom 3:\t3.82m x 3.55m\t\nSolid Teak bedroom door, architrave and skirting board, carpet, curtains, built in robes with vanity sink and unit, radiator, light fitting.\n\nBedroom 4:\t3.47m x 3.40m\t\nSolid Teak bedroom door, architrave and skirting board, carpet, curtains, built in robes with vanity sink and unit, radiator, light fitting.\n\nBedroom 5:\t3.02m x 3.89m\t\nSolid Teak bedroom door, architrave and skirting board, carpet, curtains, built in robes with vanity sink and unit, radiator, light fitting.\n\nStairs & Landing:\nCarpet, Solid Teak Staircase.\n\nUpstairs:\t\nLarge open plan floored area with additional room sectioned off. \n\nAttic Room:\t4.42m x 4.00m\nFloored with velux windows\n\nGARDEN DETAILS: \nFront - Private walled-in secluded site on circa 1.5 acre with entrance pillars and sweeping avenue, mature lawns, shrubs and trees.\n\nRear - To the rear of the property you have a strategically located elevated patio area which captures the day light sun and overlooks the gardens and tennis court and also captures a magical view of Blarney Castle.\n\nThe property also has a two car brick built garage to the rear of the house which gives an option of converting to a granny flat, separate apartment or office (this garage has a built in chimney for conversion options).\n\nHEATING:\nOil fired central heating \n\nFEATURES: \nExceptional Property on Secluded 1.5 Acre Site \nA residence of splendour, space and character\nManicured Lawns and Shrubberies\nStrategically located patio area which captures the day light sun.\nPrivate tennis court to the rear of the property.\nTwo car brick built garage with built in chimney for conversion option.\nOffers country living but it is only a stone's throw from Blarney Village, Cork City and Blackpool Shopping Centre & Business Park and the North Ring Road.\nAdjacent road has low volume traffic.\nProperty is wired for broadband.\n\nDIRECTIONS:\nFrom Blackpool Shopping Centre take the New Mallow Road.\nTake the Killeens Exit heading towards the Sunset Ridge Hotel.\nTake the fly-over and take a left at the Hotel.\nProperty is located 500 yards on the left hand side from the Hotel.\nFeatures:\nExceptional Residence of c. 2800 sq.ft on Secluded 1.5 Acre Site.\nA residence of splendour, space and character with manicured lawns and shrubberies.\nStrategically located patio area which captures the day light sun and has a magical view of Blarney Castle.\nOffers country living but it is only a stone\\'s throw from Blarney Village, Cork City and Blackpool Shopping Centre & Business Park and the North Ring\nTwo car brick built garage with built in chimney for conversion option & private tennis court to rear of property.\nFacilities:\nParking\nAlarm\nWired for Cable Television\nOil Fired Central Heating\nBER Details\n ber-D2  What's this?\nBER No. 107314833\nEnergy Performance Indicator: 287.00 kWh\/m2\/yr\n","id":"351855938350894"},{"name":"House and Lot For Sale- Filinvest","id":"682601748466473"},{"name":"Upington House for sale","id":"931002360256016"},{"name":"House and Lot for Sale Philippines","id":"159422640781009"},{"name":"House For Sale in CDO \/ 0917-713-5269","id":"623184357782534"},{"name":"House and Lot For Sale -Cagayan de Oro, Phil (09069527922)","description":"Leuterio Realty is the country's fastest growing brand in real estate service owned and managed by Realtor Anthony \"Tonton\" Leuterio. In less than five years since its inception, Leuterio Realty has emerged as the most-sought after brand real estate agency and brokerage firm because of its real assets -- People. To date, Leuterio Realty has already sold hundreds of inventories since 2008 from mass housing to high-end condominiums, to posh subdvisions and private properties. Its passion to develop high-performance agents, Leuterio Realty has consistently received awards and recognitions for topping sales of developers for more than three years - an unparalleled record for a new-comer in real estate agency. Leuterio Realty has a network of more than 1,500 agents (and growing) spread all over the archipelago all equipped with the knowledge, training, tools and ethical values to address the three pillars of real estate agency: 1) determine the best possible value for their investment 2) to fairly and properly advice clients of the pros and cons of the property and; 3) to provide the needed assistance and client support to ensure smooth transfer and acquisition of property. How did Leuterio Realty & Filipino Homes achieve such solid results in less possible time? -- \"OUR AGENTS\"! Our Vision We envision to lead the change in Philippine Real Estate industry by adhering to, and faithful observance of, strict ethical and professional standards in order to give the best possible service to its clients, to its colleagues, and the rest of the property sector's value chain. Our Mission Leuterio Realty believes in its people and their potential. We strive to harness everyone in the team by providing the knowledge, tools, motivation and values so they may become effective not only in their chosen profession but also in life. You can go to our website: www.leuteriorealty.com ","id":"172041656257532"},{"name":"House For Sale Kings Park Glasgow G44","id":"1545064385741604"},{"name":"House and Lot For Sale in Iloilo","id":"1572541456355291"},{"name":"House and lot ( for sale)","id":"184781778256189"},{"name":"French House For Sale","id":"792571344124137"}]