[{"name":"Travel Insurance Direct","description":"Save on your holiday travel insurance with Travel Insurance Direct! \n\nUnderwritten by certain underwriters at Lloyds, the world's leading insurance market, we provide genuine 24\/7 emergency assistance through Specialty Assist, a leading global emergency assistance company. ","id":"110340958992789"},{"name":"Cover-More Travel Insurance","description":"Cover-More provides top quality travel insurance cover to customers in Australia and the UK. We have over 25 years of experience in travel insurance and over 10 million satisfied policy holders to date. In New Zealand we offer the same top quality travel insurance cover backed by years of experience.\n\nWe provide all customers with a 24 hour emergency assistance service so you know we’ll be there when you need us most. Our policies also come with a great range of benefits including luggage cover and overseas medical and dental cover.","id":"127996520584566"},{"name":"1Cover Travel Insurance","description":"Travel insurance is seen as a grudge purchase, but should things go wrong overseas, it will be money (extremely) well spent.\n\nEvery single day, Australian’s have accidents or illnesses, lose bags, wallets, cash, crash hire cars, miss flights and drop phones down the toilet, all whilst overseas on their holidays.  \n\n1Cover takes the stress away from all of these situations.  Our Brisbane based Claims and Emergency Assistance Call Centre is here to help you with anything.\n\nYou Can Count On Us.\n\nWe are here on Facebook to respond to your inquiries between 9am-5:30pm (AEST), outside of these hours we will do our best to respond to you however in an emergency please call +61 7 3305 7499.","id":"104181799657284"},{"name":"Alpha Travel Insurance","id":"12759429196"},{"name":"TravelSafe Insurance","description":"TravelSafe Insurance in Reading, PA, provides travel insurance for vacationers, business travelers, and adventurers who are flying, taking a cruise, or otherwise hitting the road. Our service also works to educate other travel insurance agencies, serving all clients in United States and Canada. Since 1971, we have marketed and administered the most comprehensive policies in the industry. Today, we are leading the way in developing new solutions for the insurance needs of individuals and families, and we are ready to work for you.","id":"235389713207835"},{"name":"Allianz Travel Insurance USA","description":"As a leading provider of travel insurance, corporate assistance, concierge services and more, our partnerships number in the thousands and include: travel agencies, airlines, resorts, websites, event ticket brokers, corporations, universities, and credit card companies. \n\n","id":"133286055813"},{"name":"TravelInsurance.com","id":"212809452173951"},{"name":"Travel Insurance Direct","description":"We have been in the travel trade for over 10 years now during which time our name has become synonymous with value for money and good old fashioned customer service.\n\nMany people ask us how we are able to provide such good value for money. For a start, we don't have any parent companies taking a share of our profit. Additionally, we only promote our name over the Internet; no expensive media advertising and no gimmicks. The result is we are able to pass the savings to our customers, many of whom return year after year.\n\n","id":"156479571103176"},{"name":"Travel Guardian Insurance Ltd.","description":"Founded in 1991, Travel Guardian Insurance has been a force in the Canadian snowbird and Travel Insurance industry, and currently serve over 80,000 clients. We offer insurance products from RBC, Manulife, RSA and Travel Underwriters, just to name a few.\n\nJust recently, in May of 2014, we have opened out line of business up to Home & Auto Insurance and Individual Health Insurance.\n\nOur MORE (MembersOnlyREwards) program, also launched in May of 2014, provides our clients and new clients to come with a discount card for businesses all over North America.\n\nWe are Western Canada’s largest Travel Insurance Brokerage. With a large repertoire of unique products, we pride ourselves on being able to provide coverage to virtually anyone.  \n\nAlberta:\n\nSouth Edmonton - Head Office:\n9808 - 42 Avenue NW\nEdmonton, AB T6E 5V5\nP: 780-414-6299\nT: 888-831-9338\n\nTravel Agency - South Travel Guardian Location: 780-450-6030\n\nNorth Edmonton:\n#107, 13245 - 140 Avenue\nEdmonton, AB T6V 0E4\nP: 780-487-5400\nT: 877-482-7381\n\nCalgary:\n\n#104W, 1144 - 29 Avenue NE\nCalgary, AB T2E 7P1\nP: 403-272-8111\nT: 855-372-8111\n\n\nBritish Columbia:\n\nSurrey, BC\n#201, 2055 - 152 Street\nSurrey, BC, V4A 4N7\nP: 604-536-2280\nT: 844-536-2280\n\nLumby, BC\n\nT: 855-547-6987\n\nOntario:\n\nHamilton, ON\n\nP: 905-525-8747\nT: 844-525-8747\n\n","id":"157561371117081"},{"name":"Travel Insurance Services","id":"315106633609"},{"name":"ERV UK - Travel Insurance","description":"ERV.co.uk, provides a wide range of travel insurance products from Single trip policies through to more specialist products such as cover for Backpackers.\n\nEach policy sold includes Emergency Medical Expenses Cover with free access to a 24\/7 Emergency Medical assistance company.\n\nERV.co.uk goes that extra mile by providing policy holders with access to our Euro Center teams, an English speaking worldwide network of offices housing medical experts, ready to assist if the unfortunate occurs.\n\nOur website provides useful information for travelling abroad with regular updates and articles helping you make the most out of your trip.\n\nERV’s Facebook Rules & Guidelines:\n\nSocial media is all about being social and engaging with our followers, but there are a few guidelines which will help keep our Facebook page a pleasant, informative and useful experience for everyone:\n\n1. We take your privacy VERY seriously, and so we may have to delete posts which contain any personal data. We strongly advise you NOT to publish any personal information on our page. Telephone numbers, addresses, personal information and policy numbers should not be publically posted. If you need to send us these details, please contact us via a private message first and we will only ask you for the information we need to assist you.\n\n2. There may be times where we may ask you to take a conversation ‘offline’ to avoid the need to have sensitive or personal data transmitted via social media. We may also need to direct your enquiry to a particular member of our team who would be the best person to answer you queries. In this circumstance we will provide you with an email address and\/or telephone number for a member of staff who can continue the discussion directly with you. \n\n3. Negative comments or critical feedback helps us to improve our products offerings and, more importantly, our customer service. However, we cannot allow the continuous posting of off-topic messaging which is to the detriment of other users. We reserve the right to remove any posts on our page \n\n4.  We will not accept obscenities, insults or any other abusive behaviour to ANY user of this page. We will request that these comments be immediately removed or the user responsible reported to Facebook.\n4. Posting of personal or commercial details such as names, e-mail addresses and telephone numbers of any employees, affiliates or partners of ERV is not allowed without permission. \n\n5. Commercial messages and advertisements are not permitted on our Facebook page and will be removed. If you wish to speak to ERV about commercial opportunities, please submit your enquiry on the contact form on our website - http:\/\/www.erv.co.uk\/enquiry\n","id":"207343545979030"},{"name":"Travel Insurance Geek","id":"150565841811334"},{"name":"Multitrip.com Travel Insurance","description":"Multitrip.com is part of Multi Award Winning Blue Insurances Limited, an Irish Company based in Blanchardstown, Dublin. We have a commitment to offering the consumer greater choice and comprehensive cover at very competitive prices. \n\nOur easy to use website makes booking a policy so simple and quick that you can get on with arranging other parts or your holiday or trip. Our Call Centre staff is also available if you need assistance or would like to book on the phone, however please note that the cheapest prices are available online. So why not \n\ncompare our holiday insuranceand avail of our comprehensive but cheap travel insurance today. \n\n\n \n\n\n","id":"101873006542832"},{"name":"Travel Insurance Office Inc.","description":"One of Canada's largest travel insurance brokers","id":"211831692166482"},{"name":"Travel Insured International, Inc.","description":"Travel Insured International Covers:\n-Trip or Flight Cancellation\n-Trip Interruption\n-Emergency Assistance\n-Medical Evacuation\n-Default and Bankruptcy Protection\n-Accidental Death and Dismemberment\n-Return of Deceased Remains\n-Missed Connection\n-Baggage Delay or Loss\n\nLearn more by visiting our website: http:\/\/www.travelinsured.com\/\n \nTravel Tip and Ideas Blog: www.blog.travelinsured.com","id":"294336485628"},{"name":"C.A.Shaw Insurance & Travel","id":"118528114839318"},{"name":"Globelink Travel Insurance","description":"Globelink International Ltd. prides itself on its excellent customer service and ability to provide you with the best travel insurance policy for your needs!\n\nOur policies are available for travellers living in the UK or other European Union Countries.\n\nOur policies are also available to Australian, New Zealand and South African passport holders who currently reside in the UK.\n\nGlobelink provides coverage for almost any type of journey and age group (up to 84).\n\nYou can get a cover for one trip if don't plan any more trips in the next 12 months; or annual multi trip - if you wish to undertake several trips within a 12 months period.\n\nYou are also given an option to extend your policy to provide an extra cover for hazardous sports\/activities, baggage, golfer's cover, excess waiver, event cancellation, wedding cover or repatriation to Australia, New Zealand or South Africa if you are a passport holder of any of those countries.\n\nOur range of policies has been specially selected to provide a sensible level of cover at reasonable cost.\n\nGlobelink International allows you to:\n\n* Find, Compare and Buy Travel Insurance\n* Arrange Cheap Travel Insurance\n* Simply & Securely Purchase Online\n\nWe aim to provide cover for virtually any of your requirements and if you do not find a solution on these pages, please do not hesitate to contact our team of experienced underwriters by telephone or e-mail. \n\nTravel insurance with Globelink International means great cover at a very low cost therefore more money to spend on your holiday itself!","id":"139205179432336"},{"name":"Travel Insurance Center","id":"278809093161"},{"name":"Compare Travel Insurance","description":"https:\/\/www.comparetravelinsurance.com.au is Australia's leading travel insurance comparison site. We compare more travel insurance providers and policies than any other comparison.\n\nWe provide comprehensive unbiased travel insurance information to save you time and money. At last you can visit one website and view a wide range of travel insurance policies within seconds.\n\n•\tCompare 100+ quotes in seconds\n•\tCompare policies and levels of cover\n•\tReputable brands you can trust\n•\tSame great price as going direct\n•\tMake huge savings\n","id":"172758926078749"},{"name":"Travel Insurance Saver","description":"Save up to 30% from QBE one of Australia's Largest Insurance Providers at www.travelinsurancesaver.com.au","id":"54465261954"},{"name":"A + Insurance & Travel","description":"Your Community. Your Insurance Why choose a local Independent Agent such as A+ Insurance of Sarasota Inc.? We represent many different insurance companies, so we can compare coverage and price to give you the best possible value. We are committed to our customers and our community. We work for you! We offer commercial and personal insurance to ensure that you are protected from the unexpected. \n\nOur staff is dedicated to providing all clients with complete coverage at the best rates our carriers offer. A+ Insurance of Sarasota Inc. has years of experience and education which allow us to guide clients in making well-informed decisions regarding their insurance needs.","id":"328669553892575"},{"name":"Travel Insurance Malaysia","description":"ACP Group (ACPG) - COMPANY PROFILE\n\nACP Group (ACPG) is a locally owned company established in Year 1989. It was incorporated to trade in the business of insurance, such as: property, casualty, general, commercial, life and health. It started with four employees, including the husband and wife team of Anthony Chin and Anna Sim With the perseverance and hard work of the couple and their trusted and loyal employees, the company grew to a multi million-dollar operation within a short period. \n\n\nToday, ACPG currently employs over 12 staff servicing thousands of customers in Kuala Lumpur. For the last 22 years, ACPG is a full-line agency, offering general, commercial, Business, life, non-life and health insurance products. It has become a one-stop-shop for corporate and individual clients' insurance needs. It markets property and liability insurance, surety and bonding, fidelity and crime, Professional Liability Insurance, Condominium Insurance, Special Events, Contractors All Risks, marine, life and health insurance. \n\nThe company is organized to maximize the potential of its employees and to continuously deliver professional service to its clientèle. The company's management philosophy is to provide the necessary training and development courses to its employees to ensure that they are abreast of developments in risk management, insurance coverage and claims procedures.\n\nThe goals of the company are to: deliver value-added professional service to all its customers; create comprehensive and quality insurance products and services with competitive terms; uphold its reputation for integrity and innovation; enhance the professional and personal growth of its employees to empower them to do their personal best; and maintain a profitable business for the benefit of its insured’s, principals, employees and shareholders.\n\nACPG MISSION \n\nTo help the community we serve to better manage the risks of daily life by providing insurance products at fair prices; settling claims fairly and expeditiously; and delivering value-added service to our customers.\n• Commitment to our Clients\nWe listen to our clients in order to understand their needs. In turn, we offer the industry’s most innovative products, including many speciality classes of business.\n• Efficient Claims Services\nWe are committed to providing our customers with efficient and responsive claims management services. Through our prominent claim handling, we are able to act swiftly and efficiently, minimizing disruption and inconvenience to your business.\n\nACPG VISION\n\nOur vision for the future is to be the preferred provider of insurance products and services in Malaysia and continue to be one of the industry leaders in the region.\n\nTo deliver quality and affordable Insurance services and Training Program, ACPG possess the 22 years experienced professional team members, in which the team members have been in the industry since 1989.\n\nACPG is looking for a long-term business relationship with General Insurance & Business Insurance Company in all classes of General & Business Insurance Services.\n\nACPG Founder & Chief Executive Officer (CEO), Mr. Anthony Chin is a Member of Million Dollar Round Table MDRT (USA) qualifier and has had more than 22 years experiences ( since 1989 ) in the Insurance business.\n\n \nMr Anthony Chin become the youngest Senior Manager of Agency for the Insurance Company. His 18 years agency management experience was gained from providing training general & Business insurances, healthcare management and training services. He has had 18 years experience in managing his own management and training company. \n\nMr. Anthony Chin outstanding leadership and management forte gained him an interview by an magazine and new paper from year 1995 until 2010 as a \"Super Insurance Salesman”, the \"Best Insurance Manager” and as a \"Best Management Company” in the Business World Magazine and Corporate Journey Magazine as the cover story in its July 2001 and October 2008 edition. He is capable in motivating and leading the company to achieve sales they never thought was possible.\n\nACP Group of companies\n1) ACPG MANAGEMENT SDN BHD\n2) ACP LOYALTY ADVANCE\n3) ACP ADVANCE RESOURCES\n4) ACPG MANAGEMENT & TRAINING\n5) WALK IN ONLINE (M) SDN BHD\n6) MONT GENIUS SDN BHD\n7) AMG ADVANCE ASSET (M) SDN BHD\n8) MSP ADVANCE (M) SDN BHD\n9) HYUNDAI WELLNESS SDN BHD\n\nOFFICE LOCATED AT\n158-3-7, BLOK 158, 3RD FLOOR, KOMPLEKS MALURI,\nJALAN JEJAKA, TAMAN MALURI, CHERAS,\n55100 KUALA LUMPUR, MALAYSIA.\n\nOFFICE CONTACT \n+603-9286 3323\n\nFAX NUMBER\n+603-9282 3232\n\nEMAIL ADDRESS\nenquiry@acpgconsultant.com\ncorporate@walkinonline.com\nenquiry@walkinonline.com\nanna@walkinonline.com\nanthony@walkinonline.com\n\n\nHOMEPAGE\nwww.acpgconsultant.com\nwww.walkinonline.com\/store\/ACPG.php\n\nFacebook \nwww.facebook.com\/acpg.management","id":"156759007732970"},{"name":"Travel Insurance","description":"Travel with ease! Be it for a short business trip or an extended vacation, let us take care of your travel needs while you explore the world in complete freedom. \n\nBased on your preference for the amount of coverage, our plan is available in:\n1) Premier\n2) Superior\n3) Classic\n\nAll plans cover medical expenses incurred overseas & locally, personal accident benefits and travel inconvenience benefits such as fraudulent credit card usage, travel cancellation, travel postponement, travel delay & baggage delay\/ loss. \n\nFor full details on the coverage, please refer to this link: http:\/\/www.aig.com.sg\/chartisint\/internet\/SG\/en\/files\/TravelGuard%20eBrochure_tcm1030-229015.pdf\n\nLet us do your paperwork for you. Just provide us with the below details and we can help you get your travel insurance done up before you know it!\n\n1. Full Name\n2. NRIC\n3. Date & Year of Birth\n4. Address\n5. Mobile Number\n6. Email Address\n7. Destination\n8. Date of Departure\n9. Date of Return\n10. Preferred Plan\n\nMode of payment: Credit card - Card No, Expiry date (mm\/yy), Type of card - Amex, Mastercard, Diners, Visa?\n\n*Hotline while you are overseas*\nCall Travel Guard hotline at +65 6733 2552 for \n24-hour medical & emergency assistance and travel information.","id":"1424772671167068"},{"name":"Flexicover Travel Insurance","id":"43414138286"},{"name":"G1G Travel Insurance","description":"Since 1985, we have been the premier distributor of travel and medical insurance products and services. We handle the physical and financial risks involved with traveling, so you can focus on enjoying your journey.\n\nWe operate on an aggregation model, similar to hospitality companies that let you compare prices of various airlines and hotels from around the world. Buying your travel insurance policy from an aggregator gives you a full slate of options, so you know that you are getting the right policy for you. We make the process of connecting you with an appropriate plan that fits your needs quickly, easily, and above all, comprehensibly.\n\nNo one has as much experience as us when it comes to travel insurance. Those who have any industry experience tend to be general, closed market providers who have less of an incentive to care for you after the point of sale, while we are here 24\/7 when you have specific questions regarding a policy or any issues with your claim. All policies purchased through G1G come with 24\/7 emergency assistance so you are never left alone during a crisis abroad. Our knowledgeable staff has decades of industry experience and is here to guide you through purchasing a policy, navigating the customer portal, renewing your policy, filing and collecting on claims, finding nearby doctors and medical facilities, and accessing policy details and emergency assistance numbers.\n\nWe deliver a platter of policies curated just for you that we have carefully vetted and tested to meet our rigorous standards. G1G set an industry standard over a decade ago by requiring all providers to have an A.M. Best rating of no lower than an A. Building on that foundation, we have since elevated our quality assurance to include an analysis of a company's BBB report, customer reviews, claims pay-out ratio, reinsurers credit history, and other benchmarks that assist in connecting you with only the best products in the world. This often means making the decision of not offering products and underwriters that fall below our standard.\n\nOur industry experience combined with personal travel experience allows us to implement new ideas with the perspective of the user in mind. We are the only aggregator in the world to provide a fully branded client portal, giving you access to all your necessities in one place. We have made G1G.com accessible around the world – available through your personal computer, tablet, or phone, connecting you to real humans.\n\nAdditionally, we work with underwriters and third party administrators to create new products for travelers, and on a business-to-business level, allowing affiliates to resell our products and services to their users. This integration is made seamless via iframe solutions or custom white-labeled sites. We also SAAS out our internal CRM software to small and midsize firms in the financial service industry, when oftentimes alternative CRM applications do not meet the specific needs of our niche.\n\nWe want you to enjoy the journey (this is a daily mantra that we incorporate into our workplace life as well), and we are here to help you every step of the way.","id":"56089159735"},{"name":"Direct Travel Insurance","id":"143240649199010"},{"name":"Travel Insurance File","description":"TIF is published by Milan Korcok, a long time advocate for Canadian snowbirds and out- of-country travelers. It is designed as an independent, unbiased resource for Canadians wanting to make informed choices when buying travel insurance.","id":"120056924758874"},{"name":"Travel Insurance Plus","description":"Long Description:\nTravel Insurance Plus is an online travel insurance specialist.\n\n100% Australian owned, Our customer service and claims centre is based in Australia, so you can be sure to be understood whether you’re fair dinkum up the creek without a paddle, or not within a cooee of help.\n\nTravel Insurance Plus is underwritten by Allianz Australia Insurance Limited, one of the largest Underwriters of travel insurance in Australia, and part of the worldwide Allianz Group.\n\nThis means our customers have access to our 24\/7 emergency service, provided by Allianz Global Assistance. Allianz Global Assistance is one of the largest global emergency assistance companies, so they have the size, reach and expertise to help if you need emergency medical care. Located all around the world, and including a worldwide team of more than 500 doctors and medically qualified employees supported by an international network of 400,000 high-quality, certified service providers and 180 international correspondents, you can feel confident that you will be taken care of in times of need.\n\nContact Us\nTravel Insurance Plus is here, 24\/7.\n\nEnquiries:   1800 662 522 (within Australia)\n\n                    +61 7 3377 3915 (from overseas)\n\nClaims:        1800 662 522 (within Australia) or\n\n                    +61 7 3305 7499 (from overseas)\n\n                     travelclaims@allianz-assistance.com.au\n\n\nOur User Comment Policy\nAt Travel Insurance Plus, we want to facilitate an open and positive community, where users can contribute to a discussion on travel. Please note, however:\n1. Many of our comments are pre-moderated.\n2. We will remove comments we believe may be offensive or derogatory to some, are from non-approved, commercial sponsors, breach privacy (yours or another’s), or are spam.\n3. We want to celebrate travel, but will remove any images or postings we believe could be offensive to some.\n4. The views of our users are the views of the individual, and are not the views of our company.\n5. We want our community to feel very comfortable on our Social Media Platforms. Please inform us at enquiries@travelinsurnaceplus.com.au if there is anything on our site that you find upsetting.\n\nHours of Service\nPlease be aware that our Facebook page is monitored between 8am to 5pm Monday to Friday. Should a post require a response, we will endeavour to respond to your post within 24 hours, and we will let you know if it is going to take longer than this to resolve.\n\nPrivate Messages\nWhile we are happy for you to contact us using the private message function, we would prefer that you email enquiries@travelinsuranceplus.com.au with any questions or concerns relating to your cover. These are the only methods of secure contact where will ensure your privacy is protected.\n\nClaims\nDue to privacy legislation, we do not allow comments relating to the specific details of a claim on our Facebook page. Queries relating to specific claims can be addressed by via our website or through our customer service centre.\n\nModeration of your comments (the legal wording)\nIn particular Travel Insurance Plus will moderate or remove comments that:\nAre considered to be harassing, discriminatory, abusive, threatening, defamatory, obscene, false, fraudulent, deceptive or misleading, confidential and\/or commercially sensitive\nIn our opinion, make negative references to any third parties outside Travel Insurance Plus\nIn our opinion, violate any intellectual property right of another\nIn our opinion, violate any law or regulation\nInclude personal or private information\nInvolve an argument between users on our Facebook page\nHave been posted by employees who are not authorised to do so\nProvide a link to an external site\nAre considered inappropriate in another way\n\nPlease understand that user generated comments and content posted on this Page do not represent the opinions of Travel Insurance Plus.\n","id":"483554828412447"},{"name":"All choice Insurance & Travel Agency","description":"Auto. Home. Life. Business insurance.","id":"127848957282965"},{"name":"YouGo Travel Insurance","description":"You travel. You're smart. You know it makes sense to get travel insurance, but only if it's good value. Congratulations on discovering youGo! youGo offers affordable travel insurance that you can tailor to what you need. With youGo, you can buy great travel insurance at a great price.","id":"504199386358456"},{"name":"Fast Cover Travel Insurance","description":"Providing low cost quality Travel Insurance online for Australian residents.\n\nOur comprehensive policies cover Medical, Delays & Cancellations, 24 hour worldwide assistance, personal effects and much more!","id":"143576175692316"},{"name":"Travel Insurance Direct - Travel Insurance For Ireland","description":"In 2009 we introduced a new range of policies specifically for our customers in the Republic of Ireland. Underwritten by Irish insurance experts White Horse Insurance Ireland Limited, we have been able to introduce to Ireland the same high levels of cover and value for money our UK customers have come to expect from \n\nTravel Insurance Agencies Limited (TIA) are an independent travel insurance broker based in Norwich in the UK. The company prides itself on providing top rate customer service and value for money, a factor which is achievable through our modest size.\n\n","id":"271996662828296"},{"name":"Travel insurance","description":"Travel insurance is insurance that is intended to cover medical expenses, trip cancellation, lost luggage, flight accident and other losses incurred while traveling, either internationally or within one's own country.Travel insurance can usually be arranged at the time of the booking of a trip to cover exactly the duration of that trip, or a \"multi-trip\" policy can cover an unlimited number of trips within a set time frame. Some policies offer lower and higher medical-expense options; the higher ones are chiefly for countries that have extremely high medical costs, such as the USA.Coverage typesThe most common risks that are covered by travel insurance plans are: Medical emergency (accident or sickness) Emergency evacuation Repatriation of remains Return of a minor Trip cancellation Trip interruption Visitor health insurance Accidental death, injury or disablement benefit Overseas funeral expenses Lost, stolen or damaged baggage, personal effects or travel documents Delayed baggage (and emergency replacement of essential items) Flight connection was missed due to airline schedule Travel delays due to weather Hijacking Medical expense coverage can be per-occurrence or maximum-limit.Optional coverageSome travel policies will also provide cover for additional costs, although these vary widely between providers.","id":"116037641740036"},{"name":"Travel Medical Insurance","id":"376083135752730"},{"name":"Cover-More Travel Insurance New Zealand","description":"Cover-More provides top quality travel insurance cover to customers in New Zealand, Australia and the UK. We have over 25 years of experience in travel insurance and over 10 million satisfied policy holders to date. Here, in New Zealand we offer the same top quality travel insurance cover backed by years of experience.\n\nWe provide all customers with a 24 hour emergency assistance service so you know we’ll be there when you need us most. Our policies also come with a great range of benefits including luggage cover and overseas medical and dental cover.","id":"509355672423939"},{"name":"Zirpolo Insurance & Travel","description":"My name is Cynthia Zirpolo and I am the Insurance Broker at Zirpolo Insurance. \nOur company offers Property & Casualty which includes: Auto,Home,Flood,Workers Comp,and Commerical Auto. \nWe also provide Health Insurance which includes: Disabiltiy,Long Term Care, and Group Insurance. \n\nI specialized in Auto and Home Insurance which also includes multi line discount. Companies that I represent offer great rates! \n\nCheck us out at zirpoloinsurance.com","id":"235426269832819"},{"name":"International Travel Insurance Group","description":"InternationalInsurance.com is owned and operated by International Citizens Group, Inc (ICG), located in Boston, Massachusetts and Jacksonville, Florida. Run by world travel experts and expatriates, we are ideally placed to assist you with your international insurance needs no matter where you are located around the world. Our online business is able to help you on your time with instant online applications, email support that provides responses in 24 hours or less and phone support for any questions.\n\nWhy We Do What We Do\n\nOur mission is to educate consumers on the value of travel insurance and provide a resource for them to research, compare and purchase plans for their international trip. We work with volunteer groups, travel companies, international employees, expatriates, missionaries, and anyone traveling throughout the world.\n\nAbout Our Services\n\nThrough our website, we are able to offer some of the very best international health and travel insurance policies to people from all around the world. Unlike traditional insurance sources, InternationalInsurance.com provides all their plans online through their website which has some benefits over traditional insurance brokers\/ agents such as being able to offer insurance 24 hours a day, 7 days a week.\n\n- See more at: http:\/\/www.internationalinsurance.com\/about\/","id":"456510011143254"},{"name":"Travel Insurance Planet","description":"www.TravelInsurancePlanet.com\nWhat is Travel Insurance?\nTravel insurance, also know as trip insurance, trip cancellation insurance and trip interruption insurance protects a traveler's vacation cost against cancellation, interruption and delay while also providing medical and lost or damaged property coverage. Researching travel insurance products can be confusing. That is why we built our Policy Picker to help you easily compare the price and benefits for several travel insurance plans.\nwww.TravelInsurancePlanet.com","id":"839028616129905"},{"name":"JS Travel Insurance","description":"JS Travel Insurance, in Hove, East Sussex, offers clients comprehensive travel insurance while they are travelling in the UK, Europe, or anywhere throughout the world. Our company is part of Jade Stanley Ltd, a business which was established in September 1999. The key aim of our service is to provide customers with instant travel insurance that maximises the use of internet technology without sacrificing our personal touch. More than 500,000 customers have been insured by us, but despite this success we continue to sell our policies in a professional and courteous manner.","id":"672340086224804"},{"name":"Travel Insurance Covered","description":"Established in 2013, TravelInsuranceCovered.com has been set up to simplify the process of buying travel insurance.  In an often complicated and confusing area, TravelInsuranceCovered.com aims to strip out the jargon, ask simple questions, offer competitive prices and provide clear and instant access to quality travel insurance products.\nTravelInsuranceCovered.com gives you access to a panel of insurers so that you can choose the policy that suits your needs best.\n\nTravelinsurancecovered.com provides an instant solution for travel insurance for a range of different holiday types and holiday makers.\n\nTravelInsurancecovered.com is able to offer both single and annual multi trip policies for individuals, couples, families and groups. Cover is available for winter sports Insurance- ski and snowboard insurance, cruise insurance, travel insurance with pre- existing medical conditions and travel insurance for over 60, over 65 and over 70 years of age.\n\nTravelInsuranceCovered.com have partnered with Just Insurance Agents limited – one of the UKs leading providers of specialist Travel Insurance.\n\t\t\t\nSince 2004 Just Insurance Agents limited has established itself as a market leader in the delivery of high quality and competitive travel insurance.\n\nJust Insurance Agents Limited, work with a panel of insurers to offer a range of policies to suit all needs.\n\nYou can compare and buy travel insurance products easily online, simply select Get a Quote, enter your travel details and select the cover that suits your needs most.\n\nAlternatively if you would like to discuss anything regarding your travel insurance needs please call us on 0800 458 03 95.\n\nSo whether you are planning to lie on a beach, slide down a mountain, travel the seas or see the sights getting the right travel insurance couldn’t be easier.\n\nInsure your next adventure through us.","id":"1411806365756186"},{"name":"Omar's Travel and Insurance","description":"Travel Services- Airplane tickets, Bus Tickets, customized travel planning.\r\nInsurance Services- Auto, Home, Health, Bonds, General Liability, Renters Insurance, Mexican travel insurance, Life insurance,  and more.\r\nVehicle Registration-registration renewal, change of ownership, sticker\/registration replacement\r\nInternational Shipping- Estafeta\r\nNotary Public\r\nHeath Insurance - Private Carriers & Covered California","id":"149839501826641"},{"name":"Backpacker Travel Insurance","description":"Backpackertravelinsurance.ie is the new direct arm of Blue Insurances Limited and is based in both Dublin and Cardiff. We have a commitment to offering the best value together with comprehensive cover for Backpackers at very competitive prices.\n\n Our easy to use website makes booking a policy quick and easy to use and policy confirmation is sent instantly via email. If you need assistance or would like to book on the phone our Call Centre staff are available to speak with, however please note that the cheapest prices are available online.\n\n Our aim is to provide our customers with travel insurance to suit their needs whether travelling for a short time or intending to travel for a longer trip abroad and our specialised Backpacker Travel Insurance cover is among the most competitive and comprehensive in the market.\n\n As well as providing the usual Travel Insurance Benefits including Medical Expenses, Personal Accident Cover, Travel Delay and Baggage Cover, backpackertravelinsurance.ie includes many adventure sports covered for free for example Bungee Jump or White Water Rafting. backpackertravelinsurance.ie. Our policy will also cover you whilst working including light manual work such as bar work or fruit picking. \n\n backpackertravelinsurance.ie is a domain of Blue Insurances Limited, which is a member of the Irish Brokers Association, Association of Travel Insurance Intermediaries and an Industry Partner of the Association of British Travel Agents. Blue Insurances Limited is regulated by the Central Bank of Ireland and is authorised to provide insurance services in the United Kingdom by the Financial Services Authority (UK).\n\n Blue Insurances has been voted Best Travel Insurance Provider for the past number of years by the Irish Travel Trade and have also won Best Travel Insurance Company at the Northern Ireland Travel Awards.\n","id":"155012504518250"},{"name":"Travel Insurance Tips and Tricks","description":"Travel Insurance is a system that allows you protection of your well being, your belongings and your financial investments whenever you go away.\nThe world of travel insurance can be difficult to navigate, with travellers often left in a difficult situation when buying the wrong policy.\nPay less for your travel insurance and get the best cover for your money by reading our Travel Insurance Tips and Tricks.","id":"117308808455223"},{"name":"Travel Insurance","id":"260937984008425"},{"name":"World First Travel Insurance","id":"134462419323"},{"name":"Travelers Insurance","id":"29123338521"},{"name":"Usa-Assist | Travel Insurance","description":"USA-ASSIST is a leading edge vanguard company that provides online travel insurance products with over 35 years of experience providing protection and assistance to all kind of travelers, groups and organizations around the world.","id":"164292406944014"},{"name":"Travel Insurance In Canada","id":"462894667092413"},{"name":"Compare Travel Insurance.ie","description":"Compare Travel Insurance is a great way to find some of the best deals for travel insurance in Ireland for you and your family. Whether you are travelling for business or leisure you can also find cover for winter sports holidays, backpacking travel, as well as summer holidays, in Europe and World Wide.\n\nJust how important is it to compare travel insurance? How important is travel insurance for that matter? If you asked that question of anyone who has fallen ill or had an accident whilst travelling abroad and incurred what can often be horrendous hospital bills then the answer is likely to be the same - very important indeed! As far as comparing travel insurance is concerned then this is a must. Would you buy a new car having seen only one? ","id":"1380813175517797"},{"name":"Travel Insurance","id":"480944745322441"},{"name":"AXA Travel Insurance","description":"AXA Travel Insurance is a leading global Travel Insurance and Assistance company. Our ethos is about redefining service – leading the market with innovative products and services that exceed our customers’ expectations. We are proud to serve more than 100 global clients in Financial Services in more than 37 markets. \n\nAXA Travel Insurance is part of the AXA Assistance group and therefore we are able to bring a level of expertise and experience that is second to none in the market place. \n\nAXA Assistance Group and has been a leader in the travel assistance industry for more than 20 years. We handled more than 6 million assistance cases per year (across product lines). AXA Travel Insurance benefits from offices in more than 30 countries and is highly active in over 200 countries. We are organised around international hubs, allowing us to develop synergies and guarantee consistent quality of service and processes across the world.\n\nwww.linkedin.com\/company\/axa-travel-insurance\n\nhttps:\/\/twitter.com\/AXATravel\n","id":"1499095190345465"},{"name":"Travel Insurance Canada","id":"159170807446450"},{"name":"Battleface Travel Medical Insurance","id":"258748354312119"},{"name":"Compare Travel Insurance Ireland .Com","description":"Find great quotes for Cheap Travel Insurance \n\nCompare quotes to find great deals to suit you. Whether it’s a weekend away, family holiday or back packing around the world, you can find it here.\n\nhttp:\/\/www.comparetravelinsuranceireland.com\/\n\nCompare Travel Insurance Ireland .Com is owned by Paul Hudson trading as Magenta Online Marketing.\n Paul Hudson trading as Magenta Online Markeing is regulated by the Central Bank of Ireland. Registered in Ireland, ref no 117655.\n","id":"243044692443545"},{"name":"Overseas Travel Insurance","id":"395034370679073"},{"name":"Sanderson Travel Insurance","description":"Sanderson Travel Insurance continues to operate as a “VIRTUAL OFFICE ONLY”\n\nIn order to continue to serve our customers more efficiently, all travel insurance sales are 100% strictly done by phone or online.\n\nWe are travel insurance broker's who shop around to find the best rates.","id":"383697391696403"},{"name":"SYKIMTE INSURANCE AND TRAVEL AGENCY","description":"located at Capitol Road (near Madonna Birthing Home), Surigao City\ncontact\/ viber #.: (086) 826 1859\/ +63 998 976 25 36\nemail: shasykimte@gmail.com\nyou may look for Ms. Sha Sykimte for more details, thank you...","id":"194363130718692"},{"name":"Travel Health Insurance for Canadian Travellers","description":"We Pride Ourselves in Providing “Platinum Quality Care”\n We search all the major Insurance Companies for you and find you the BEST Coverage at the LOWEST Price! Consumers are barraged with a bewildering array of plans, from many different companies.\nTravelers are confused by poorly worded medical questions, pre-existing medical condition restrictions, eligibility requirements, deductible options, claims procedures, etc. So, often, the consumer uses the price as the methods to select the “best” plan for them – unfortunately, this can be totally wrong! The experts at Travel Guardian will help you choose the correct plan for your situation!\n\nWe have over 22 years’ experience in helping Canadians, and Visitors to Canada, obtain appropriate insurance.\n What “Platinum Quality Care” means!\n\nTo the Client:\n•\tFriendly, helpful service, from all the Travel Guardian staff!\n•\tProfessional, knowledgeable agents!\n                   Quick responses to your questions and inquiries!\n\n\nTo the Travel Guardian Staff:\n•\tA team attitude to all parts of our service!\n•\tGoing the extra mile to look after our clients!\n•\tEnsuring we become our clients “Travel Insurance Consultants”, who gladly recommend us to their friends!\n                   \nCall Toll Free 1-855-547-6987 ","id":"482838768475367"},{"name":"Travel Insurance Zone","description":"To buy a policy from Hollard  - bit.ly\/BuyHollard\nTo buy a policy from Regent - bit.ly\/BuyRegent\nTo buy a policy from Regent - bit.ly\/BuyTIC\n\n\n\n\n\n\n\n","id":"834035639960736"},{"name":"Goldfish Travel Insurance","description":"Goldfish Travel Insurance is a comparison site offering discounts on products from QBE, SureSave, CHi and Aussietravelcover.  You can compare policies and buy a policy in 3 easy steps at www.goldfishtravelinsurance.com.au.  100% Aussie owned.  No credit card fees.  Saving money on your travel insurance is a great way to make your travel budget stretch further!","id":"508564562531785"},{"name":"itrek travel insurance","description":"www.itrektravelinsurance.com.au is an NSW based company offering an extensive range of travel insurance to backpackers and long stay travellers.\n\nWhen you buy direct through itrek you can save hundreds as we do not sell through Travel Agents. By operating online we are able to minimise unnecessary overheads and enhance our levels of customer service. This enables itrek to provide you with travel insurance policies at lower prices.\n\nWe are an agent of and Underwritten by Allianz. Allianz is the largest Underwriter of Travel Insurance in Australia and the world's third largest Insurance Company.\n\nTo contact our sales desk call: 1300 884 430","id":"365285720270313"},{"name":"Cheap Travel Insurance","id":"122470331100347"},{"name":"RJ Insurance & Travel Services","id":"514139002013919"},{"name":"Global Travel Insurance Services Ltd","description":"Established in 1997, we remain a small specialist independent insurance broking company which allows us to provide a personal service to all customers including those travel firms for whom we provide travel insurance contracts.\n \nWe specialise in providing travel insurance products for the older traveller and have developed our own style of policy wording with all insurers with whom we place business, making our products unique in the market. These unique features can be seen in our range of products available to you.\n \nWe also provide insurance services for the travel industry including Brochure Travel Insurance schemes for a wide range of Tour Operators including many \"niche market\" schemes, Combined Liability Insurance, Office Insurance, Staff Travel Insurance, Business Travel Insurance, Crisis Management Insurance, Travel Industry Bonding, and much more.\n \nIn 2005 we became authorised and regulated by the Financial Services Authority (FSA). Prior to this we were voluntarily regulated by the General Insurance Standards Council (GISC). We are also members of the British Insurance Brokers Association (BIBA) and the Association of Travel Insurance Intermediaries (ATII).\n","id":"449554685085336"},{"name":"Travel Insurance Australia","description":"We provide an extensive range of travel insurance products at a discount price! Our staff is specially trained in the area of travel, in fact we ONLY do Travel Insurance. Most of our staff are well travelled and some are ex travel agents so we know more than most people not only about travel BUT travel insurance.\n\nWe are constantly looking for new insurers, new product or suggesting products to our insurers. We have had our wins resulting in QBE creating their Alternatives product for clients We make those suggestions as a result of your telling us your needs. We don´t win all the time, but we continue to try.\n\nWe sell all types of travel insurance including cover for:\n\nTravel within Australia and overseas\nAustralians already overseas\nNon-Australian residents\nCancellation Insurance\nInsurance for Students (including GAP years and Internship)\nInsurance for Aussies on working holidays overseas\nOverseas visitors on working holidays in Australia\nPre-existing medical conditions (Subject to acceptance by the underwriters)\nFrequent\/ Annual Multi Trip (for those of you that do many trips a year)\nBusiness (Multi-trip coverage) - suitable for companies with up to 9 staff travelling\nCorporate travellers annual cover (Multi-trip coverage) - suitable only to companies with 10 or more staff travelling multiple trips\nBackpackers\nSpecial Amateur Sports Travel Insurance such as Diving, Golf and Winter Sport.","id":"162612003792884"},{"name":"ITIC - International Travel and Health Insurance Conference","description":"To register for any of the ITIC events, read reviews of past conferences, or sign up for the latest updates about future events, please visit our website www.itic.co\n","id":"313645522012092"},{"name":"Canadian Travel Insurance Review","id":"190777387749991"},{"name":"Travel Insurance Australia","id":"605247126264856"},{"name":"Global Travel Insurance","id":"351643224996740"},{"name":"Easy Travel Insurance","description":"Why Easy Travel Insurance?\nEasy! You travel, you need insurance. \nEasy! You need Easy Travel Insurance.\n\nIf only all things in life were as simple as getting the right travel insurance tailored to YOUR needs at a price that really is Easy!\n\nWe all know that things don’t always go exactly to plan when you are out of your usual space, that’s why travel insurance is as important to remember as packing your toothbrush! Easy!\n\nAt Easy Travel Insurance we aim to make things easy, and to do that we have partnered with one of the worlds giants in the name of insurance and we can provide packages that dwarf comparable offers.\n\nBe careful when comparing products, that it’s not just the price that is small. \nAt Easy Travel Insurance, we pride ourselves for being the real value for money people with products competitively priced; But, we don’t scrimp on the service or more importantly the cover. Easy!\n\nwww.easytravelinsurance.com.au","id":"162164097179215"},{"name":"Viet Travel and Insurance","id":"1573007376243972"},{"name":"Questor Insurance - Stress Free Travel Insurance","description":"Totally focused on providing our customers with the best experience possible. We have an ever expaning blog zone on our website, as well as producing daily travel news; and we also have a loyal customer following sharing information through our Questor Community portal.\n\nIt is our hope that through buying from us you become more informed about products, travel news and and thereby maybe even have a more enjoyable travelling experience this time and the next.\n\nWe are a people company. We put our own people on call to deal with any queries or questions you might have; to deal with them immediately and with the best knowledge possible to ensure that all your requirements are met.","id":"145772598775977"},{"name":"Travel and Insurance","id":"612284708878543"},{"name":"Travel Secure Insurance","description":"Travel Secure Insurance is a managing general agent for IMG. We offer quality insurance products to individuals, families, students and groups living and traveling internationally.\n\nAbout IMG®\nInternational Medical Group, Inc. (IMG) truly understands the needs of international citizens. For more than 2 decades, IMG has provided medical insurance to individuals, families and groups who are living or traveling abroad. Whether you need individual coverage for a vacation or group coverage for your employees in locations around the world, IMG has a product to meet your needs. IMG's strength lies in its ability to deliver superior service to our insured members. Our staff includes international claims administrators with a wealth of experience in processing claims from throughout the world; multilingual customer service representatives to assist our members; and an on-site medical staff available 24 hours a day, seven days a week for medical emergencies. \n\n","id":"469189326453684"},{"name":"La Salle Insurance & Travel","id":"172286996194544"},{"name":"TravelAssure Philippines Insurance Agency, Inc.","description":"Member, Makati Tourism Foundation, Inc.","id":"126206174190576"},{"name":"Archangelos Travel & Insurance","description":"Travel Agents \/ Ταξιδιωτικοί Πράκτορες\n- air-sea tickets \/ εισητήρια (αεροπορικά - ατμοπλοϊκά)\n- holiday packages \/ πακέτα διακοπών\n\nInsurance Consultants \/ Ασφαλιστικοί Σύμβουλοι\n- All types of insurance plans \/ σχέδια ασφαλίσεων όλων των τύπων\n\nOther Services \/ Άλλες Υπηρεσίες\n- money transfer \/ μεταφορά χρημάτων\n- vehicle transfer \/ μετάβαση οχημάτων\n- British passport renewals \/ ανανέωση Αγγλικών διαβατηρίων\n- book keeping \/ τήρηση λογιστικών βιβλίων\n- financial advice \/ χρηματοοικονομικές συμβουλές","id":"1446125928972338"},{"name":"Freedom Travel Insurance","description":"Since starting out in 2002, Freedom Insurance Services Ltd has achieved great success and now insures 25,000+ people a year. We are recognised by over 3,000 medical charities and NHS hospitals throughout the UK. \n\nFew competitors can match our expertise and customer service when it comes to insuring pre-existing medical conditions.\n\nGetting a quote takes minutes, visit us online or if you prefer you can speak to one of our experienced and compassionate travel insurance advisers.\n\nOur call centre is open:\nMonday to Friday 8.30am - 5.30pm\nSaturday 9.00am - 5.00pm\nClosed Bank Holidays","id":"519684991426597"},{"name":"Almajd Global: Insurance & travel & tourism","id":"295112877323077"},{"name":"Travel Insurance Facilities Group","description":"A full life cycle Travel Insurance provider and UK & Irish branch of URV AG. An experienced underwriting agency transparent, mutually beneficial relationships.","id":"269421136495433"},{"name":"Explorer Travel Insurance","description":"We are based in Wescliff on Sea, Essex, and are very proud of the excellent levels of service we provide to our customers both online and by our friendly and professional sales advisors.\n\nBuy online or call our UK office FREE on 0800 043 4003.\n\nOur policies offer 3 levels of cover for customers aged up to and including 65 years, so you can easily and quickly choose and tailor your policy to meet your individual needs.  For customers either aged over 65 years or with pre-existing medical conditions, we can also help with our Platinum policy that offers with no maximum age limit.","id":"129363707133378"},{"name":"Whistler Travel Insurance","id":"841577082562490"},{"name":"Travel Insurance","description":"อุ่นใจในการเดินทางไปต่างประเทศทุกครั้ง เมื่อให้เราดูแล","id":"147731865394519"},{"name":"Discounted Travel Insurance","description":"We are here to cover you for the things that matter most.\n\nWhen you Travel, there are some events that come around unexpectedly. As the old saying goes \"it is better to plan, than plan to fail\" it just makes good sense why you would cover your next domestic or international travel.\n\nWhether you are off to a tropical holiday, cruising the high seas, jet setting to Sydney or touring around the world - there is always something to match your needs when it comes to finding the right cover that suits you.\n\nWe know Travel cover, we travel too!\n\nThrow us your questions, feedback and suggestions - we would love to hear from you.\n\nBetter yet - book your cover with us and save 35% - fab if you ask me!\n\nSigning off\n\nSafety Traveller \n\n**************\nCommunity Guidelines:\n\n1. Enjoy Travel.\n2. Be happy.\n3. Be respectful.\n4. Play fair.\n5. Inspire others to travel.\n\nAny comment, image or content which is deemed outside the above guidelines may be removed at the discretion of Discounted Travel Insurance.","id":"201237773283425"},{"name":"24\/7 travel insurance","id":"443615068991695"},{"name":"Atlantic Travel & Insurance","description":"Travel related services","id":"252601771474825"},{"name":"Travel Insurance Quote Online Malaysia","description":"ACPG Management Sdn Bhd (ACPG) is one of the largest General Insurance service provider in Malaysia. ACPG careline +603-92863323.www.acpgconsultant.com","id":"319097398205169"},{"name":"Action Insurance & Travel Services","description":"Action Insurance, Inc. & Travel Servives\n Home Owners, Auto, Flood, CAM Transfert, Recherche des Documents, Bills pay. \n 13651 West Dixie Hwy, North Miami Florira 33161. \n tel : 305\/892 4444","id":"405578636241933"},{"name":"TopDog Travel Insurance","id":"182681938449811"},{"name":"Go Cover Travel Insurance Ireland","description":"GoCover Travel Insurance offers single trip and multi trip travel and holiday insurance, ski and snowboard insurance, and long stay backpacker travel insurance for Irish residents travelling to Europe and World Wide. ","id":"256472084550830"},{"name":"I.T. - Insurance Travel","description":"Soluzioni Assicurative per il turismo","id":"234011733445613"},{"name":"TravelInsurance","id":"135000179974191"},{"name":"Travel Insurance Canada","id":"207618649437658"},{"name":"NOW Travel Insurance Services","id":"648299675284911"},{"name":"Travel-insurance","id":"808169092560785"},{"name":"Travel insurance","description":"Travel insurance","id":"150635048331003"},{"name":"Free Spirit travel insurance","id":"114209196610"},{"name":"Travel Insurance","id":"7956525422"},{"name":"Insuremore Travel Insurance","id":"1597445607189034"},{"name":"Travel Secure - International Travel & Health Insurance","description":"International Health Insurance is for US and non US Citizens traveling, working, living, studying, visiting, immigrating outside of their home country.   International health insurance plans include coverage for the US for non US citizens and permanent international major medical health insurance plans is worldwide for everyone. International health insurance is essential as typically home country coverage will not cover outside a person's home country.  ","id":"127908610643693"},{"name":"Simply Travel Insurance","description":"Simply Travel Insurance was founded by experts from the travel and accommodation industry, with a goal to make a simple, easy to understand insurance solution for the public.\nIn partnership with Allianz, one of the largest global insurers, we deliver top notch insurance at affordable prices, and we love to answer any questions.","id":"403326276388932"},{"name":"TravelInsurance.org","id":"157268784849"},{"name":"Your Travel Insurance","description":"Out of Province travel; Visitors to Canada; Super Visa; Students; Snowbirds; High risk travellers","id":"460876410669990"},{"name":"Multitrip.com.au Travel Insurance","description":"We are dedicated to providing comprehensive and low-cost travel insurance in Australia. We offer worldwide single trip, annual multi-trip and backpacker holiday travel insurance. We also have different travel insurance plans to suit different budgets and trips abroad. No matter where you’re travelling to, we have the right choice of travel insurance cover for you.","id":"710770978944395"},{"name":"Travel Insurance Facts","id":"110214818994369"},{"name":"Smarter Travel Insurance","id":"775446272548392"},{"name":"DiveAssure Thailand Dive-Travel Insurance","description":"The DiveAssure Association provides its members with an array of the most comprehensive and competitively-priced diving accident and travel insurance plans available. Based on over a decade of service dedicated exclusively to divers and with the expertise gained through the service of hundreds of thousands of divers, we offer great membership benefits and insurance programs.","id":"682055085204715"},{"name":"Quick Tours UAE","description":"Quick Tours is a leading company in travel agency it's an Egyptian tourism company in Dubai,it supports Dubai visa with less cost,Hotel Reservation inside and outside UAE and exciting tours.our costumers must need the best service in tourism and tours we provide that ,,,our tours is very organized and our costumers enjoyed these comfort and organized tours\nwe support package for vacation starts from 295$\nAccording to the Terms and Conditions\nTime and hotel matters\n","id":"465364303561482"},{"name":"Allianz Global Assistance in Italia","description":"Assicurazione viaggi –  Vacanza, studio, lavoro, weekend … gira il mondo sicuro con le polizze Viaggio Allianz Global Assistance più adatte alle tue esigenze http:\/\/www.allianz-assistance.it\/assicurazione-viaggi.asp\n\nAssicurazione veicolo - Soccorso stradale in Italia e in Europa, veicolo sostitutivo, disbrigo pratiche per furto. Assistenza stradale auto e moto per ogni evenienza http:\/\/www.allianz-assistance.it\/soccorso-stradale.asp\n\nAssicurazione abitazione – Affronta gli imprevisti della vita quotidiana e migliora il comfort della tua abitazione con Home Assist http:\/\/www.allianz-assistance.it\/polizze-assicurative\/assicurazione-abitazione\/homeassist\n\nAssicurazione cellulare – Proteggi il tuo cellulare da furto, rapina, danno accidentale o utilizzo fraudolento della carta SIM con Safe Mobile http:\/\/www.allianz-assistance.it\/polizze-assicurative\/assicurazione-cellulare\/safemobile\n","id":"177800926405"},{"name":"Missionary Travel","description":"We provide missionary travel insurance and informative tools for safe travel. ","id":"143434505685836"},{"name":"Australia GO","description":"MIGRATION\/TRAVEL\/STUDY\n(MARN) 1465798 \nQEAC No: F079\nStudying in Australia, Living in Australia, education, success and leisure","id":"122958247733966"},{"name":"UNIK Travel","description":"Agjensi Turistike. Bileta avioni, trageti, autobuzi. Siguracione: Prone; Shendeti; Automjetesh. Makina me Qera, ABCOM,  PLUS MOBILE. \nCel. +355663353530\nE-mail : uniktravel@yahoo.com\nSHESHI DEMOKRACIA (ISH 5 HERONJTE)\nRruga : Qemal Dracini\nShkodër, Albania","id":"119672448363795"},{"name":"Discovery Info Travel Centar","id":"1537338743202189"},{"name":"Compass Travel Insurance","description":"With an office in Auckland Compass Travel Insurance Limited is a local company dedicated to providing New Zealanders with affordable options for online travel insurance. Get a quote from here- www.CompassTravelInsurance.co.nz.\n\nCompass Travel Insurance is underwritten by ACE Insurance Limited (ACE) Company No. 104556, FSP No. 35924, and the employees of Compass Travel Insurance Pty Limited (Compass) ACN 162 332 827 arrange this insurance as nominated representatives of ACE.\n\nACE is part of the ACE Group of Companies, one of the global leaders in insurance and reinsurance serving a diverse group of clients. Headed by ACE Limited, the ACE Group conducts its business on a worldwide basis with operating subsidiaries in more than 50 countries and the authority to do business in 140 jurisdictions. With exceptional underwriting and claims teams, ACE is committed to excellence, integrity and to providing quality service and insurance products.\n\nAddress\n-------\nCompass Travel Insurance Limited\nLevel 27, PWC Tower\n188 Quay Street\nAuckland 1010\n\nBusiness Hours\n-------------\nMon-Fri 10:30 AM - 7:00 PM (NZST)\n\nTalk to Us\n---------\nFrom within New Zealand: 0800 330 088\nFor Claims Assistance: +649 374 1775\nFor extending your policy: +612 9269 9187\n\nEmail us info@compasstravelinsurance.co.nz","id":"172059126321141"},{"name":"Falcon Turisticka Agencija","id":"1499750500292915"},{"name":"Health & Travel Insurance Brokers","description":"We are niche independent insurance brokers specializing in travel and expatriate insurance, including cover for visitors, students and work visa holders coming to NZ or Australia; and outward travel insurance including cover for many high risk activities.","id":"135797593224762"},{"name":"Exclusive Trade\" Travel Agency, Insurance Agent","id":"117594755239401"},{"name":"Azimuth Risk Solutions","description":"https:\/\/plus.google.com\/b\/117297111517498154763\n\nhttp:\/\/www.linkedin.com\/company\/2729578\n\nTwitter: @AzimuthRisk\n\nAzimuth Blog:  http:\/\/azimuthrisk.blogspot.com\/\n\nFoursquare: https:\/\/foursquare.com\/azimuthrisk","id":"110165225698112"},{"name":"Over 60 Travel Insurance","description":"OverSixty Insurance Pty Ltd ABN 26 169 088 662 AR 466616 is an authorised representative of AGA Assistance Australia Pty Ltd ABN 52 097 227 177 AFSL 245631 trading as Allianz Global Assistance. Travel Insurance is underwritten by Allianz Australia Insurance Limited ABN 15 000 122 850 AFSL 234708 and issued and managed by Allianz Global Assistance. Terms, conditions, limits and exclusions apply. Before making a decision please consider the Product Disclosure Statement (https:\/\/elevate.agatravelinsurance.com.au\/oversixty\/File\/Download?docType=PDS) If you purchase a policy, we receive a commission which is a percentage of your premium - ask us for more details.","id":"324479367759281"},{"name":"TIC Travel Insurance","id":"310157906688"},{"name":"Donegan Insurance and Travel","description":"I have my Life and Health Insurance License and I also have a wealth of travel books for the United States and Canada.","id":"384632888241092"},{"name":"Travel Insure","id":"1036158876410501"},{"name":"GMS Travel Insurance","description":"GMS TravelStar® travel insurance provides coverage designed to protect your financial ability to travel. You won’t get stuck at home paying the high cost of travel gone wrong. Emergency Medical coverage, Trip Cancellation & Interruption coverage as well as Baggage Loss, Damage & Delay coverage—all at affordable rates.\nCheck out  www.tripsafe.ca  coverage and options below. Get your coverage details and pricing quickly. And buy when you’re ready using our easy 4 step process.","id":"1486722688243623"},{"name":"Travel Insurance HAITI","id":"562832023852029"},{"name":"HotWinters.ca Travel Medical Insurance","description":"We specialize in medically underwritten plans for those with complicated medical histories.\n\nA travel agency specializing in ocean and river cruises using travel providers suitable for middle-aged and older clients.\n\nOperating as: HotWinters.ca Travel Medical Insurance in Manitoba & Ontario, HotWinters.ca Travel Medical Insurance Brokers in British Columbia and HotWinters Travel Medical Insurance in Saskatchewan.","id":"218638808165625"},{"name":"Jetklik Travel Insurance","description":"Jetklik Travel Insurance is powered by Kayser Baird Insurance Brokers - a leading South African short term insurance provider and 8 times recipient of the prestigious Santam Broker of the Year Award. klik is the first independent provider of travel insurance in South Africa that offers a comparitive web based service to help you choose your travel insurance, as well as expert advice to ensure that the cover you choose is right for you!","id":"189305741249749"},{"name":"Travel Insurance Office Inc.","id":"807780292573873"},{"name":"Insurance & Travel","id":"583896998415678"},{"name":"Travel Insurance Quotes Canada","description":"TravelInsuranceQuotes.ca, operated by OIQ Insurance Solutions Inc., is Canada's Number 1 online travel insurance website. TravelInsuranceQuotes.ca is the leading Canadian travel insurance website offering our users the ability to compare coverage between leading travel and health insurance companies. TIQ's Travel Insurance Quote and Purchase system allows users to immediately get compare cost and coverage from leading Canadian and International travel insurance companies.\n\nOnline, real-time quotes are available for Canadian comprehensive travel insurance, emergency medical insurance, trip cancellation insurance, Canadian Expatriate health insurance, Visitors to Canada (travelers, foreign workers, and immigrants) emergency medical insurance, and international student health insurance.","id":"100722595540"},{"name":"Ayr Travel Insurance","id":"252182258260"},{"name":"Travel Insurance Compare","description":"Compare more than 400 policies from leading Travel Insurance providers.","id":"255039611274071"},{"name":"Columbus Direct Travel Insurance Australia & NZ","description":"Columbus Direct was one of the first companies to sell travel insurance direct to UK residents back in 1988. In 2001 we brought this winning formula to Australia with the opening of our offices in Sydney and have since expanded our services to cover New Zealand residents also.","id":"786502251423180"},{"name":"Philadelphia Travel, Real Estate, Insurance, Sports Agency","id":"1588072461440538"},{"name":"Work and Travel Insurance Services","description":"We provide insurance to student studying in the USA as an Au Pair, Intern, Trainee, Fellow, under the Work and Travel program, and those who travel around the world on Gap Years, Working Holiday programs, Language programs and much more.","id":"156966091020745"},{"name":"CareMed Travel Insurance","description":"For more than 25 years, international students, au pairs, internship and work & travel participants, tourists, guest scientists and high school students have relied on our insurance when looking for long-term protection abroad. \n\nWe offer travel health insurance as well as accident & third party liability insurance at a reasonable price. Policies are adapted to the needs of young travelers worldwide.\n\nEnjoy your stay abroad\n... we care 4 you!\n\n","id":"207652149271819"},{"name":"Travel Insurance Review","id":"129351943797327"},{"name":"BeSure Travel Insurance","description":"BeSure Travel Insurance is designed to help you travel where you want, when you want. Other travel insurers may decline cover based on medical conditions and age but that’s not our style! We aim to provide cover for all ages and all types of medical conditions, including Cancer, Heart Conditions, Diabetes, Stroke, Epilepsy and Mental Health Conditions. Whether you’re looking for a single trip or annual multi-trip policy, look no further than BeSure Travel Insurance.\n\nGetting a quote takes minutes with our instant Quote and Buy system – it’s quick, simple and totally confidential.\n\nBeSure can insure your travelling companions too, whether they have medical conditions or not. Being insured on the same specialist BeSure Travel Insurance policy has many advantages and can protect accompanying friends and family against unforeseen costs resulting from your existing medical conditions, such as cancellation or curtailment of a holiday. Best of all, our prices are fair and competitive for everyone.\n\nOur Standard, Premier and Premier Plus travel insurance packages offer a choice of cover limits, so you only have to pay out for the cover you really need. All you have to do is select the one that best suits you and your holiday plans.","id":"1436726919919711"},{"name":"Schengen Visa Travel Insurance","id":"627554007318333"},{"name":"Best Jersey Insurance & Travel LLC.","id":"411294735684329"},{"name":"Travel Insurance Spotter","description":"We found the product extremely competitive, with wide cover options, very easy to obtain quotes, and you can buy online. http:\/\/bit.ly\/RZMA3q","id":"403974036281176"},{"name":"Freedom Insurance & Travel","id":"252915001389017"},{"name":"Travel and Insurance","id":"455020294660377"},{"name":"Jersey Travel Center & Insurance Inc.","description":"We do not work for an insurance company; we work for you!  We work on your side when you have a loss and follow through to see that you get fair, prompt and service.","id":"182749081750116"},{"name":"Workers travel Insurance","id":"1468542050042301"},{"name":"Z Travel and Insurance Services","description":"We Also Have Two Other Locations Located At:\n\n16852 Merrill Ave.\nFontana, CA 92335 \n(909)428-5216\nFax: (909)428-5218\n\n\n9410 Magnolia Ave. \nRiverside, CA 92503\n(951)354-0401\nFax:(951)588-5899","id":"135683526590697"},{"name":"Pal Vision Travel Insurance","description":"Travel Assist offers insurance plans designed to cover travelers worldwide. Plans can include valuable medical coverage, trip interruption, emergency travel services and more. \nFor more information, call Philo at 012 3112404, or, Palani at 012 3063994.","id":"301979896558737"},{"name":"Travel Insurance and Medical Schemes","id":"400533593433233"},{"name":"Travel Insurance.","id":"176875142410955"},{"name":"Travel Insurance Office Inc\"","id":"674480735976414"},{"name":"Get Going Travel Insurance","id":"828009323885997"},{"name":"Travel Insurance by One Source Benefits","description":"Welcome to the Travel Insurance page of One Source Benefits.\n\nWe work with the leading providers in the Travel Insurance Industry to make sure you get the best rates. International Medical Group (IMG) is our leading provider serving you with 20 years of experience and excellent customer service. \n\nContact us today to talk to one of our agents about buying Travel Insurance: (877) 549-1212.","id":"270032883050769"},{"name":"Web International Travel Insurance","description":"Specializing in Health & Life domestic and International Travel Insurance","id":"308193342572253"},{"name":"Red Sky Travel Insurance","description":"As the most knowledgeable and experienced vacation rental travel insurance company in America, Red Sky is a vacation rental manager's trusted partner and a guest's reliable resource.  Providing coverage exclusively to the vacation rental industry in coastal, lake, ski and mountain destinations, we work closely with vacation rental management companies.  Red Sky brings unmatched expertise to help you meet both your guests' needs and your own profit goals through our comprehensive travel insurance products, Sun Trip Preserver and Ski Trip Preserver.\n\nhttp:\/\/trippreserver.com\/","id":"306227882769852"},{"name":"AAA Travel Insurance","id":"709152549230641"},{"name":"Pacific Travel * Income Tax * Insurance","description":"HABLAMOS EN ESPANOL!!!\nOfrecemos Servicos en Viajes y Pacquetes de Vaccaciones, Impuestos del ano y Seguranza de Auto.\n\nWe offer service in Travel, Income Tax and Auto Insurance... \n\nNeed to e-file? Think you didn't get your full tax refund you are in-titled to? Does your preparer rush through your taxes without explaining it right? Need to file older tax years? Don't have a valid Social Security Number? Are you self employed and don't know what you are required to do? Here at Pacific Travel we can help you having 15 years of experience in the field. We offer 2nd look on any current or prior year \"FREE\", where we will look for errors and check you got the right refund. We also offer \"FREE\" estimates without any obligation at all to file with us. We are a authorized e-file office by the IRS and are certified by the Franchise Tax Board as CTEC preparers. We explain in full detail what taxes one pays based on there income and what credits they qualify and don't qualify for. We offer tax service all year round and we stand behind our work. If we are required to assist you in anything regarding your taxes we do not charge at all. If you have IRS or FTB audit problems and your preparer can't help or is not around come to us. Here we will help you resolve any matter possible in hopes to make you our future customer. Now for those who do not have a valid Social, we here at Pacific Travel will help you apply for a ITIN for you as well as any other family member requiring one. Now in regards to fee; we do not have a set fee like many offices for we charge on a form bases. We do not believe that everyone is the same nor files the same so why should they pay the same.\n\nTravel and Vacation Package... Need to fly? Do you need help planning the next Family Trip, your Anniversary, Your Honeymoon? Here at Pacific Travel we can help you plan that ideal trip you want. A trip that can include it all from flight, hotel, car rental, tours and much more. Or just the flight for those flying back home to see friends and family. Here at Pacific Travel we pride our self on customer satisfaction and will gladly got the extra mile to get what you want. If you already have a quote from another place; get us the info and we will gladly try and meet or beat the price you where offered. Now for those who are minors traveling without both or one of their parents out of the country; we offer \"FREE\" travel permits with the purchase of a flight.\n\nInsurance... Need any type of Insurance? Tired of paying a broker fee or fee for making your payment? Tired of watching your Insurance go up? Have a DUI? Don't have a valid Driver License? Here at Pacific Travel we can help you get Auto, Commercial, Home and many other types of Insurances now being required or recommended. We work with many different Insurance companies, which make it possible for us to offer you the lowest rate. Now many of our companies are now including Drivers Club with your monthly Insurance practically FREE. The Drivers Club is like AAA with service the 24 hours to the car being Insured. Now if you don't have a license, it is okay we can Insure unlicensed Drivers. If you have a DUI we can all help you process your SR22 as required for you to have. We do not charge a broker fee nor do we charge you to make your monthly payment. A real Insurance broker not just a agent gets paid by the Insurance company. So if you have a real broker getting paid for you being there customer, than why should you have to pay them more? Remember without you making your payment they don't make money. \n\nOther services... Here at Pacific Travel we also help in filling out all types of forms online or on paper. We also help in Translating documents from Spanish to English either verbally or in writing. We also send Email's and\/or Fax's either domestic and\/or even internationally at a low fee. If you need to make copies we can aslo help you. We are here to help our community in every way possible.\n\nWe count on and work with many other business in different services so we can help you in anything from Immigration Consultant (we can recommend a good Attorney), Accounting (we can help you stay on track with your small business), Payroll (have someone else make your check and file your reports to the Government),Notary Public, Real Estate and Loan Processor (need to Sell, Short-sale, Buy or even Modify a home),  Paralegal (Divorces, Child Support, Starting eviction or stopping a Wrongful eviction), Marriages and much more.\n\nCome visit us today and let us know what we can help you with. Remember if we can't do it we will help you find someone who can for free.\"","id":"314121398631443"},{"name":"Snowboomer Travel Insurance","id":"564384737003663"},{"name":"Cover-More Travel Insurance UK","description":"Cover-More provides top quality travel insurance cover to customers in the UK, Australia, Malaysia and New Zealand. We have over 25 years of experience in travel insurance and over 14 million satisfied policy holders to date. \n\nWe provide all customers with a 24 hour emergency assistance service so you know we’ll be there when you need us most. Our policies also come with a great range of benefits including luggage cover and overseas medical and dental cover.\n","id":"254887007948364"},{"name":"Have Insurance Will Travel.com","description":"HEALTH INSURANCE \/ INDEPENDANT AGENT\nDENTAL\nVISION\nSUPPLEMENTAL\nMEDICARE\nSERVING LOUISIANA,MISSISSIPPI,TEXAS,CALIFORNIA","id":"1582423728689224"},{"name":"NZ Travel Insurance","id":"751315654907010"},{"name":"Travel Insurance Reviews","id":"180519518816658"},{"name":"Travel Protect International - The Travel Insurance Professionals","id":"346594416660"},{"name":"Jet Travel Insurance","id":"284218944923943"},{"name":"Online Travel Insurance","description":"Visit our page https:\/\/segurodeviajeshro.wordpress.com, where you can see our excellent online Travel Insurance:\n•\tLong Stay Plans \/ International Students \n•\tPlans per Trip \/ Individual or Familiar \n•\tAnnual Plans \/ Multi-Travel\n•\tCruise Plans\n","id":"864663130266851"},{"name":"Kim Soda -  Insurance Agent & Travel Advisor","description":"I am pleased to offer my services to you as a travel advisor and an insurance agent. \n\nAs a travel advisor, I can help you plan a vacation within your budget to ensure that you have an amazing trip with your friends and family! From trips to Disneyland, Disneyworld, Cruises, Destination Vacations, airplane tickets, hotels and more! Allow me to take care of all the planning headaches that occur before the trip and during the trip, so that you can kick back and relax on your vacation the way you deserve to! With insider knowledge, vendor relationships and VIP service - I will make sure that you get the best value and the best service!\n\nAs an insurance agent, I help families reach their financial goals for retirement, annuities,  education savings, life insurance and more! Allow me to help your family prepare for the brightest future possible!","id":"354572574673116"},{"name":"Get Sure Travel Insurance","id":"340205436160472"},{"name":"Travel Insurance \/ Assurance voyage","description":"                     GET COVERAGE NOW!  INSTANT QUOTE! \n\n      Online www.optimalTRAVEL.ca  or by phone: (888) 450-4950\n\nLooking for a quick and easy way to purchase Travel Insurance Online?\n- One simple step, you can compare online quotes for our various plans and then purchase the best coverage for your needs:\n                                                   \nAuthorized Agent for:  Blue Cross Travel, Manulife, TIC, TourMed, GMS, etc.\n\nTRAVEL Insurance:  Let us shop and Get you the best protection!\n\nWe will do the shopping for you, from trusted Insurance Companies.\nLooking for the best options and the best products to fit your budget, we can help!  \n\nIndependent Advise, We work for you!\n\n**You have pre-existing conditions we can help\n--\nVous recherchez la meilleur protection...! Vous vous demandez quelle compagnie répondra le mieux à vos besoins! Demander à Dianne, avec plus de 20 ans d'expérience avec l'assurance-voyage, elle sera vous aider!","id":"285533364882027"},{"name":"Bhola Ramsundar Travel & Insurance Agency","id":"429258733784218"},{"name":"My Travel Insurance Centres","id":"774009006004668"},{"name":"Travel Insurance Comparison","description":"Whether you’re  taking a trip within Australia or abroad, and for business or for pleasure, Travel Insurance Comparison gives you the low down on all things relevant to Australian Travel Insurance. No matter if you’re looking for a quick rundown of what’s out there or you have a specific policy in mind, we’ll help you find the policy that best suits your needs. Our objective is to provide you with the tools and knowledge you’ll need to thoroughly and decisively compare travel insurance policies, whilst also giving you a rundown of other important stuff like excess, premiums, health and extra cover, and much more!","id":"146568062088337"},{"name":"Alanano Insurance & Travel Tours Agent","id":"456879057677909"},{"name":"Sil Insurance & Lore Travel","id":"931879150177978"},{"name":"Financial Services_Insurance_Travel Deals #Hodomania","id":"527406200643888"},{"name":"Travel Insurance With SPI","id":"1584222051840314"},{"name":"Alanano Insurance & Travel Tours Agent","id":"339013679520266"},{"name":"Travel, Health, and Life Insurance","id":"638171072983156"},{"name":"Amigo.az - online travel insurance","description":"Amigo.az onlayn səfər sığortası xidmətidir. Artıq evinizi və ya ofisinizi tərk etmədən səfər sığortası şəhadətnaməsini əldə edə bilərsiniz. Vaxtınıza qənaət edin, istənilən vaxt və istənilən yerdən sığortalanmaq imkanına malik olun. ","id":"465339213558404"},{"name":"Paradise Travel Insurance","description":"Ever planned a trip and for some unknown reason was not able to go?  Travel Insurance protects you against any unexpected medical condition, death in the family, job loss, etc and reimburses you for all travel expenses.  Travel Insurance also provides Medical insurance in case of an injury or illness during your vacation. \n\n\nPlease contact me for a free quote! \n\n\nFeel free to call or message me for additional information!\n\n\n\n","id":"194870523951656"},{"name":"UniGlobe travel and insurance agency","id":"1045174675508032"},{"name":"Travel Insurance ประกันเดินทางต่างประเทศ","description":"บริการออกกรมธรรม์ประกันเดินทางในประเทศ ต่างประเทศ ศึกษาต่อต่างประเทศ ภายใต้แบรนด์ชาร์ทิส (Chartis) โดยบริษัทนิวแฮมเชอร์ อินชัวรันส์ (New Hamshire Insurance) ออกกรมธรรม์ออนไลน์ ลูกค้ารับกรมธรรมผ่านอีเมล์ ในอึดใจ","id":"374897562568206"},{"name":"TID - Travel Insurance Direct","id":"504134533072742"},{"name":"The Travel Insurance Experts","description":" Short Term Travel Insurance\n Long Term Travel Insurance\n Group Travel Coverage\n International Travel & Medical Plans\n Trip Cancellation Coverage\n Church Mission Travel Coverage\n Missionary Specific Coverage\n Life, Dental, Disability, Kidnap & Ransom","id":"123762381004125"},{"name":"TripWise Travel Insurance Inc.","id":"128460100519746"},{"name":"Akshat Travel & Insurance Services","id":"256145264415439"},{"name":"HealthSmartVaccines & Travel Insurance","description":"Since 1992 our parent company, American Pediatric Consultants, has been the leading provider of home care services for pediatric patients in Northern Virginia. In 1998 we initiated workplace clinics for seasonal flu for area employers. The popularity of our corporate flu clinics and the growing awareness of the importance of vaccines for adults gave birth to HealthSmartVaccines in 2006. HealthSmartVaccines offers all approved vaccines for adults age 18 and older. The services are provided at our clinic in Chantilly, VA and to corporate clients at their place of business. International travelers receive consultation on the vaccines recommended or required for their destination countries as well as a World Cue® report on other health related issues.","id":"244606828912582"},{"name":"Travel Insurance HK 香港旅遊保險","id":"347815362013268"},{"name":"Safety First Travel Insurance","description":"Safety First Travel Insurance provides peace of mind with value priced travel insurance and 24-hour emergency assistance services for all travelers. Includes coverage for Trip Cancellation and Weather Delay, Medical Emergencies, Baggage Loss and Delay and Rental Car Damage. We offer trip insurance for cruises, students, groups and business travelers.\n\nWe are there when you need us and that's what makes Safety First better, customer service, and helping you get only the coverage you need and want in the first place.","id":"174453072610893"},{"name":"Flo Travel & Insurance","id":"1579029729043831"},{"name":"Business Travel Insurance Malaysia","description":"ACP Group (ACPG) - COMPANY PROFILE\n\nACP Group (ACPG) is a locally owned company established in Year 1989. It was incorporated to trade in the business of insurance, such as: property, casualty, general, commercial, life and health. It started with four employees, including the husband and wife team of Anthony Chin and Anna Sim With the perseverance and hard work of the couple and their trusted and loyal employees, the company grew to a multi million-dollar operation within a short period. \n\n\nToday, ACPG currently employs over 12 staff servicing thousands of customers in Kuala Lumpur. For the last 22 years, ACPG is a full-line agency, offering general, commercial, Business, life, non-life and health insurance products. It has become a one-stop-shop for corporate and individual clients' insurance needs. It markets property and liability insurance, surety and bonding, fidelity and crime, Professional Liability Insurance, Condominium Insurance, Special Events, Contractors All Risks, marine, life and health insurance. \n\nThe company is organized to maximize the potential of its employees and to continuously deliver professional service to its clientele. The company's management philosophy is to provide the necessary training and development courses to its employees to ensure that they are abreast of developments in risk management, insurance coverage and claims procedures.\n\nThe goals of the company are to: deliver value-added professional service to all its customers; create comprehensive and quality insurance products and services with competitive terms; uphold its reputation for integrity and innovation; enhance the professional and personal growth of its employees to empower them to do their personal best; and maintain a profitable business for the benefit of its insured’s, principals, employees and shareholders.\n\nACPG MISSION \n\nTo help the community we serve to better manage the risks of daily life by providing insurance products at fair prices; settling claims fairly and expeditiously; and delivering value-added service to our customers.\n• Commitment to our Clients\nWe listen to our clients in order to understand their needs. In turn, we offer the industry’s most innovative products, including many specialty classes of business.\n• Efficient Claims Services\nWe are committed to providing our customers with efficient and responsive claims management services. Through our prominent claim handling, we are able to act swiftly and efficiently, minimizing disruption and inconvenience to your business.\n\nACPG VISION\n\nOur vision for the future is to be the preferred provider of insurance products and services in Malaysia and continue to be one of the industry leaders in the region.\n\nTo deliver quality and affordable Insurance services and Training Program, ACPG possess the 22 years experienced professional team members, in which the team members have been in the industry since 1989.\n\nACPG is looking for a long-term business relationship with General Insurance & Business Insurance Company in all classes of General & Business Insurance Services.\n\nACPG Founder & Chief Executive Officer (CEO), Mr. Anthony Chin is a Member of Million Dollar Round Table MDRT (USA) qualifier and has had more than 22 years experiences ( since 1989 ) in the Insurance business.\n\n \nMr Anthony Chin become the youngest Senior Manager of Agency for the Insurance Company. His 18 years agency management experience was gained from providing training general & Business insurances, healthcare management and training services. He has had 18 years experience in managing his own management and training company. \n\nMr. Anthony Chin outstanding leadership and management forte gained him an interview by an magazine and new paper from year 1995 until 2010 as a \"Super Insurance Salesman”, the \"Best Insurance Manager” and as a \"Best Management Company” in the Business World Magazine and Corporate Journey Magazine as the cover story in its July 2001 and October 2008 edition. He is capable in motivating and leading the company to achieve sales they never thought was possible.\n\nACP Group of companies\n1) ACPG MANAGEMENT SDN BHD\n2) ACP LOYALTY ADVANCE\n3) ACP ADVANCE RESOURCES\n4) ACPG MANAGEMENT & TRAINING\n5) WALK IN ONLINE (M) SDN BHD\n6) MONT GENIUS SDN BHD\n7) AMG ADVANCE ASSET (M) SDN BHD\n8) MSP ADVANCE (M) SDN BHD\n9) HYUNDAI WELLNESS SDN BHD\n\nOFFICE LOCATED AT\n158-3-7, BLOK 158, 3RD FLOOR, KOMPLEKS MALURI,\nJALAN JEJAKA, TAMAN MALURI, CHERAS,\n55100 KUALA LUMPUR, MALAYSIA.\n\nOFFICE CONTACT \n+603-9286 3323\n\nFAX NUMBER\n+603-9282 3232\n\nEMAIL ADDRESS\nenquiry@acpgconsultant.com\ncorporate@walkinonline.com\nenquiry@walkinonline.com\nanna@walkinonline.com\nanthony@walkinonline.com\n\n\nHOMEPAGE\nwww.acpgconsultant.com\nwww.walkinonline.com\/store\/ACPG.php\n\nFacebook \nwww.facebook.com\/acpg.management\n","id":"259393810747078"},{"name":"Expat-Health.com - International Health and Travel Insurance","description":"Expat-Health.com offers Travel Insurance, Short-Term and Long-Term International Health Insurance. Expat Health Insurance, Worldwide Health Insurance, Group Worldwide Insurance, Private Health Insurance, Student Travel Insurance, Travel medical insurance, Travel health insurance, Medical travel insurance, Traveler health insurance, Schengen visa insurance, Travel accident insurance, Overseas travel insurance, World travel insurance, and Foreign travel medical insurance..\n\nInternational Travel Health Insurance for the Expatriate\nhttp:\/\/www.Expat-Health.com is dedicated to bringing you the finest of Worldwide Health Insurance for your expat assignment!!\n\n\nWhile on assignment it is important that an expatriate is prepared for the unexpected, especially as it concerns your health. Expat-Health has thoroughly researched international health insurance plans and has found that the International Medical Group® (IMG) plan best meets the needs of expatriates of all nationalities for their Travel Insurance and Travel Medical Insurance.\n\nWhat you Need While Overseas\n\nWhile living overseas there are several features that you should have in your international health insurance plan. First, is that you should have a fully comprehensive health insurance coverage. It is no sense having to cut short your assignment due to lack of adequate cover. Expat health insurance is extremely necessary to help cover you and your family from unnecessary risks!\n\nAll expatriates should have medical evacuation. As an expatriate, you will probably find yourself traveling more and more to exotic places. If an emergency happens, you will need to get to first rate care quickly.\n\nFor U.S. and Canadian citizens it is important to have access to medical care in your home country. We have found a plan that offers private health insurance at first-rate medical care facilities in North America.\n\nDirect billing and prompt claims reimbursement is extremely important. Taking a lot of strain out of claims filing is the ability to pay claims directly to the provider.\nAs an expatriate you need to have the choice of where you want to receive medical care. The plans we feature provide you with complete choice of medical providers.\n\nAnd finally, if you plan to travel outside of your own country, be careful because most medical plans stop as you cross the border. Protect yourself and your loved ones from a possible disastrous vacation by applying for temporary travel insurance online that covers everything from Emergency Evacuation to Lost Luggage. Travel insurance is very inexpensive and can literally be a life saver! Apply for travel insurance online right now with Expat-Health.com.\n\nPlease let Expat-Health.com be your resource for Worldwide Health Insurance, Expat Insurance, International Health Insurance, Private Health Insurance and Travel Insurance Online.\n\nHere are some other websites that I am affiliated with:\n\nwww.123-investing.com\nwww.expat-health.com\nwww.expat-health.org\nwww.expat-health.net\nwww.expat-health.biz\nwww.expat-health.info\nwww.facebook.com\/expathealthinsurance\nhttp:\/\/www.linkedin.com\/in\/mikemandarino\nCheck us out on the Google Play Store:\nhttps:\/\/play.google.com\/store\/apps\/details?id=com.conduit.app_9825efdd5bd246889c7b3d2732920a8c.app","id":"169170793116493"},{"name":"Aldanube Services & Tourism Investment","description":"www.aldanubeservices.com\n\nTravel where you should\n\nشركة الدانوب للخدمات والاستثمار السياحى شركة لليبية مسجلة رسميا ضمن سجل الشركات التجاريه بدولة لبييا, وتعمل الشركه في مجال تقديم الخدمات السياحية والإستشارات العامة حسب ماهو محدد لها من الجهات الرسميه والقانونيه بدولة ليبيا. \n\nرؤيتنا :  أن نصبح شركة الدانوب للخدمات والاستثمار السياحى الرائدة والخيار ألاول والمفضل للجميع فى دولة ليبيا","id":"871658906193126"},{"name":"Shalom - Online Ticketing\/Loading\/Travel and tours\/Remittance\/Insurance","id":"324762671016025"},{"name":"Steven Goss Wheels & Tires, Travel, Insurance","description":"OEM Dealership take off wheels, tires, grills and Chevy OEM Headlights for body shops, auto dealers and individual sales.\n\nWorksite Benefits and Life Insurance.\n\nTravel Agency \/Travel Coach operations focuses on specialty trips such as anniversaries to Europe, Dental Tourism and Medical Tourism to Mexico and Costa Rica.  Anniversary trips, bachelor and bachelorette parties.\n\n","id":"151007821607512"},{"name":"Universal travel&insurance service","id":"1425577794360416"},{"name":"Lupita's Travel, Insurance & Income Tax","id":"1413721185593141"},{"name":"Barry Travel & Insurance","id":"106992502978773"},{"name":"Letty's Travel & Insurance","id":"106045826407620"},{"name":"Love Insurance & Travel","id":"129520000716153"},{"name":"Padin Travel & Insurance Agency","id":"365903690287051"},{"name":"Go Walkabout","description":"Go Walkabout Travel insurance offers a range of single trip policies, as well as an annual multi trip policy. \nWe can also cover travellers aged up to 85 years old and is usually able to cover pre-existing medical conditions.\nWe also offer specialist emigration cover to anywhere in the world, with cover lasting up to 90 days from leaving the UK.\nWe offer a Working Holiday policy that can offer cover for a trip lasting up to 2 years away from the UK. \nWe pride ourselves on our personal and professional service, and are here to help. Contact us today to discuss your requirements","id":"468322499864911"},{"name":"The City Of Adjumani Airport","id":"527033283999125"},{"name":"Travel insurance","id":"659582200782439"},{"name":"Gay Travel Insurance","id":"121959629930"},{"name":"Travel Insurance","id":"592228697581270"},{"name":"insurefor.com | Cheap Travel Insurance","description":"And thanks to our new and exclusive gadget travel insurance, we can now provide cover for all those valuable things you like to take away with you, too. From mobile phones to mp3 players, games consoles for the kids to laptops and portable DVD players, you’d be surprised how the things we simply can’t live without these days soon add up.\n\nWhat have insurefor.com got covered?\n\nFamily holiday insurance\nAnnual travel insurance\nSingle trip travel insurance\nGadget Travel Insurance\nCruise travel insurance\nSports travel insurance\nWinter sports travel insurance\nBackpacker travel insurance\nOver 65 travel insurance\nGolf travel insurance\n\nInsurance is one of those things that no-one really wants to spend their money on as well as hoping that they will never need to use. However, by taking out a policy with insurefor.com it is possible to get cheap travel insurance which doesn't break the bank whilst offering comprehensive levels of cover.\n\nTravelling with little ones in tow means that any problems need to be dealt with swiftly and with the minimum of fuss. This is where family travel insurance steps in. With the insurefor.com policy children are included free of charge whilst cover extends to age 74 for single trip policies and 64 for annual multi-trip policies!\n\nWe understand that if there are any problems on a family trip, it can be a very anxious time, which is why there is a 24 hour medical emergency helpline automatically included in every family travel insurance package. All claims are dealt with by experienced individuals who will ensure that every case is dealt with rapidly so that even if there is a problem, the holiday is not ruined by worry.\n\nAs well as offering cover for families, insurefor.com provides a range of other cheap travel insurance for every kind of break imaginable, from backpackers to business travellers and sun worshippers to sports enthusiasts. Each policy can be tailored to add extras, such as winter sports insurance, which means that you don't pay for unnecessary cover if you don't need it, which helps to keep the costs down.\n\nFor those individuals whose preferred travelling companion is their iPad or laptop, insurefor.com also provides a specific policy to ensure a favourite gadget is also looked after whilst away from home.\n\nAt insurefor.com we understand that insurance is not something you want to have to spend a long time thinking about so we make it as easy for you as possible whilst driving costs down, the perfect combination to provide true peace of mind for a memorable holiday.\n\nWe pride ourselves on being more than just another faceless dot com insurance company. Our UK call centre is manned by friendly, knowledgeable advisors ready to answer any queries you might have, or help you to buy your insurance over the phone rather than online. Just call 0844 482 0662 and check out our service for yourself!\n\nWe also provide a 24-hour emergency assistance helpline and cover up to the age of 74.\n\nIt’s all part of the service with insurefor.com.","id":"179608365452448"},{"name":"PrimeLink Travel Insurance","id":"153759574660015"},{"name":"International Travel Insurance","id":"157091644383697"},{"name":"Travel-insurance-india and Travel Insurance policies","description":"Travel-insurance-india and Travel Insurance policies is very much required for traveling for secure your him self and your vehicle.\nhttp:\/\/www.india-insurance.com\/travel-insurance-india.html","id":"144984562213586"},{"name":"Go Travel Insurance","id":"15025578956"},{"name":"Fogg Travel Insurance Services Ltd","description":"We are experts in arranging holiday insurance for residents of the UK - business trips - lying on the beach - adventure holidays - sports or sightseeing holidays – or, of course, travelling to the snow for winter sports.","id":"173661029351625"},{"name":"Voyager Travel Insurance","id":"483244965068754"},{"name":"Travel Insurance Agent","description":"Trip Delay,Trip cancellation,Trip interruption","id":"186408581404340"},{"name":"Monumental Insurance & Travel Services, Inc.","id":"1393668074193222"},{"name":"Sureplan Travel Insurance","id":"1629836407231856"},{"name":"Artog Travel Insurance Comparison","id":"152276198118352"},{"name":"AEGIS Travel Insurance","description":"Whether you are traveling on a business trip or a vacation, being abroad can leave you exposed to a variety of different risks one may take for granted in their home country. Differences between countries health care systems, legal regulations and other factors such as weather extremities, mean that ensuring you have a comprehensive travel insurance policy before you go abroad is of vital importance. Travel insurance can also protect an individual from losing their money in the event that a trip must be canceled, for example if the airline went bankrupt or if a family member falls ill. Furthermore, travel insurance protects all your luggage and possessions when abroad in case they are lost, stolen or damaged and many policies now even offer compensation if your flight is significantly delayed. Without the right insurance coverage a dream vacation can easily turn into a nightmare, burdening you with large bills and souring the whole travel experience. \n\nFor those that travel regularly, we can help to arrange Annual Travel Policies which provides for unlimited number of trips up to a maximum duration of 60-90 days for any one trip. Annual travel insurance may be the most cost-effective alternative when you or your group are travelling several times in the course of a year.\n\nAEGIS's team of insurance specialists can help to tailor the policy for you or your groups individual needs in order to ensure the best coverage possible. For further information regarding travel or group travel insurance and how it could help you or your business, simply contact the AEGIS team who will be happy to assist you with any queries you may have on +84 (08) 3514 7965!","id":"214016438770724"},{"name":"Gaurav travels & insurance","id":"1460555510834268"},{"name":"HIV Travel Insurance","id":"131372961484"},{"name":"Su Casa Travel And Insurance","id":"409036122546276"},{"name":"Asr Insurance Travel","id":"416499251884927"},{"name":"Pragema Travel & Insurance B.V.","id":"561548167226358"},{"name":"1 Travel Insurance","description":"Travel Insurance can protect non-refundable Cruise, Flight, Tour costs. Travel Insurance can provide peace of mind, covering Trip Cancellation & Interruption - Medical Expenses - Baggage & Personal Belongings - Baggage Delay - Travel Delay - Emergency Evacuation\/Repatriation.\n\nTravel Insurance estimates are fast and easy using our real-time QuickQuote Engine on our website www.1travelinsurance.com . Compare our competitive Travel Insurance plans side-by-side and purchase online within seconds. Travel Insurance policy confirmation is immediate and hard copy is mailed within 7 days. \n\nTo find the Travel Insurance Plan that is right for you, please visit our website and click on one of the options or use our QuickQuote Engine to get plan comparisons and real-time quotes. \n\nIf you don't know which plan you need, use our Contact Form or call during normal business hours (M-F 8:00 AM to 6:00 PM C.S.T.).\n","id":"178227865545894"},{"name":"Nicklas Insurance & Travel","id":"471987672976300"},{"name":"Acosta Insurance & Travel","id":"868369829896603"},{"name":"Arce Insurance & Travel","id":"671364889664791"},{"name":"Donegan Insurance & Travel","id":"664438500358781"},{"name":"Graham Insurance & Travel","id":"603743613061812"},{"name":"Holyland Insurance & Travel","id":"462785400547732"},{"name":"Melrose Insurance & Travel","id":"416540628533145"},{"name":"America Insurance & Travel","id":"124767484526734"},{"name":"Arce Insurance & Travel","id":"114944058846529"},{"name":"CTAS - custom made travel insurance","id":"108667069470565"},{"name":"Travel Insurance on the Net","id":"115527388555516"},{"name":"Hoang Thanh Insurance, Tax, Travel & Multi Services","id":"1491921781073907"},{"name":"Comprehensive Travel Insurance","description":"Comprehensive is a subsidiary of Vero Insurance Ltd offering insurance services specialising in travel, health, accident and injury management.","id":"207769849287088"},{"name":"Buy Travel Insurance - Australia","description":"Discounted Online Travel Insurance - for Australian residents\n","id":"150326325021006"},{"name":"HolidayGuard Worldwide Travel Insurance","description":"HolidayGuard provides comprehensive travel insurance for all your international and domestic travel requirements. It may be purchased worldwide except in the US and Canada.","id":"128196223869820"},{"name":"Travel Insurance World-Wide","id":"326290700784408"},{"name":"Travellers Insurance & Surety Corporation","id":"1387365734854234"},{"name":"Travel Guard Insurance","id":"393478057513590"},{"name":"GoGetCover.com - Singapore's Best Travel Insurance Portal","description":"The only online travel insurance portal that enables you to make purchases online at a discounted price.\n\nUnderwritten by AIG Singapore Pte Ltd.\n\n***Free Quotes & Instant Activation and Emai Confirmation***\n\n20% off Ad Hoc Travel Plans\n10% off Annual Travel Plans\n\nHow We Do It:\nThere is no secret; we simply remove the additional cost and time consuming transactions to save you, our customers, up to 25% in commissions charged by other insurance providers.\n \nOur Green Initiative:\nDid you know that buying an insurance policy online can save up to 90% more paper? We are determined to do our part to save the environment. Help us, and do your part... buy online.\n\nContact our Travel Insurance Manager - info@gogetcover.com","id":"226045577450496"},{"name":"Aqua Travel Insurance","id":"1466947316896307"},{"name":"It's So Easy Travel Insurance","id":"60685565651"},{"name":"Travel Health Insurance","id":"119782384762314"},{"name":"SEI Finance - Insurance&Travel","description":"Страхование & Туризм","id":"210580352296461"},{"name":"iTrek Travel Insurance","id":"272456639539"},{"name":"Car Insurance and Travel Agency","description":"1) NEED CHEAP CAR INSURANCE?! I CAN HELP! STOP PAYING THESE HIGH INSURANCE RATES! CALL TODAY FOR THE CHEAPEST INSURANCE QUOTES!\n\n\n2) HAVE ANY UNPAID PARKING TICKETS? HAVE ANY TRAFFIC VIOLATIONS OR TICKETS ON YOUR LICENSE? IS YOUR LICENSE SUSPENDED? I CAN HELP! I CAN HAVE EVERYTHING CLEARED FOR HALF PRICE! CALL TODAY!\n\n\n3) TIRED OF PAYING HIGH PRICES FOR PLANE TICKETS? I CAN HELP! YOU CAN TRAVEL ANYWHERE IN THE WORLD FOR HALF PRICE! PLEASE CONTACT ME TODAY FOR MORE INFORMATION!\n\n","id":"316364325145101"},{"name":"Under 30 Travel Insurance","id":"690883930986145"},{"name":"Schengen Travel Insurance","id":"772479862792315"},{"name":"Health and Travel Insurance 4 Less","id":"102798086553968"},{"name":"Global Alert Travel Insurance","description":"Since 1999, clients have traveled with peace of mind knowing they were protected by the Global Alert family of products. We are an industry leader in coverage and service.\n\nWe are committed to providing fast, fair and friendly claim service. Our phones are answered 24 hours a day, 7 days a week so you may contact us at your convenience should you need to file a claim, have a question about plans or the status of your claim.\n\nwww.globalalerttravel.com\n","id":"448801418488735"},{"name":"Online Travel Insurance","id":"561875463874797"},{"name":"World Travelers Insurance","description":"World Travelers Insurance began in 2009 to spread the message of the importance of international travel insurance. We have teamed with International Medical Group (IMG) to provide you with the best coverage at the lowest cost. For more than 20 years, IMG has dedicated its efforts to providing international medical insurance, travel insurance and impeccable service to the international community. It’s their specialty. We realize that traveling abroad can be an exciting experience. We also know that anything can happen while you’re away from home – whether visiting short-term or living abroad indefinitely. It’s important to be prepared for any unexpected illness, injury or medical emergency. Many traditional medical plans simply are not designed for international travel. IMG’s combination of insurance products and unparalleled services bring Global Peace of Mind®. We’ve served over a million people worldwide in more than 170 countries. Our products supply the coverage you need, while our services help overcome language, currency, time zone and cultural challenges.\n\n","id":"466429003460646"},{"name":"Over50sTravelInsurance","id":"294371850657369"},{"name":"Sams Insurance & Travel Agency","id":"1589818247948806"},{"name":"Star Insurance & Travel Agency","id":"992713107413767"},{"name":"Mountain Insurance & Travel Service","id":"868518926563074"},{"name":"ERV Air Crew Travel Insurance","id":"1489368817972368"},{"name":"direct travel insurance","id":"92137984706"},{"name":"Talisma Travel Insurance","description":"Talisma Insurance provides products that meet the insurance needs of the individuals and the organization.","id":"131499976926370"},{"name":"US Travel Insurance Association","description":"Founded in 2004, the US Travel Insurance Association  is a United States, registered 501 non-profit association of companies involved in the development, sales, marketing or implementation of travel insurance and related products and services; plus U.S. travel insurance carriers, third-party administrators and allied businesses that develop, administer and\/or market travel insurance and assistance products and services.UStiA is a primary information source about travel insurance, assistance, and related services for the US media.MissionAmong UStiA's missions are to educate consumers about travel insurance and related issues; foster ethical and professional standards of industry conduct; and cultivate government relations on behalf of the travel insurance industry.GoalsThe Association's goals are to: create uniform and fair regulations for the industry; develop consistent licensing standards for agents who market travel insurance and assistance services; and serve as an advocate for the travel insurance industry.Consumer AdvocacyIn accordance with the organization’s mission and goals, UStiA created a consumer advocacy website, TRIP, in 2010. The acronym TRIP stands for Travel Responsibly, Informed and Protected. TRIP provides timely travel information and articles, tips and links on issues concerning travel health, safety, and security.Membership Standards and CategoriesMember companies must adhere to UStiA's standards of ethical conduct and truth in advertising.Membership CategoriesUStiA has three categories of membership, Regular Member, Associate Member, and Subscriber.Regular Members are Insurance Carriers, Third Party Administrators, Managing General Agents, Managing General Underwriters, and Administrators who are in the insurance business and derive at least 50% of their annual revenue from travel insurance.","id":"126973604048495"},{"name":"Cheap Travel Insurance","id":"169608336497061"},{"name":"My Travel Insurance Diary","description":"My Travel Insurance Diary was started by Rikesh Kutoo on the 15th of June 2015. The website, www.mytravelinsurancediary.com, was initially created as a blog. Its main aim is to provide useful information, advice and tips to people buying travel insurance and traveling the world.  This site is one of its kind in the web world today.\n\nThe idea for its creation came back in 2013. After working for nearly six years in the travel insurance sector and having witnessed so many claims denied to common people, mostly due to their lack of knowledge which the insurers took full advantage of, I decided to create a website which will educate people on how to deal with the insurers.\n\nThe information in the website is the results of several years of experience gathered, thus, they are all based on real facts. \n\nSo, enjoy the materials and do not fall into the clutches of the insurance companies.\n","id":"694052883981593"},{"name":"TIPS","id":"150964408350340"},{"name":"World Escapade Travel Insurance","description":"Escapade Travel Insurance is a specialist in worldwide medical coverage designed for travelers all around the world.\n","id":"123438911048636"},{"name":"Inter Partner Assistance Travel Insurance SCAM Complaints","description":"Hi, I purchased travel insurance from Inter Partner Assistance via Iberia Airlines for a flight to Europe. However, beware you may be asked to provide all sorts of documents and information if you wish to process a claim and receive the travel insurance you paid for. The same travel insurance the salesperson said would necessitate very little effort to process a claim if so desired. After doing all the company asked and repeated emails to delay the process, the company has stopped responding all together. Please support me in boycotting this company and Iberia airlines by becoming friends with this page. Letting these companies know we will not accept being stolen from and they must be held accountable for the services they provide.","id":"140030842704523"},{"name":"Cheapest Travel Insurance Singapore","description":"For a free quote, we will be need to find out your:\n\n\nNumber of people going for the trip:        eg. 2 PAX\n\nLength of the trip:               eg. 18 days\n\nPlace\/Places you will be visiting:           eg. Thailand and Vietnam\n\nAny extra special coverage needs you may want:        \n\neg. Emergency medical evacuation back to Singapore, Double Hospitalization Allowance, Full Terrorism Cover, and Emergency phone charges. \n\n\n\nIf you get in touch with us via SMS at 8448 1155, we'll get back to you within 3 working days.\n","id":"271559829621822"},{"name":"Travel Insurance in India","id":"344913282198657"},{"name":"Christy's Insurance & Travel Servce","id":"594166850725959"},{"name":"Fravi Insurance and Travel Services","description":"We are a Property and Casualty insurance agency in Tampa, Fl. Call us , and we will give you a free quote for your Auto, Home, Flood and any Commercial insurance needs.\n\nSomos Una agencia de seguros de carro, casa, comercial , inundacion.\nTambien, somos agentes de viajes autorizados por el estado de la Florida, Envios de paquetes a cualquier parte del mundo.\n\n.\n","id":"724162180958471"},{"name":"Standard Insurance","id":"319327224936986"},{"name":"Wander UK Student Travel Insurance","id":"350071307108"},{"name":"My Best Travel Insurance Quote","id":"505205452928501"},{"name":"SkyWorld Travel Insurance","id":"418114298393856"},{"name":"It's So Easy Travel Insurance","description":"Travel insurance for everyone! No capped age limit, pre-existing medical conditions covered, professional and friendly service at all times.","id":"351330608313397"},{"name":"Travel Insurance Agency","id":"490676974430851"},{"name":"工作假期\/旅遊保\/海外留學保險 Working holiday \/Travel ins.\/Overseas study insurance","description":"我們是一間專業保險中介，網羅全港各大保險公司的工作假期\/旅遊保險\/海外留學保險。\n\n使命：\n作為一站式平台提供免費、專業、全面的比較資訊，及專人跟進售後服務。令你玩得開心又放心。","id":"813052382078527"},{"name":"San Miguel Insurance & Travel SRVCS","id":"727480060712290"},{"name":"A Sr Insurance & Travel Inc.","id":"832227486892838"},{"name":"Travel Air Insurance Company","id":"1444363062537407"},{"name":"USA Travel Health Insurance","id":"185305798277162"},{"name":"Columbus travel insurance","description":"Columbus Direct，又名Columbus Insurance，是一間成立於1988年的旅遊保險公司，總部設於英國倫敦。母公司為The Collinson Group，其業務包括旅遊服務、市場推廣、保險、產品研發等等，客戶遍佈120個國家。2010年，Columbus Direct 把旅遊保險業務伸展到亞洲，並以香港及新加坡作為亞洲首個業務推行地區。業務營運Columbus Direct 在以下地區設有銷售點： 英國 (總部) 西班牙 義大利 德國 法國 澳洲 紐西蘭 荷蘭 泰國 新加坡 香港外部連結Columbus DirectColumbus Direct 香港","id":"177341629002911"},{"name":"Travellers Insurance & Surety Corporation","id":"158177124269138"},{"name":"Servic Travel & Insurance","description":"Servic Travel & Insurance nace de la necesidad de los latinos de acudir a los Estados Unidos en busca de mejores beneficios para sus familias, enfrentándose con la barrera del idioma se veían en la necesidad de acudir a desconocidos para poder enviar sus paquetes, en Servic Travel & Insurance nos dedicamos a enviar y recibir de remesas y paquete desde y hacia Republica Dominicana, Chile, Salvador y Honduras, servicios de Traducciones, Notario Publico, Envíos de TPS, Seguros, Pasajes aéreos e INCOME TAX.\n\nEmpresa familiar fundada por la Ing. Servia Iris Familia la cual recluto un equipo de profesionales altamente capacitados y motivados para brindarle a nuestros cliente la seguridad y la garantía de el mejor servicio brindado en toda New Jersy donde se tiene un trato familiar y personalizado para cada uno de nuestros cliente.\n\nMisión\n\n Nuestra misión es llegar a ser la empresa numero uno en eficiencia en el manejo de remesas y servicios múltiples.","id":"186645568199780"},{"name":"Over 60s Travel Insurance","id":"370109986378679"},{"name":"Blue Cross Medical and Travel Insurance","id":"789650001120087"},{"name":"Car Insurance & Road Tax Renewal","id":"227730904102118"},{"name":"Time Travel Insurance Co","id":"359294984272176"},{"name":"Global Travel Guide, for Hotels, Flights, Car Hire and Travel Insurance","id":"135542316477978"},{"name":"UK Health and Travel Insurance Services","id":"620795791346214"},{"name":"Voyageur Travel Insurance Company","id":"184396821609660"},{"name":"Travel & Health Insurance company","id":"604132679689607"},{"name":"Skyblue Cover Travel Insurance","id":"165902593437648"},{"name":"Blue Nile Travel Insurance","description":"ادارة التأمين الطبي والمسافرين","id":"625839670807399"},{"name":"Marios Iosif insurance Consultant  TEL: 99 597337","description":"WE CAN OFFER YOU THE SMART PRICES ON:\n* HOUSE INSURANCE \n    * CAR INSSURANCE \n       * LIFE INSURANCE\n           * MEDICAL INSURANCE ","id":"235561616558533"},{"name":"TravelBru - Hotels | Travel Insurance | Flights | Rental Cars | Visa Check","description":"Hotels, Travel Insurance, Flights, Rental Cars Search and Visa Requirement Checking converged and simplified! www.travelbru.com","id":"119146071447999"},{"name":"AAA Travel & Insurance","id":"477819752380982"},{"name":"Juba Travel and Insurance","id":"406955282846084"},{"name":"AAA Travel Membership Insurance","id":"1446926228949024"},{"name":"Metro Travel and Insurance","id":"1452866845015401"},{"name":"Kings travel insurance","id":"923109174413267"},{"name":"Age Concern Travel Insurance","id":"111132695605967"},{"name":"AOC Insurance Broker : Compare your Expat & Travel health insurance","description":"Insurance Solutions for Individual & Corporate\n\n+ Expat health Insurance Worldwide \n+ Régional Medical Insurance in South East Asia, Asean, Middle East, Africa.\n+ Employee Benefits\n+ Disability Insurance (Global life & Life Income Protection)\n+ Personal Liability & Personal Accident\n+ Working Holiday Visa Insurance\n+ Student international Insurance\n+ Annual & per trip Travel medical insurance\n+ Visa Schengen insurance in Europe","id":"207131182322"},{"name":"GeoBlue","description":"GeoBlue is a trade name of Worldwide Insurance Services, LLC, an independent licensee of the Blue Cross Blue Shield Association. The Facebook page is maintained by International Care and is intended to be a friendly space for GeoBlue fans. Please note that GeoBlue is not responsible for the accuracy of information or advice shared here by GeoBlue fans.\n\nGeoBlue strongly encourages respectful use of this page. Understand that GeoBlue reserves the right to remove potentially offensive postings. ","id":"1515338292015967"},{"name":"Tom Travel Invest Qulty Insurance","id":"667682446697817"},{"name":"E A Arce Insurance & Travel","id":"813853092063656"},{"name":"Atlas Travel Insurance Discount Code","description":"Atlas Travel Insurance  coupons, discounts, coupon codes, and deals from Our Site to help you save money on your Atlas Travel Insurance  purchase","id":"452120951598661"},{"name":"BC Travel & Bradley Insurance","id":"454118054771064"},{"name":"Atlas Travel Agency & Insurance","id":"1156846264341883"},{"name":"AVI    International Travel Insurance","description":"AVI International was founded in 1981 and now insures around 100 000 people, works with 40 countries and makes the 3\/4 of its turnover with foreign professional customers. Open to the international market, AVI International employs a multi-lingual staff. AVI International is also the first French brokerage company specialized in travel insurance with a turnover of 3 million euros, 30 years of experience, 70 assistance coordinators.\nA claims office and an Emergency Center is operated 7 days \/week, 24 hours \/day","id":"280626832107196"},{"name":"Medicare Supplements. Travel insurance. Funeral Expenses Site","id":"624319454316190"},{"name":"Health & Travel Insurance for Canadians","id":"63239575925"},{"name":"Life , General , Health and Travel Insurances","id":"498070680290242"},{"name":"Grace Travel Insurance","id":"1672176273003845"},{"name":"Dewitt Travel Insurance","id":"447411405384131"},{"name":"Drakefield Travel Insurance","description":"Drakefield Insurance Services Limited is a British company providing insurance services. The company was founded in 1998 and is authorised and regulated by the Financial Services Authority.Drakefield Insurance Services Limited is a subsidiary of Drakefield Holdings. Acromas is the holding company for Saga Holdings Ltd, AA Limited, Direct Choice Ltd and Drakefield Holdings Ltd.Drakefield Insurance Services Limited own and operate several UK based Travel Insurance websites including AA Travel Insurance, Go Travel Insurance and 1stop Travel Insurance which are all serviced via UK based call centres.Drakefield Insurance Services Limited was awarded the “Fastest Growing Independent East Anglia Broker” award for 2005\/2006 from the Insurance Times.","id":"106032219427446"},{"name":"Student Travel Insurance \/ Un Avion Rojo","description":"La combinación de más de 20 años de experiencia en el mercado y conocimiento  de las regulaciones de los Estados Unidos nos permiten ofrecerle una variedad de productos de seguros para todo presupuesto, disponible y fácil de entender en su proceso.\n\nNuestros socios son compañias de Seguros Estadounidenses y Europeas con calificación A, y contamos con representación de empresas con licensias en Estados Unidos y Europa.\n\n• Seguro Médico y de Accidentes\n• Muerta Accidental y Desmembramiento\n• Evacuación Médica\n• Repatriación de Restos\n• Protección de Equipaje\n• Asistencia 24\/7\n• Seguro de Daños a Terceros\n• Seguro de Cancelación de Viaje\n\nNuestros clientes son Organizaciones de Intercambios Culturales y Educativos, Universidades e Institutos Superiores, Escuelas de Lenguas, Cámaras de Comercio, Asociaciones de Educación Internacional, Agencias de Viajes, Agentes Representantes de Escuelas.\n\nGracias por Confiar su Viaje a nuestros Profesionales!!","id":"1437983353088491"},{"name":"Chrdie Insurance and Travel","id":"812325922214722"},{"name":"L and J Travel & Insurance","id":"412936752146896"},{"name":"Milgris Travel & Insurance","id":"927901913922686"},{"name":"Palacios Travel & Insurance","id":"867705549944032"},{"name":"Seans Travel & Insurance","id":"779148828873068"},{"name":"Barrera Insurance Services & Travel","id":"445718482265980"},{"name":"Asche Insurance Agency & Travel","id":"515172991963521"},{"name":"Dl Insurance Brokerage & Travel","id":"833158920102795"},{"name":"International Medical and Travel Insurance","id":"1583797345192503"},{"name":"Right Cover Travel Insurance","id":"62001092569"},{"name":"Stewards Insurance Con Agency and Stewards Safaris Tours and Travel.","id":"1463954797232173"},{"name":"Travellers Insurance & Surety Corp.","description":"A new and dynamic company built under an established name, reputation and solidity, TRISCOis a non - life insurance corporation duly organized under regulation by the Department of Finance - Insurance Commission.\n\nSpecifically engaged in the business of fire, marine, bonds, casualty insurance, contractor's all risk, fidelity guarantee, commercial blanket bonds and floater policies, among others, TRISCO has been  a stronghold and dominant player in the insurance industry over the years by its roster of clientele and reinsurance both here anf abroad.\n\n\"TRISCO, Your key stability. Your parnter in business.\"","id":"149588908527007"},{"name":"Waadell Hanna SD AllStar Insurance And Travel","id":"142614682427049"},{"name":"Thomas Cook Travel Insurance","id":"1646154219004227"},{"name":"Syal travel & insurance compeny","id":"579091712203961"},{"name":"Insure My Travel","description":"Insure My Travel is here to provide it's customers with the highest quality travel insurance for the lowest price possible.\n\nIf you are thinking of going on holiday and would like to insure your trip, Insure My Travel have the right policy for you. If you're going on a short break, snowboarding, golfing holiday, skiing or if you are going on a backpacking trip we provide travel insurance for all these activities.\n\nWe can also arrange cover if you have a pre-existing medical condition, using our online health screening guide.\n\n \n\n","id":"359316167488786"},{"name":"Tineo Insurance Agency Travel & Mre","id":"1619449774986435"},{"name":"Overseas Travel Insurance Services","id":"358040677739939"},{"name":"Jenny Travel Insurance Co","id":"844540265623540"},{"name":"PAL Travels Driving Licence Files, Tax Paid, Rc Transfer, Insurance Point","id":"455355821287799"},{"name":"SRI DIVINEProducts, Tour and Travels, Insurance","id":"573207666064154"},{"name":"Jay Shree Ambe Travels & General Insurance","description":"make fresh as well as renew passport application,\ndomestic & international airtickets & package tours, General Insurance , Foreign Exchange","id":"265756513561531"},{"name":"Jersey Travel Centre and Insurance Inc","id":"712140878913311"},{"name":"CCV \/ Travel Insurance \/ Sales Support","id":"652338498200146"},{"name":"A & V Insurance and Travel","id":"417244868468175"},{"name":"Plaza Travel & Insurance Services","id":"377711745759473"},{"name":"Plaza Travel & Insurance Services","id":"395835463945719"},{"name":"Lusamerica Travel & Insurance Agency","id":"404635303080421"},{"name":"Z Travel & Insurance Services","id":"689407841204074"},{"name":"Z Travel & Insurance Services","id":"982773045108961"},{"name":"Student Travel Insurance \/ Un Avión Rojo","id":"165424493491660"},{"name":"Mangalam Tours - Travels & Insurance","id":"779172722125574"},{"name":"Online Travel insurance India,Health Insurance India,car Insurance India","id":"129278012601"},{"name":"Georgia Travel Income Tax & Insurance Services","id":"456240781212310"},{"name":"AAA for Travel and Insurance and Membership Services","id":"422598081257706"},{"name":"AAA for Travel and Insurance and Membership Servic","id":"1432328233760054"},{"name":"North Shore Travel and Insurance Inc","id":"119204571752080"},{"name":"All Island Travel & Insurance","id":"466597730189691"},{"name":"ประกันการเดินทาง Tel.0892002160 กรมธรรม์ออนไลน์ ใช้ขอวีซ่า\/ยื่นวีซ่า","description":"บริการดูแลใกล้ชิดสนิทเหมือนญาติ Tel: 089-2002160 Line: TongSamerjai Web Service: http:\/\/ตัวแทนบริการ.blogspot.com\/ หน้าที่เกี่ยวข้องกับประกันการเดินทาง : https:\/\/www.facebook.com\/477545785682940","id":"497458007031033"},{"name":"AAA for Travel & Insurance & Membrs","id":"597124590430696"},{"name":"General Manager, Travel Insurance","id":"1464151157235492"},{"name":"Web International Travel Insurance","id":"857125621046486"},{"name":"A&T Travel & Insurance","id":"1454862961482916"},{"name":"A & G Insurance and Travel Agency","id":"507487469402545"},{"name":"Service Income Tax&travel,insurance CORP.","id":"708888712534464"},{"name":"Service income tax & Travel Insurance corp","id":"345846058920775"},{"name":"Bedros & Siamanto Aba Insurance Services & Melo Travel Services","id":"382625851935127"},{"name":"Traveler Friendly Insurance","id":"559729600734737"},{"name":"Grace Income Tax Service & Auto Insurance","id":"332956246775395"},{"name":"Tsachi-Touring Agencia de viajes","id":"912034808861121"}]