[{"ori_label":0,"name":"那些電影教我的事 - Lessons from Movies","description":"人生就該像部好電影，有一些劇情、有一些浪漫，還有很多的歡笑！Life should be like a good movie...a little drama, a little romance, and a lot of laughter. \n\n很多粉絲來信詢問，到底我們ＰＯ的這些文，是不是電影裡的台詞呢？\n\n其實我們的文句來源很多，有打引號的才是電影中的對白，其他的有原著內容，有經典名言，有網路搜集，當然還有很大一部份是我們自己的心得。 基本上，就是我們覺得，很能表達這部電影的意境的一句話，也就是，那些電影教我的事。至於翻譯的部分，有的是先有英文再翻中文，也有的是先有中文再翻英文喔！\n\n最近有些人問，如果不是電影中的對白，為什麼要ＰＯ呢？原因很簡單，因為電影中的對白，有可能會是電影教我的事，但電影教我的事，卻不一定是電影中的對白。純粹分享電影對白的專頁已經很多，但那不是我們想做的。\n\n歡迎聯絡我們：\nshuimou@gmail.com\nshuianng@gmail.com\n\n所有圖片與部分文字資料源自網路，若侵犯原作權利，請與管理員聯繫"},{"ori_label":0,"name":"IEEE Communications Society","description":"Vision Statement \nThe Vision of the IEEE Communications Society is to be the organization of choice for communications and related professionals throughout the world."},{"ori_label":0,"name":"Ella Eyre","description":"Page run by Ella Eyre and EE HQ."},{"ori_label":0,"name":"Kitchener-Waterloo Oktoberfest","description":"Friends, family, and having a GREAT time! That’s what the Ultimate Oktoberfest Experience is all about. Around Oktoberfest it’s called “Gemuetlichkeit” and it has no direct English translation, but essentially means “coziness”.\nThere are many ways to take in the Oktoberfest Experience during the festival! With 16 Festhallen and over 40 Family and Cultural Events, there is something for everyone!\nWalk through the doors of a festhalle and be transported to a world of good times, and good cheer. Where there are no strangers and the food and beverages are served up by friendly staff wearing traditional German tracht. Link arms and join your newly found festhalle friends in the singing of Ein Prosit, or hit the dance floor and polka the night away!\nGather the family and head down to King St. on Thanksgiving Day to continue the tradition of taking in the Oktoberfest Thanksgiving Day Parade! Watch as over 120 floats, bands, costumed characters make their way down the Parade route entertaining the crowd. Even Miss Oktoberfest and Onkel Hans join the fun on Monday, October 14, 2013!\nWhat’s your Ultimate Oktoberfest Experience? Discover it at Kitchener-Waterloo Oktoberfest!"},{"ori_label":0,"name":"Adam Lambert","description":"International superstar Adam Lambert is a Billboard chart topping, multi-award winning, multi-platinum-selling-singer-songwriter and performer.  Best known for his soaring voice and unique blend of theatrical flair and glam-rock sensibilities, the pop singer has performed in front of sold out crowds worldwide -both as a solo artist and with legendary rock group Queen.  His work has garnered a number of music awards and nominations including a Grammy nomination for “Best Male Pop Vocal Performance,” a BMI Award for “Award-Winning Songs,” two GLAAD Awards, a Young Hollywood Award for “Artist of the Year,” a Teen Choice Award for “Choice Male Reality\/Variety Star,” and a People’s Choice Award nomination for “Break-Out Musical Artist.”  A San Diego, California native, Lambert stepped into the national spotlight in 2009 when he became a finalist on the eighth season of American Idol.  His vocal range, along with his unique style, made him a standout contestant and he quickly won over millions of viewers.  After the season wrapped, Lambert released his widely successful RCA Records debut, “For Your Entertainment,” which sold nearly 2 million copies worldwide to date.  The album’s first single “Whataya Want From Me,” became a radio smash and earned him his first Grammy nomination for “Best Male Pop Vocal Performance.”  In June of 2010, Lambert embarked on his first headlining tour playing to sold out crowds in the US, Europe and Asia.  His sophomore album, “Trespassing,” was released in 2012, debuted at #1 on the Billboard 200 Album and garnered rave reviews. Most recently, Adam wrapped a hugely successful world tour fronting Queen, with original band members Brian May and Roger Taylor. Additionally, Lambert had a 5 episode arc on “Glee” during its 2014 season.  His highly anticipated third album, “The Original High”, executive produced by Max Martin and Shellback, will be released on Warner Bros. Records this summer.  "},{"ori_label":0,"name":"Pia Mia","description":"Get \"Do It Again\" on iTunes now at http:\/\/smarturl.it\/PiaDoItAgain & watch the lyric video at https:\/\/youtu.be\/FsTq5rc41s4\n\nFollow Pia\n\nPrincessPiaMiaP on snapchat\nhttp:\/\/twitter.com\/PrincessPiaMia\nhttp:\/\/instagram.com\/PrincessPiaMia\nhttp:\/\/facebook.com\/PiaMiaMusic\nhttp:\/\/officialprincesspiamia.tumblr.com\nhttp:\/\/youtube.com\/6peasinapod \nhttp:\/\/youtube.com\/PrincessPiaMiaVEVO\nhttp:\/\/soundcloud.com\/princesspiamia\nhttp:\/\/PiaMiaMusic.com"},{"ori_label":0,"name":"SAM SMITH","description":"The debut album 'In The Lonely Hour' is out now\niTunes: http:\/\/po.st\/1mgxAG\nWebstore:  http:\/\/po.st\/hlVxPW \nGoogle Play: http:\/\/po.st\/HlYYIv\nListen on Spotify: http:\/\/po.st\/YeV3pn\n\nhttp:\/\/samsmithworld.com\/\nhttp:\/\/www.twitter.com\/samsmithworld\nhttps:\/\/www.instagram.com\/samsmithworld\nhttps:\/\/soundcloud.com\/samsmithworld\nhttp:\/\/youtube.com\/samsmithworld\nhttp:\/\/youtube.com\/samsmithworldvevo\nhttp:\/\/po.st\/SamSmithSpotify"},{"ori_label":0,"name":"UW International and Canadian Student Network","description":"The official page for the University of Waterloo International & Canadian Student Network (ICSN). ICSN is the newest official FEDS service on campus. We are the go-to service if you are seeking to have a great experience at uWaterloo beyond academics and beyond borders! ICSN aims to make all international and exchange students feel welcome in Canada, creating fun opportunities for you to make new local and international friends!\n\nWINTER 2015 EXECUTIVE TEAM:\nCoordinators: Micky Agrawal & Amara Ifeanyi-okoro\nInternal Executive: Ceara Khoramshahi \nCommunications Executive: Jacquelyn Veraldi\nFinancial Executive: Monica Ren\nSocial Executive: Jessica Tam\nAdvocacy Executive: Kiara Hugh-Yuen\n\nWe're here for you! Please feel free to contact us at any point. \n\nAll general questions can be sent to icsnwaterloo@gmail.com"},{"ori_label":0,"name":"Stuff Uwaterloo Professors Say","description":"You know the funny ones, the odd ones, the \"interesting\" ones: the UWaterloo professors, some of the finest out there. Inbox us your favourite quote from them along with their name and the course code and we'll upload it to the page!!\n\nLet's SPREAD THE LOVE for our professors around! Put a SMILE on someone's face today :) \n\n\n~ ALL you have to do is inbox us with what your profs have said either with words or videos and we shall upload it to our page.~\n\nsubmission format: \n\"Quote\"\n-Prof. ___, Course code\n\nDISCLAIMER: This page is made in order to spread HAPPINESS... Its contents are not made to offend anyone or anything. \n\n****GOALS*****\n1K [CHECK]\n2K [CHECK]\n3K [CHECK]\n4K [CHECK]\n5K [CHECK]\n6K [CHECK]\n7K [CHEKC]\n8K [IN PROGRESS]"},{"ori_label":0,"name":"ECE GSA","description":"Official group of the ECE GSA at University of Waterloo."},{"ori_label":0,"name":"UW International and Canadian Student Network","description":"https:\/\/www.facebook.com\/UW.ICSN\nhttps:\/\/twitter.com\/uwicsn\n\nThe official Feds International and Canadian Student Network Group!\n\nStay in touch with other participants of the International and Canadian Student Network!\n\nUW ICSN is not responsible for the content published by the members of this Facebook Group. Reference in this group to any specific product, event or service is for the information and convenience of the public, and does not constitute endorsement, recommendation, or favoring by the UW ICSN."},{"ori_label":0,"name":"NUAA Alumni Association--North America Chapter","description":"This is a group for NUAA students who are in North America Aera. If you are a NUAA alumni and you are work or study in North America Area, please join this group and have fun!"},{"ori_label":0,"name":"University of Waterloo Carpool","description":"Looking for a ride to go back home or somewhere on the weekend?  Going back and want to make a little cash\/help a friend along the way?\n\nBetter Option: wheelzo.com \n\nPost here!\n\nRecently, we received a few cases where a driver\/passenger cancels an appointment right before the scheduled time. If you need to, please give at least 24 hours to your driver\/passenger if you decide to cancel. \n\nWe take these cases very seriously as it affects us all as a carpooling community. Reported cases could result in a ban from the group"},{"ori_label":0,"name":"Volunteer Opportunities - (share or find)","description":"Need some help at an upcoming event? Want to help? Or just looking to add some uWaterloo experience to your resume? Post your opportunities here - and find some too!"},{"ori_label":0,"name":"Class of 2015","description":"Class of 2015"},{"ori_label":0,"name":"Jobs & Internships","description":"Find and list jobs available on campus and over the summer.\n\nThis group will be updated in the coming days and weeks to be more dynamic and useful!\n\nIf you have any ideas, please post them in a doc! :D"},{"ori_label":0,"name":"Electrical Engineering","description":"Post cool stuff that happens in lectures. Maybe advice from upper years? and essentially a mini-survival guide, I suppose"},{"ori_label":0,"name":"Waterloo","description":"Only people with valid uwaterloo.ca email addresses can join this community. \n\nOnce you become a member, you can message other members and join groups for your classes, clubs and other groups around campus. \n\nHave questions or feedback? Please visit \nhttps:\/\/www.facebook.com\/help\/contact_us.php?id=170514883053497 \n\nNote: Facebook Groups at Waterloo is not affiliated with or endorsed by Waterloo. "},{"ori_label":0,"name":"Waterloo Music Club","description":"The official facebook group of Waterloo Music Club from University of Waterloo for communicating with other members of the club.  Feel free to use this group to set up jam sessions, bands or any other music-based activities.\n\nOur goal is to foster a friendly and relaxed community with musicians of all skill levels.  We hold jam sessions, exchange lessons, performances and social events.  Our club caters to everyone, no matter what type of music you enjoy or instrument you play.  We also have various social events including our End of Term Performance called MuHouse (Music House).  If you have any suggestions, please don't hesitate to contact us.\n\nAll posts on this group must be music and\/or UW-related.  All spam posts will be deleted immediately.  Repeatedly spamming will get you banned.\n\nEmail: WaterlooMusicClub@gmail.com\nTwitter: @LooMusicClub\nYouTube: www.youtube.com\/waterloomusicclub\nReddit: http:\/\/www.reddit.com\/r\/waterloomusicclub\/"},{"ori_label":0,"name":"Engineering Exchange Students Uwaterloo","description":"Group for all the engineering exchange students at the University of Waterloo. Exchange directors manage the page so feel free to ask any questions you may have here. "},{"ori_label":0,"name":"滑铁卢中国学生学者联谊会（UWCSSA）","description":"滑铁卢中国学生学者联谊会（UWCSSA）是致力于为在滑铁卢大学的中国学生与华人提供相关帮助与服务的非盈利性组织。在滑铁卢大学内外，其组织与参与活动都相当活跃且拥有超过1000名的会员。除了与在安大略地区的华人团体维持相当紧密的关系外，同时也欢迎与来自不同地区，不同文化的国际友人建立互惠友好的关系。\n\n我们的三大宗旨：\n1．提供会员以在学术上成长的机会，帮助他们发掘自身的潜能，并给予他们一个可以展示自我的舞台。\n2．增进中国学生与其它国家的学生在精神层面上的相互理解，促进他们彼此之间的交流友谊。\n3．建立一个在KW地区的中国学生与团体可沟通互动的平台"},{"ori_label":0,"name":"UWCSA","description":"https:\/\/www.facebook.com\/UWaterlooCSA?ref=br_tf\t\n\n滑鐵盧大學中國同學會是一個非牟利組織，為滑鐵盧大學的海外華僑服務。我們致力推廣中國文化，提供各種溝通渠道，以拉近中國同學之間的距離為尚。\n\t滑鐵盧大學中國同學會成立超過四十年，是滑鐵盧大學最大的華僑學會。我們舉辦各項不同類型的活動供同學參加，各展所長。多年來舉辨活動包括：舞台劇、歌唱比賽、運動比賽、撲克牌及麻雀遊戲等等，鼓勵同學在參與活動的同時，作文化交流及興趣分享。滑鐵盧大學中國同學經常與其他大學的學會合辦活動，為同學提供更多文化交流的機會。\n\n\tThe University of Waterloo Chinese Students’ Association  was first established nearly 40 years ago with a vision towards bringing awareness of the Chinese community. After its establishment, UWCSA has expanded to more than 1000 members. Being the largest Chinese cultural club at the University of Waterloo, we serve to connect and unite the diverse Chinese students of our institution, and in the process, contribute to multiculturalism throughout our university.\t\n\tUWCSA is widely renowned for its planning and execution of successful term events and activities. We host a variety of events, such as singing contests and sporting events, to facilitate and foster communication between our members. We also organize social events with other clubs that are not limited to those at University of Waterloo to extend our culture to others. \n\tIn the future, the members of UWCSA are hoping to be able to expand and grow with one another, creating an association that is both successful and beneficial to all the students of the University of Waterloo.\t\n\nSign up for our newsletter: http:\/\/eepurl.com\/p3Qvz"},{"ori_label":0,"name":"UWCLEC","description":"The UW Culture and Language Exchange Club (UWCLEC) is a new club founded in 2012 by UW students. As the name suggests, the purpose of this club is to promote the exchange of language and culture between students by forming small study groups. With the multicultural student body of UW, we are able to match up each student's preferred language to learn with other students who are knowledgeable in that language and can teach. \n\nThis club complements academic language courses nicely, and provide an opportunity to learn languages in a fun manner. Individual sessions will focus on improving the individual's speaking, listening, and writing (grammar & spelling) skills through lectures as well as fun activities that incorporate students’ hobbies and interests. This also serves as a great opportunity to prepare students who wish to participate in foreign exchange programs.\n\nMembership\nThere is no membership fee. UWCLEC will offer a learning experience with tutors for free! UWCLEC welcomes all undergraduate and graduate students from the University of Waterloo main campus.\n\nHow does the groups and meetings work?\nBy reviewing student preferences on the signup sheet, groups will be formed composing of individuals with the same language preferences and a suitable tutor knowledgeable in the language. Groups will be small to allow the tutor and tutees to closely work and learn together.\n\nIndividual Language Groups on Facebook\nArabic: https:\/\/www.facebook.com\/groups\/550483138356841\/\nCantonese: https:\/\/www.facebook.com\/groups\/488893677885478\/\nEnglish: https:\/\/www.facebook.com\/groups\/361296640660044\/\nFrench: https:\/\/www.facebook.com\/groups\/200259570124599\/\nGerman: https:\/\/www.facebook.com\/groups\/484136775027835\/\nJapanese: https:\/\/www.facebook.com\/groups\/uwclec.jp\/\nKorean: https:\/\/www.facebook.com\/groups\/147756678744867\/\nMandarin:https:\/\/www.facebook.com\/groups\/373132596128254\/\nMandarin (new): https:\/\/www.facebook.com\/groups\/379444392161196\/\nRussian: https:\/\/www.facebook.com\/groups\/371696449605202\/\nSpanish: https:\/\/www.facebook.com\/groups\/421757627932417\/?fref=ts\n \nAlliances\nBengali Students Association: https:\/\/www.facebook.com\/groups\/bsa.waterloo\/\nUW Chinese Students Association: https:\/\/www.facebook.com\/groups\/2241879340\/ \nIndonesian Students' Association: https:\/\/www.facebook.com\/groups\/indonesianstudents\/\nTaiwanese Waterloo Student Association: https:\/\/www.facebook.com\/groups\/uwaterlootwsa\/\n\nEmail: uwclec@gmail.com\nWebsite: http:\/\/uwclec.webs.com\/"}]