[{"ori_label":0,"name":"Zero to One","description":"The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won’t make a search engine. And the next Mark Zuckerberg won’t create a social network. If you are copying these guys, you aren’t learning from them.\n \nIt’s easier to copy a model than to make something new: doing what we already know how to do takes the world from 1 to n, adding more of something familiar. But every time we create something new, we go from 0 to 1. The act of creation is singular, as is the moment of creation, and the result is something fresh and strange.\n \nZero to One is about how to build companies that create new things. It draws on everything Thiel has learned directly as a co-founder of PayPal and Palantir and then an investor in hundreds of startups, including Facebook and SpaceX.\n \nThe single most powerful pattern Thiel has noticed is that successful people find value in unexpected places, and they do this by thinking about business from first principles instead of formulas. Ask not, what would Mark do? Ask instead: What valuable company is nobody building?"},{"ori_label":0,"name":"engVid","description":"engVid.com provides free English lesson videos to students around the world. If you are an English student or teacher, our free site will help you."},{"ori_label":0,"name":"Humans of New York","description":"Hey there.  My name is Brandon and I began Humans of New York in the summer of 2010, shortly after leaving my job in Finance.  (OK, I actually got fired.)  I started HONY because I thought it would be really cool to create an exhaustive catalogue of New York City's inhabitants, so I set out to photograph 10,000 New Yorkers and plot their photos on a map.  Somewhere along the way, I began to interview my subjects in addition to photographing them.  And alongside their portraits, I'd include quotes and short stories from their lives.\n\nTaken together, these portraits and captions became the subject of a vibrant blog. HONY now has over ten million followers on social media, and provides a worldwide audience with daily glimpses into the lives of strangers on the streets of New York City. \n\n------------------------\nIf you'd like to say \"hello\" : honybrandon@gmail.com\nAnything business-related : honyassist@gmail.com\n"},{"ori_label":0,"name":"Communitech","description":"Communitech is located in Waterloo Region, 110 kilometres (66 miles) west of Toronto, Ontario, Canada. Founded by a group of dedicated entrepreneurs in 1997, Communitech is the regional hub for the commercialization of innovative technologies supporting and building a Southwestern Ontario tech cluster of close to 1,000 companies that now generates more than $30B in revenue. A member of the Ontario Network of Excellence (www.oneinnovation.ca), which is funded by the Ontario government, Communitech supports tech companies at all stages of their growth and development – from startup companies, to rapidly growing SMEs, to large global players – to create greater numbers of successful global businesses for Ontario and for Canada. "},{"ori_label":0,"name":"All Events in City","description":"All Events in City is world’s fastest growing event discovery platform with more than 22 million events from 20,000 cities of the world. Started in 2011, with 2 million monthly active users worldwide it has become the best place for event organizers to reach out their potential event attendees. It facilitates city level marketing of different kinds of events at best possible return with greater reach to audience. All Events is connecting bridge between event information seekers and event organizers by providing a right platform with presence on web, iOS and Android mobile app."},{"ori_label":0,"name":"UW International and Canadian Student Network","description":"The official page for the University of Waterloo International & Canadian Student Network (ICSN). ICSN is the newest official FEDS service on campus. We are the go-to service if you are seeking to have a great experience at uWaterloo beyond academics and beyond borders! ICSN aims to make all international and exchange students feel welcome in Canada, creating fun opportunities for you to make new local and international friends!\n\nWINTER 2015 EXECUTIVE TEAM:\nCoordinators: Micky Agrawal & Amara Ifeanyi-okoro\nInternal Executive: Ceara Khoramshahi \nCommunications Executive: Jacquelyn Veraldi\nFinancial Executive: Monica Ren\nSocial Executive: Jessica Tam\nAdvocacy Executive: Kiara Hugh-Yuen\n\nWe're here for you! Please feel free to contact us at any point. \n\nAll general questions can be sent to icsnwaterloo@gmail.com"},{"ori_label":0,"name":"University of Waterloo","description":"Built by entrepreneurs, the University of Waterloo is a place where innovation has impact. Located in Waterloo, Canada, in the heart of the world’s emerging Quantum Valley, this is an institution uniquely connected to the world and committed to making it better — by fuelling prosperity and improving the human condition."},{"ori_label":0,"name":"Facebook Developer Community","description":"Welcome!  This is a forum for developers building on the Facebook platform to interact with the Facebook team and other developers.  \n\nFor answers to common questions please check out: https:\/\/developers.facebook.com\/docs\/apps\/faq\n\nFor documentation and the latest updates about our platform, visit the Facebook developer portal: \nhttps:\/\/developers.facebook.com\/\n\nTo report a bug on Platform please use the Platform bug tracker at https:\/\/developers.facebook.com\/bugs\/\n\nFor detailed technical questions please use a programming Q&A site such as StackOverflow: \nhttp:\/\/facebook.stackoverflow.com\n\nIf your app was restricted or removed from Facebook - you can learn more or appeal the restriction at:\nhttps:\/\/developers.facebook.com\/appeal \n\nThis group is not for asking questions about using Facebook or your profile, asking people to like your page or app, advertising your site, posting photos of yourself, etc.  Such posts will be removed and you may be removed from the group.\n\nDon't hesitate to ask a question otherwise but please search first to make sure that your question haven't been answered already - let's build!"},{"ori_label":0,"name":"Jobs & Internships","description":"Find and list jobs available on campus and over the summer.\n\nThis group will be updated in the coming days and weeks to be more dynamic and useful!\n\nIf you have any ideas, please post them in a doc! :D"},{"ori_label":0,"name":"Devs of uWaterloo","description":"Show off your apps, discuss dev of any kind, share events and hackathons!\n\nThis group has more pivots than a failing Californian startup"},{"ori_label":0,"name":"ECP Winter 2015","description":"ECP 2015 "},{"ori_label":0,"name":"Waterloo Graduate Algorithm Seminar","description":"This seminar is where we learn, socialize, and most importantly, have fun. We meet at Davis Centre 2584, 2:00 p.m. every Saturday. We currently target at solving five problems every week.\n\nThis seminar is private and invite-only. Only top geniuses will be invited!\n\nGoogle Groups is where we discuss problems and coordinate activities:\nhttps:\/\/groups.google.com\/d\/forum\/waterloo-graduate-algorithm-seminar\n\nWeChat is where we share instant information and chedan. Scan the QR Code in the Group Information album to get involved."},{"ori_label":0,"name":"English Conversation Partners","description":"Hey guys! I made this group so we can easily share ideas or questions. Feel free to post any question about anything that you are curious about. Also, if you think of any activities or event you want to try, post it and we can try and make it happen! I'm going to try and help you guys out as much as possible, I just need to know what you would like to learn more about.  "},{"ori_label":0,"name":"Housing","description":"Research CHEAP & QUALITY housing in the KW area.\n\n~Find Room mates\n~Sublet your room\n~Selling a house? List it here!\n\nThis is the BEST place to post all of your housing needs and concerns."},{"ori_label":0,"name":"Computer Science","description":"Please only post things that are related to Computer Science. "},{"ori_label":0,"name":"English Conversation Partner","description":"English Conversation Partner Program Fall 2014 \n"},{"ori_label":0,"name":"滑铁卢中国学生学者联谊会（UWCSSA）","description":"滑铁卢中国学生学者联谊会（UWCSSA）是致力于为在滑铁卢大学的中国学生与华人提供相关帮助与服务的非盈利性组织。在滑铁卢大学内外，其组织与参与活动都相当活跃且拥有超过1000名的会员。除了与在安大略地区的华人团体维持相当紧密的关系外，同时也欢迎与来自不同地区，不同文化的国际友人建立互惠友好的关系。\n\n我们的三大宗旨：\n1．提供会员以在学术上成长的机会，帮助他们发掘自身的潜能，并给予他们一个可以展示自我的舞台。\n2．增进中国学生与其它国家的学生在精神层面上的相互理解，促进他们彼此之间的交流友谊。\n3．建立一个在KW地区的中国学生与团体可沟通互动的平台"},{"ori_label":0,"name":"University of Waterloo Carpool","description":"Looking for a ride to go back home or somewhere on the weekend?  Going back and want to make a little cash\/help a friend along the way?\n\nBetter Option: wheelzo.com \n\nPost here!\n\nRecently, we received a few cases where a driver\/passenger cancels an appointment right before the scheduled time. If you need to, please give at least 24 hours to your driver\/passenger if you decide to cancel. \n\nWe take these cases very seriously as it affects us all as a carpooling community. Reported cases could result in a ban from the group"},{"ori_label":0,"name":"Waterloo","description":"Only people with valid uwaterloo.ca email addresses can join this community. \n\nOnce you become a member, you can message other members and join groups for your classes, clubs and other groups around campus. \n\nHave questions or feedback? Please visit \nhttps:\/\/www.facebook.com\/help\/contact_us.php?id=170514883053497 \n\nNote: Facebook Groups at Waterloo is not affiliated with or endorsed by Waterloo. "},{"ori_label":0,"name":"University of Waterloo","description":"This is an unofficial group for anyone and everyone associated with the University of Waterloo (students, faculty, alumni, etc.). Go Warriors! \n\nPlease note, this group is for content relating to the University of Waterloo. Any spam, unrelated advertisement or solicitation will be deleted and the user will be blocked. "}]