[{"ori_label":0,"name":"Ender's Game","description":"Andrew \"Ender\" Wiggin thinks he is playing computer simulated war games; he is, in fact, engaged in something far more desperate. The result of genetic experimentation, Ender may be the military genius Earth desperately needs in a war against an alien enemy seeking to destroy all human life. The only way to find out is to throw Ender into ever harsher training, to chip away and find the diamond inside, or destroy him utterly. Ender Wiggin is six years old when it begins. He will grow up fast.\n\nBut Ender is not the only result of the experiment. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway almost as long. Ender's two older siblings, Peter and Valentine, are every bit as unusual as he is, but in very different ways. While Peter was too uncontrollably violent, Valentine very nearly lacks the capability for violence altogether. Neither was found suitable for the military's purpose. But they are driven by their jealousy of Ender, and by their inbred drive for power. Peter seeks to control the political process, to become a ruler. Valentine's abilities turn more toward the subtle control of the beliefs of commoner and elite alike, through powerfully convincing essays. Hiding their youth and identities behind the anonymity of the computer networks, these two begin working together to shape the destiny of Earth-an Earth that has no future at all if their brother Ender fails."},{"ori_label":0,"name":"JoinTheLeaders.com","description":"Our Missions\n\n1. We will encourage aspiring individuals to develop leadership skills by providing roadmaps, mentorships, and opportunities to network. \n2. We will seek for opportunities to foster partnership with fellow organizations by working in conjunction and supporting them\n\nOur Values\n\n• Learn: We will constantly learn and research on leadership skills and people who possess those traits to acquire and distribute the lessons and knowledge. \n• Network: We understand that continuous expansion of individuals’ network is important. \n• Respect: We respect fellow organizations’ contributions to Korean communities. \n• Collaborate: We value the importance of working with other organizations by sharing resources and ideas for the growth of Korean communities abroad. \n• Synergy: We believe that individual leadership development contributes in achieving synergetic Korean communities. "},{"ori_label":0,"name":"Toronto Joyful Community Church","description":"하나님께서 2005년 5월 1일에 창립하신 토론토 조이플 교회는 하나님의 크신 은혜 가운데, 매주 감동의 예배를 드리고 있으며, 자녀들에게 크리스챤으로서 그리고 한국인으로서의 정체성을 확립하는 교회 교육에 심혈을 기울이고 있습니다."},{"ori_label":0,"name":"PlayStation","description":"French-speaking Canadians can check out our French language Facebook page at www.facebook.com\/PlayStationCanadaFR\n \n"},{"ori_label":0,"name":"Cody Shane - Primerica","description":"Follow me on Twitter @codyshane01\nContact Toll Free 1-877-213-3946"},{"ori_label":0,"name":"LAVISH","description":"LAVISH is an innovative club driven by people, music and diversity.\n\nELEVATE Rooftop patio is the newest addition to the nightclub. (Entrance through Lavish)\n\nLAVISH IS WELCOMING TO EVERYONE! We boast an eclectic mix of all people seeking a fun party! \n\nThe staff at LAVISH take pride in maintaining a safe space for the LGBT community.\n\nFULL EVENTS CALENDAR: http:\/\/clublavish.ca\nFOLLOW US FOR THE LATEST UPDATES: https:\/\/twitter.com\/#!\/clublavish"},{"ori_label":0,"name":"Euchre","description":"Euchre or eucre is a trick-taking card game most commonly played with four people in two partnerships with a deck of 24, or sometimes 32, standard playing cards. It is the game responsible for introducing the joker into modern packs; this was invented around 1860 to act as a top trump or best bower (from the German word Bauer, \"farmer\", denoting also the jack). It is believed to be closely related to the French game Écarté that was popularized in the United States by the Cornish and Pennsylvania Dutch, and to the seventeenth-century game of bad repute Loo. It may be sometimes referred to as Knock Euchre to distinguish it from Bid Euchre.OriginsEuchre appears to have been introduced into the United States by the early German settlers in the Midwest. and from that region gradually to have been disseminated throughout the nation. It has been more recently theorized that the game and its name derives from an eighteenth-century Alsatian card game named Juckerspiel, a derivative of Triomphe. Also, it may have been introduced by immigrants from Cornwall, England, where it remains a popular game. It is also played in the neighboring county of Devon; one theory is that it was introduced by French or American prisoners of war imprisoned in Dartmoor prison during the early 19th century. Ombre is an ancestral form of Euchre."},{"ori_label":0,"name":"The 7 Habits of Highly Effective Teens","description":"The Seven Habits of Highly Effective Teens is a 1998 bestselling self-help book written by Sean Covey, the son of Stephen Covey. The book was published on October 9, 1998 through Touchstone Books and is largely based on The Seven Habits of Highly Effective People. In 1999 Covey released a companion book entitled Daily Reflections For Highly Effective Teens.In 2000 The 7 Habits of Highly Effective Teens was named as one of the YALSA's \"Popular Paperbacks for Young Adults\".SynopsisIn the book Covey discusses how teenagers can become more independent and effective by following seven basic habits. The habits range from being proactive in every aspect of one's life to planning and prioritizing one's daily life and responsibilities.ReceptionReception for the book has been positive, with some schools including the text in their lesson plans. A reviewer for the New Straits Times commented that the book's writing was \"fun and lively\" and called it a \"fruitful read\". AudioFile gave the audiobook a positive review, citing Covey's narration as a highlight. The 7 Habits of Highly Effective Teens has also been praised by several psychologists, although according to the Handbook of Self-Help Therapies the book has not been thoroughly tested as a part of a treatment plan."},{"ori_label":0,"name":"I Heart Huckabees Official","description":"I HEART HUCKABEES features an all star cast that includes screen legend Dustin Hoffman (RAINMAN), Isabelle Huppert (8 FEMMES), Jude Law (Academy Award Nomination COLD MOUNTAIN), Jason Schwartzman (RUSHMORE), Lily Tomlin (SHORT CUTS), Mark Wahlberg (PLANET OF THE APES) and Naomi Watts (Academy Award Nomination 21 GRAMS). Directed and co-written by David O. Russell (THREE KINGS, FLIRTING WITH DISASTER) and produced by Scott Rudin (SLEEPY HOLLOW, RANSOM, Gregory Goodman (8 MILE, THREE KINGS) and David O. Russell. This is the third film from Michael Kuhns Qwerty Films and it is produced and financed by N1 European Film Produktions.\n\nWriter, producer and director DAVID O. RUSSELL burst onto the scene with his 1994 festival hit SPANKING THE MONKEY. In 1996 FLIRTING WITH DISASTER followed, displaying his flair for inventing colourful, larger than life characters. Three years later, THREE KINGS was released boasting an A list cast including George Clooney and Mark Wahlberg. It finally established Russell as a bona-fide major Hollywood player.\n\nNow prepare yourself for I HEART HUCKABEES..."},{"ori_label":0,"name":"Walking","description":"Walking is one of the main gaits of locomotion among legged animals, and is typically slower than running and other gaits. Walking is defined by an 'inverted pendulum' gait in which the body vaults over the stiff limb or limbs with each step. This applies regardless of the number of limbs - even arthropods, with six, eight or more limbs, walk.In the United Kingdom and Ireland, the term walking is used to describe both walking in a park or trekking in the Alps. However, in Canada and the United States the term for a long, vigorous walk is hiking, while the word walking covers shorter walks, especially in an urban setting."},{"ori_label":0,"name":"Larry Smith: Why you will fail to have a great career | Video on TED.com","description":"TED Talks In this funny and blunt talk, Larry Smith pulls no punches when he calls out the absurd excuses people invent when they fail to pursue their passions.  <em>(Filmed at <a href=http:\/\/www.ted.com\/tedx\/events\/2219>TEDxUW<\/a>.)<\/em>"},{"ori_label":0,"name":"Primerica","description":"Primerica is a leading provider of term life insurance. Working to get families out of debt and improve saving rates, Primerica is in the business of helping people. Contact your local Primerica representative today."},{"ori_label":0,"name":"보아(BoA)","description":"\n"},{"ori_label":0,"name":"W & JAS","description":"더블유 앤 자스는 전자 음악 장르 중 하나인 일렉트로니카를 바탕으로 한 대한민국의 전자 음악 그룹이다. 소속사는 플럭서스 뮤직이다.발자취W 는 Kona 의 배영준을 중심으로 한재원, 김상훈과 함께 2001년에 결성된 그룹이다. 이미 오랜 코나 시절의 팬들부터 마니아들 사이에선 꽤 두터운 팬층을 형성하였다. W로 정규 음반 2집까지 발매하였고, 2006년 제3회 한국 대중 음악상 그룹 부문 올해의 가수상, 최우수 팝 앨범상을 받았다. W의 2집 타이틀 곡 \"쇼킹 핑크 로즈 \"는 TV 드라마《내 이름은 김삼순》의 삽입곡으로 쓰였다.2006년, 새로운 보컬로 Whale을 영입하면서 W & Whale으로 그룹 이름을 변경하였다. 2008년 9월, SK브로드밴드의 브랜드 론칭 광고 음악으로 \"RPG Shine\"을 개사한 CM 송이 쓰이면서 국내에 널리 알려졌다. 2012년에 웨일이 싱글가수로 전향하면서 탈퇴하자 자스를 영입해서 W & JAS로 이름을 변경했다.음반 목록정규 음반 2001년 W 1집《안내섬광》 2005년 W 2집《Where the Story Ends》 2008년 W & Whale 1집《Hardboiled》(웨일 영입) 2013년 W & JAS 《New Kid In Town》비정규 음반 2009년 W & Whale 1.5집《Random Tasks》 2009년 W & Whale 디지털 싱글〈Born To Rock〉 2011년 W & Whale EP《CIRCUSSSS》 2015년 W & JAS 《But We Have To Go》 2015년 W & JAS 《We Can`t Dance But!》참여 음반W & Whale 영화 《뜨거운 것이 좋아》사운드트랙 수록곡 TV 시트콤 《크크섬의 비밀》O.S.T. 음반 프로듀싱 TV 드라마 《케세라세라》사운드트랙 수록곡 \"월광\" (1집 수록) 《윤상 노래책》의 수록곡 \"소리\" (윤상 4집 수록곡 리메이크) 《개구리 중사 케로로》한국판 5기 O.S.T. 수록곡 \"슬픈 안드로이드\" (웨일 솔로) SK브로드밴드 CM 송 (\"R.P.G. Shine\" 개사) 영화 《비크티니와 백의 영웅\/흑의 영웅 (포켓몬스터 극장판 14기)》 OST \"기적\/태양\" W & Jas TV 드라마 《우리가 결혼할 수 있을까 Part 1》 O.S.T. (2012년) TV 드라마 《처용 Part 2》 O.S.T. (2014년)"},{"ori_label":0,"name":"The Blues Brothers","description":"Comedy icons John Belushi and Dan Aykroyd star in the outrageously funny musical comedy about Jake and Elwood Blues, two brothers searching for redemption with no money but a briefcase full of soul. Hit the road with musical performances by blues legends Ray Charles, James Brown, Aretha Franklin and Cab Calloway in the action-packed spectacular from acclaimed director John Landis."},{"ori_label":0,"name":"The Matrix","description":"Get \"The Matrix\" at WBShop.com: http:\/\/bit.ly\/the_matrix_"},{"ori_label":0,"name":"Busters On The Planet","description":"FAN Group of The Pillows \nRADIO BUSTERS! :\nhttp:\/\/radiobusters1punto0.listen2myradio.com\/ \nTAMBIEN , GRUPO AMIGO  \"BUSTERS !\" : \nhttps:\/\/www.facebook.com\/groups\/comunidadbuster\/"},{"ori_label":0,"name":"Joyful Pastors","description":"행복한 가정, 건강한 교회를 꿈꾸는 조이플교회 목회팀입니다"},{"ori_label":0,"name":"BLOCK IRENE HEESONG","description":"Irene Heesong, the facebook user who says she went to Seoul National University, is a hacker. please FIND her and block her. She recently added me on facebook, which I didn't accept because I have no clue who she is. Then she msgs me, asking why I'm not accepting her. I read the message, and one day later, my account was logged in the states. She messages me on facebook, and blackmails me that she will spread all my personal information, and the conversations I had with my friends. IF you don't want this happening to you, JUST BLOCK HER. DON'T start a conversation with her.DON'T read her messages. DON'T click anything she shares. PERIOD.\n\nI'm doing this because I care for all of you :)\n\nif you have blocked her, please like the post.\n\nIf you have FRIENDS you care for, please feel free to invite them.\n\nThanks.\n"},{"ori_label":0,"name":"Krav Maga Toronto","description":"Krav Maga Toronto Fight and Fitness is an Official and Fully Licensed and Certified Training Center for Krav Maga in the GTA. \n\nWe consider your safety to be our number1 priority whether that be in our training center or out on the streets. All of our instructors are fully certified official Krav Maga instructors with years of experience to ensure that you receive the most safe and effective self defence training. \n\nKrav Maga is the only proven and battlefield tested Defensive Tactic System in the world and it is offered EXCLUSIVELY at Krav Maga Toronto Fight and Fitness Academy\n\nSelf Defense, Street Fighting, Conditioning and Cardio, MMA training, YOGA Strength and Flexibility Training\n\n"},{"ori_label":0,"name":"Olivia Chow for Better City 올리비아 차우 토론토 시장 후보","description":"<올리비아 차우는 우리의 새시장이 될만한 풍부한 경험의 소유자입니다.>\n \n그녀는 국회의원, 시의원, 학교 이사를 역임하였습니다. 할머니이자 딸로서, 가족일원의 보다 강한 유대감과  보다 나은 이웃을 만들어갈 수 있도록 시민들을 이끌어줄 수 있는 확실한 경험들을 가지고 있습니다.\n\n올리비아는 13살이 되던 해인  1970년 홍콩에서 토론토로 이민을 왔고 가족부양을 돕기 위해 두 가지 아르바이트에 종사하기도 하였습니다. 그녀는 대학을 졸업한 후에는 토론토에서 ESL 영어 선생님으로서 근무하였고 신규 이민자들의  보다 신속한 정착을 돕는 일을 하였습니다.  \n그녀는 1985년에는  교육위원회에 선출되어 어린이를 위하는 챔피언으로서 그  명성을 떨쳤고, 1988년에는  Jack Layton 과 결혼하여 두 자녀인 Mike와Sarah Layton의 양육에도 힘썼습니다.   \n\n“우리가 어디서 왔는지, 어디서 사는지는 그리 중요한 문제가 아닙니다. 제가 학교 이사로서, 의원으로서 일했거나 혹은 의회 일원으로 일했건간에 상관없이 저의 가장  핵심적인 신념은 우리 모두가 원하는 바인 아이들을 위한 보다 밝은 미래를 만들어가는 것입니다.   우리는 서로 부정적이 되어서는 안되겠습니다.  우리는 함께 손을 맞잡을 수 있습니다.” –올리비아\n\n올리비아는 1991 년과 1994 년에 전 메트로 이사회에 선출되었었고, 1997 년과  2000 년과 2003 년도에는 new city of Toronto’s council 로 선출 되었다. 전 토론토 시장 Mel Lastman 이 그녀를 예산 위원으로 임명하였는데 여기에서 올리비아는 다섯 조항의  균형잡힌  예산 제공을 위한 연설을 도왔다.\n그 밖에도 올리비아는 ‘Better Kid’s dental services, Student Nutrition Programs and Youth Safety Intiniatives’ (아이들을 위한 덴탈 케어, 아이들을 위한 아침 식사 제공, 아이들의 안전을 위한 프로그램 등) 프로그램들을 실행하도록 연설하여 라스트맨 시장은 그녀를 칭하기를  토론토의 제일가는 어린이 및 청소년 옹호자라는 칭호를 붙여주었다. 이 밖에도  올리비아는 응급상황시 영어를 못하는 이민자들을 위해 911 서비스를 140개 언어로 제공하도록 수정하는데 가장 큰 공헌자였다.\n \n2006년에 올리비아는MP로 선출 되었다. 그녀의 선출로 연방정부가 우리의 사회기반 시설에 투자하도록 강력한 목소리가 되어주었다.  그녀는 당소속에 얽매이지 않고 모든 당의 MP들과 함께 일하는 모습을 보여주어큰 명성을 얻었다. 그 결과  올리비아는  2008년과 2011년에 재선출 되었다.\n \n현재 올리비아는 어머니 Ho Sze를 모시고 살고 있으며,  아버지 Wilson, Wai Sun을 돌보는 일을 돕고 있다. 그녀는 2명의 손녀인 Beatrice 와 Solace를 두고있다. 2014년 올해에는 자서전적  베스트셀러 \n서적인 ‘My Journey’를 출간하였다.   \n\n우리 시의 가장 유능한 지도자들 중 한 사람으로서 인정받는 올리비아는 토론토 Sun지의 독자들이 선택한 최고 Torontonian 황금상을 수여하였으며  Now Magazine으로 부터는 소비자들이 선택한 최고의 시의원이자 캐나다  최고의 여성으로 9차례나 연속 선출되는  화려한 경력이 포함되어 있다.\n\n<새로운 시장,  보다 살기좋은 도시>\n\n“저는 여러분의 새시장이 되고자 합니다. 저는 많은 경력을 쌓았왔습니다. 즉  딸이자 할머니이기도 합니다. 저는 학교 이사이자 시의원이었고 국회의원으로서 다양한 경력을 소유하고 있습니다.\n \n제 우선 순위는 확고합니다. 저는 아이들과 가족들을 우리 시의 핵심에 두고자 합니다. 20년 후가 아닌 지금 당장시민들이 보다 신속하게 이동할 수 있는 교통수단을 개발할 것입니다. 중소기업을 추진하여 더 많은 일자리를 창출하는데 앞장 설 것입니다. 이 모든 일을 공익 자본을 고려해가면서 추진해나갈 계획입니다.” \n\n \n"},{"ori_label":0,"name":"JOYFUL BRIDGE 묵상","description":"조이플 청년부 브릿지 셀장님들만의 묵상 페이지 입니다. 각 셀장들 끼리 하나님의 말씀을 함께 묵상해 봅시다."},{"ori_label":0,"name":"JOYFUL BRIDGE 예배준비팀","description":"JOYFUL BRIDGE 청년부 예배 준비팀!\n\n예배준비팀: 정현석 (김민경)\n찬양팀: 이수영\n새신자: 최민준 (이수현)\nPPT 슬라이드: 정현진\nPPT 제작: 조준용\n재정: 이성주\n친교간식: 구나영\n광고: 온재권 (이규평)\n이벤트: 이규평 (정다원)\n디자인: 박진원\n스포츠: 임수혁\n"},{"ori_label":0,"name":"Dan Jo appreciation group","description":"yes thats right everyones favorite korean has his own group now. Dan Jo the man who has no other describing word than great. He is so easy to stereotype and he comes out with the greatest comments at the greatest times. And we can peer pressure him into such thigs as dressing like a girl or running down a bowling alley."},{"ori_label":0,"name":"JOYFUL BRIDGE 블로그","description":"토론토 조이플 교회 청년부 BRIDGE!\n- 세대간을 연결하는 브릿지 청년부!\n\n이 그룹은 공개 페이지로 누구든지 조이플 브릿지의 뉴스를 보실수 있습니다"},{"ori_label":0,"name":"Overheard at Waterloo","description":"This is the place for the pieces of conversation that you overhear on UWaterloo campus that make you laugh, smile or just shake your head. So go ahead, share the love."},{"ori_label":0,"name":"Club That Really Likes Anime (CTRL-A)","description":"CTRL-A (Club That Really Likes Anime)\n\nCategory:\nInterest Groups - Clubs & Societies\n\nLike anime?  Love anime?  You've come to the right place!  We're the \"Club That Really Likes Anime,\" otherwise cleverly called CTRL-A, and we're located at University of Waterloo.  Which happens to be the buttons most often used for watching anime (select all and play! You gotta love marathons...).\n\nAnyone can join! We're one of the oldest clubs in the area, and you don't have to be a UW student to come to our events.\n\nWe are the club that will satisfy all your anime and gaming needs!  (At least most of them...a way of making anime characters jump out of the screen has not been discovered yet).\n\nWant to stalk us?  Check out our website:\nhttp:\/\/www.ctrl-a.org\/\n\nWant to get instant notifications of everything that is going on in the club?  Join our mailing list!  \nhttp:\/\/www.ctrl-a.org\/wp\/add-me-to-mailing-list\n \nEmail:\nctrl-a@ctrl-a.org\n\nIn person: \nCome to our Monday General Meetings! We don't bite. :D\n\nLocation:\nWaterloo, ON\n\n"},{"ori_label":0,"name":"Dasdap Private group","description":"Description. Reminds me of Conscription. "},{"ori_label":0,"name":"University of Waterloo","description":"This is an unofficial group for anyone and everyone associated with the University of Waterloo (students, faculty, alumni, etc.). Go Warriors! \n\nPlease note, this group is for content relating to the University of Waterloo. Any spam, unrelated advertisement or solicitation will be deleted and the user will be blocked. "},{"ori_label":0,"name":"Anime","description":"Lovers of Anime unite!\n\nThis group is about anything pertaining to anime, including related manga. Feel free to discuss plots and so on to your heart's content.\n\nTHIS GROUP IS *NOT* for advertising streaming sites, torrent sites, IRC, FTP, or other methods of illegal transfer.\n \n...nor is it for advertising whatever contests, groups, or websites you may be involved with.\n\nHuzzah for protoculture!\n\nDo not post yaoi >_< (or yuri or anything else like that...)."},{"ori_label":0,"name":"Compilation: Final Fantasy VII","description":"This is for those of you, who have always remained loyal to Final Fantasy VII, not because it is noted as the best 'ff', the game that really sparked the series and not because of all the fan-based hype...  This is for the fans who love 'vii' because when you became Cloud Strife in Midgar - you really became him.  You now hold his story (as well as his comrade's stories) in your heart for whatever reason it may be.  It's who you are.  \n\nThis is for the fans that love Cloud, not (only) because he is one hot bish... but because of who his character is. Tetsuya Nomura created Cloud to be weak, yet he is the hero. This is for those of us who believe that 'weak' characters can be heros too, and we would have Cloud be no other way.  Cloud is Cloud.\n\nThis is for the fans who played Final Fantasy VII over and over again and continue to play it now - even when technology has offered us new games with stunning graphics (eye candy!).  We are the fans who have been dreaming of remakes and sequels from the very beginning.  And now, Square Enix has granted our wishes by literally showering us with Final Fantasy VII fan service.  This group is devoted to the Compilation of Final Fantasy VII which is becoming a series of its own and to the fans who remain loyal it.\n\nAnd just so you are warned beforehand, this group is crawling with spoilers, juicy details, fan-hype, and rumors (whether they are true or not). Please be aware of this before you browse through the group.\n\nKeywords: Final Fantasy VII, FFVII, Final Fantasy 7, FF7, Final Fantasy VII: Advent Children, Before Crisis, Crisis Core, Dirge of Cerberus, Last Order, Lost Episode, Mimetic Legacy, Jenova, Sephioth, Cloud Strife, Tifa Lockhart, Barret Wallace, Cid Highwind, Nanaki \/ Redxiii, Vincent Valentine, Yuffie Kisaragi, Aeris \/ Aerith Gainsborough, Cait Sith, Hojo, Turks, ShinRa, Kadaj, Loz, Yazoo, Fenrir, Maiden who travels the Planet"}]